{
  "timestamp": "2025-05-31T00:15:01.217Z",
  "totalPosts": 5445,
  "potentialCrossposts": 34,
  "crosspostPercentage": 0.62,
  "findings": {
    "exactTitleMatches": 10,
    "similarTitles": 4,
    "exactContentMatches": 4,
    "repostPatterns": 6,
    "subredditMentions": 287
  },
  "detailedResults": {
    "exactTitleMatches": {
      "subreddit protest poll reddit is killing third party applications and itself": {
        "posts": [
          {
            "id": "14nk3gc",
            "title": "Subreddit Protest Poll (Reddit is killing third-party applications (and itself))",
            "imageType": null,
            "hasImage": false,
            "imageUrl": null,
            "comments": [
              {
                "score": 13,
                "author": "Jordangander",
                "created_utc": 1688212459,
                "id": "jq9080w",
                "body": "Requires sign in and account to even see the poll.\n\nAnd most likely like all the other polls doesn't allow voters to see results.\n\nIf the Admin of a Sub and the Moderators want to protest they should delete their accounts and go to another platform, not hold subs hostage from users.\n\nThey simply come across as entitled children screaming that if they can't have things their way they are taking their things and leaving."
              },
              {
                "created_utc": 1688198975,
                "score": 6,
                "id": "jq8jfey",
                "author": "Flesroy",
                "body": "Not even an option to do nothing lol. If you cant moderate, just leave."
              },
              {
                "author": "lilkippers",
                "score": 2,
                "body": "For some reason it's not letting me make any selections. The only fields I can do anything in is the other. None of the links or buttons work either.",
                "created_utc": 1688232843,
                "id": "jqa6yw8"
              }
            ],
            "subreddit": "entitledparents",
            "url": "https://reddit.com/r/entitledparents/comments/14nk3gc/subreddit_protest_poll_reddit_is_killing/",
            "thumbnail": null,
            "body": "Recommended listening: [Radioactive by Imagine Dragons](https://music.youtube.com/watch?v=3Yb2-CWjrME)\n\nI meant to make this earlier in the week and then this morning (with a “Dawn of the Final Day'' joke) but that didn’t end up happening as I’ve been busy and my surgery headaches backslid a bit (They’ve been better though!) Context for what’s going on is in my previous post for those who missed it or are new to this discussion on r/EntitledParents: [\"Happy Birthday to Me, I guess (The State of the Sub)\"](https://www.reddit.com/r/IDontWorkHereLady/comments/13y4hf5/happy_birthday_to_me_i_guess_the_state_of_the_sub/)\n\nSo, Reddit’s actually going through with it. Third-party apps are getting spotty and sometime today or tomorrow I’m sure they’ll be completely cut off. If you’re not disappointed by this, you’re missing the point. Reddit claims that only 3% of users use third-party apps but what that statistic glosses over is that only about 10% of users comment on posts made by an even smaller 1% of the user base. Moderators are an even tinier fraction. In the coming months, expect to see a general decline in the quality of the site as long-time posters are driven away and the scabs that the admins use to replace the protesting “landed gentry” (a.k.a. What Spez calls mods who know what they’re doing) moderate poorly or are simply spread too thin.\n\nAnyway, on the heart of the matter: the admins have made it clear that things will be changing, whether we like it or not. Here’s your chance to influence how: [https://forms.gle/LAXPvcncoNofBPUR9](https://forms.gle/LAXPvcncoNofBPUR9)  \n\n\nEdit: Leave entries blank for a 'no' entry, spam will be filtered out.",
            "category": "drama",
            "permalink": "/r/entitledparents/comments/14nk3gc/subreddit_protest_poll_reddit_is_killing/",
            "scraped_at": "2025-05-30T00:29:06.625Z",
            "num_comments": 19,
            "author": "Aidoboy",
            "created_utc": 1688181094,
            "score": 56
          },
          {
            "id": "14nk48i",
            "permalink": "/r/EntitledPeople/comments/14nk48i/subreddit_protest_poll_reddit_is_killing/",
            "subreddit": "EntitledPeople",
            "title": "Subreddit Protest Poll (Reddit is killing third-party applications (and itself))",
            "category": "drama",
            "scraped_at": "2025-05-30T04:48:28.631Z",
            "hasImage": false,
            "num_comments": 6,
            "comments": [
              {
                "author": "Vaseline_fly",
                "score": 16,
                "id": "jqaphco",
                "created_utc": 1688240815,
                "body": "Mods are ruining the community more than the api changes ever will. You want to protest then get off reddit and leave the rest of us out of it."
              },
              {
                "created_utc": 1742372036,
                "id": "mil1avh",
                "body": "?",
                "score": 2,
                "author": "Silverrage1"
              }
            ],
            "created_utc": 1688181166,
            "url": "https://reddit.com/r/EntitledPeople/comments/14nk48i/subreddit_protest_poll_reddit_is_killing/",
            "imageUrl": null,
            "score": 71,
            "author": "Aidoboy",
            "body": "",
            "thumbnail": null,
            "imageType": null
          }
        ],
        "subreddits": [
          "entitledparents",
          "EntitledPeople"
        ],
        "count": 2
      },
      "threaten my friend with revenge porn i ll ruin your whole damn life": {
        "posts": [
          {
            "id": "1bvc3bk",
            "comments": [
              {
                "id": "kxyhiu6",
                "body": "I feel like you win 2024.\n\nLegit revenge - check\n\nPerson's life now super fucked - check\n\nDone in record time - Also check",
                "created_utc": 1712198960,
                "author": "rengamez",
                "score": 4413
              },
              {
                "id": "kxyh31i",
                "created_utc": 1712198779,
                "body": "That's some r/nuclearrevenge and I am all for it",
                "author": "slightly_illegal",
                "score": 1007
              },
              {
                "id": "kxyhs5e",
                "author": "Atypicosaurus",
                "score": 719,
                "created_utc": 1712199069,
                "body": "I'm really curious of his face next day when HR calls him in."
              }
            ],
            "hasImage": false,
            "subreddit": "ProRevenge",
            "permalink": "/r/ProRevenge/comments/1bvc3bk/threaten_my_friend_with_revenge_porn_ill_ruin/",
            "imageType": null,
            "thumbnail": null,
            "score": 11673,
            "imageUrl": null,
            "created_utc": 1712198231,
            "category": "revenge",
            "num_comments": 480,
            "author": "furtherdimensions",
            "scraped_at": "2025-05-30T07:33:32.581Z",
            "body": "My very good friend made...some slightly dumb mistakes and sent some pictures to someone that she reasonably thought she could trust, but not knowing much more than than his first name, his screen name, and roughly where he lived and the type of work he did.  He is not in our country but had indicated that he would be traveling for work to near us shortly, and they had made some plans to meet.\n\nAnd when she got some red flags and backed out, the dude threatened to publish these pictures online.\n\nI am, incidentally, an attorney.\n\nSo, some searching later, and gathering up any pictures he sent her of him, that could possibly identify him, his online handle let me to a TikTok page, which lead me to an instagram page with his name on it.\n\nThat lead to a linkedin page with his place of work that matched a picture he sent with a branded polo he was wearing.\n\nSome more searched got me the email of the CEO, VP of HR, operations manager, and public relations manager.\n\nI just fired off an email on behalf of *my client* of the screenshots of him threatening revenge porn, snippets of the conversation showing that username while he sent that exact picture of him wearing his company's branded apparel, links to how I know it's him, along with pictures he sent her of his motorcycle with the license plate showing, as further proof it is him.  I also included screenshots of him discussing a workplace incident that were time stamped, along with pieces of dialogue discussing how he had sex with an ex at his place of work, and discussing plans to have sex with her in his office as well.\n\nI also included a picture he sent her showing his work laptop with his entire outlook calendar, along with proprietary information (which he sent to \"prove he was busy\") along with other pictures he took of his workplace with non-consenting employees.\n\nI further informed his employer that I will be forwarding all this information to local (to them) law enforcement and since he had indicated that he would be traveling to the United States soon, will also forward this to the local office of the Federal Bureau of Investigation as, since *my client* is a US citizen on US soil, these threats constituted a federal crime.  So that should they continue with his employment, and continue with their plans to send him to the United State for work, I will ensure, on behalf of *my client* that federal law enforcement is waiting for him on arrival.  Which I will do, as one of the assistant US attorney's for this region is a law school buddy of mine.  \n\nSince I have his license plate # I know where he lives, and will be contacting his local authorities tomorow.\n\nYou dumb mother fucker thinking you were hiding around anonymity thinking you could threaten ***my friend***?  It took me 45 minutes to destroy your life.",
            "title": "Threaten my friend with revenge porn? I'll ruin your whole damn life.",
            "url": "https://reddit.com/r/ProRevenge/comments/1bvc3bk/threaten_my_friend_with_revenge_porn_ill_ruin/"
          },
          {
            "id": "1bvc68q",
            "permalink": "/r/NuclearRevenge/comments/1bvc68q/threaten_my_friend_with_revenge_porn_ill_ruin/",
            "url": "https://reddit.com/r/NuclearRevenge/comments/1bvc68q/threaten_my_friend_with_revenge_porn_ill_ruin/",
            "author": "furtherdimensions",
            "hasImage": false,
            "imageType": null,
            "body": "My very good friend made...some slightly dumb mistakes and sent some pictures to someone that she reasonably thought she could trust, but not knowing much more than than his first name, his screen name, and roughly where he lived and the type of work he did.  He is not in our country but had indicated that he would be traveling for work to near us shortly, and they had made some plans to meet.\n\nAnd when she got some red flags and backed out, the dude threatened to publish these pictures online.\n\nI am, incidentally, an attorney.\n\nSo, some searching later, and gathering up any pictures he sent her of him, that could possibly identify him, his online handle let me to a TikTok page, which lead me to an instagram page with his name on it.\n\nThat lead to a linkedin page with his place of work that matched a picture he sent with a branded polo he was wearing.\n\nSome more searches got me the email of the CEO, VP of HR, operations manager, and public relations manager.\n\nI just fired off an email on behalf of my client of the screenshots of him threatening revenge porn, snippets of the conversation showing that username while he sent that exact picture of him wearing his company's branded apparel, links to how I know it's him, along with pictures he sent her of his motorcycle with the license plate showing, as further proof it is him.  I also included screenshots of him discussing a workplace incident that were time stamped, along with pieces of dialogue discussing how he had sex with an ex at his place of work, and discussing plans to have sex with her in his office as well.\n\nI also included a picture he sent her showing his work laptop with his entire outlook calendar, along with proprietary information (which he sent to \"prove he was busy\") along with other pictures he took of his workplace with non-consenting employees.\n\nI further informed his employer that I will be forwarding all this information to local (to them) law enforcement and since he had indicated that he would be traveling to the United States soon, will also forward this to the local office of the Federal Bureau of Investigation as, since my client is a US citizen on US soil, these threats constituted a federal crime.  So that should they continue with his employment, and continue with their plans to send him to the United State for work, I will ensure, on behalf of my client that federal law enforcement is waiting for him on arrival.  Which I will do, as one of the assistant US attorney's for this region is a law school buddy of mine.\n\nSince I have his license plate # I know where he lives, and will be contacting his local authorities tomorow.\n\nYou dumb mother fucker thinking you were hiding around anonymity thinking you could threaten my friend?  It took me 45 minutes to destroy your life.",
            "thumbnail": null,
            "title": "Threaten my friend with revenge porn? I'll ruin your whole damn life.",
            "score": 6132,
            "num_comments": 324,
            "imageUrl": null,
            "subreddit": "NuclearRevenge",
            "scraped_at": "2025-05-30T07:35:02.397Z",
            "created_utc": 1712198462,
            "comments": [
              {
                "author": "MyChoiceNotYours",
                "body": "Please keep us updated because damn I do love karma",
                "score": 2329,
                "id": "kxyhudj",
                "created_utc": 1712199095
              },
              {
                "author": "PB111",
                "created_utc": 1712198879,
                "score": 967,
                "id": "kxyhbtm",
                "body": "jeans meeting smell intelligent fall rock merciful include market tan\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*"
              },
              {
                "author": "nick5th",
                "created_utc": 1712199109,
                "body": "holy testicle tuesday batman",
                "id": "kxyhvjd",
                "score": 559
              }
            ],
            "category": "revenge"
          }
        ],
        "subreddits": [
          "ProRevenge",
          "NuclearRevenge"
        ],
        "count": 2
      },
      "we did it": {
        "posts": [
          {
            "id": "1fw4o5s",
            "imageUrl": null,
            "scraped_at": "2025-05-30T04:47:27.569Z",
            "score": 635,
            "url": "https://reddit.com/r/wedding/comments/1fw4o5s/we_did_it/",
            "category": "wedding",
            "subreddit": "wedding",
            "comments": [
              {
                "id": "lqbyw4g",
                "created_utc": 1728063249,
                "score": 90,
                "author": "EARANIN2",
                "body": "I NEED to see more pics of this dress! It's STUNNING! Congratulations!"
              },
              {
                "author": "Bleh10290",
                "created_utc": 1728063707,
                "body": "Oh…. My…. GOD. \n\nAs a florist; whoever made your bouquet was absolutely lucky to witness seeing you in person. \n\nThe dress, the background, your husband, your hair color, ALL. \n\nAbsolutely stunning. \nYou absolutely killed it. \n\n🤌🤌🤌 \n\nCongratulations to you both!!!! ❤️❤️❤️",
                "id": "lqc0bdc",
                "score": 40
              },
              {
                "id": "lqbyrak",
                "author": "TravelingBride2024",
                "score": 13,
                "body": "That dress is AMAZING!",
                "created_utc": 1728063206
              }
            ],
            "thumbnail": null,
            "permalink": "/r/wedding/comments/1fw4o5s/we_did_it/",
            "imageType": null,
            "hasImage": false,
            "title": "We did it!!!!",
            "author": "TacoBellFourthMeal",
            "body": "October 3 2024. Moab Utah",
            "created_utc": 1728062628,
            "num_comments": 40
          },
          {
            "id": "1g5zzyb",
            "score": 497,
            "subreddit": "weddingplanning",
            "thumbnail": null,
            "permalink": "/r/weddingplanning/comments/1g5zzyb/we_did_it/",
            "imageType": null,
            "title": "We did it!!!(:",
            "num_comments": 37,
            "scraped_at": "2025-05-30T04:45:33.018Z",
            "comments": [
              {
                "author": "Worldly-Heart9969",
                "created_utc": 1729218206,
                "body": "congratulations!! I LOVE YOUR DRESS!!! Do you mind sharing what it is?!",
                "id": "lsgspg0",
                "score": 22
              },
              {
                "id": "lshqlyk",
                "body": "I came from the “cake” post and girl, you are STUNNING. Congratulations, and cheers to a long and happy marriage! ♥️♥️",
                "score": 10,
                "author": "[deleted]",
                "created_utc": 1729235854
              },
              {
                "author": "cat-napper",
                "score": 10,
                "id": "lsh4p3f",
                "body": "I just started following this venue on instagram and it’s amazing!",
                "created_utc": 1729223274
              },
              {
                "score": 7,
                "id": "lsh4hg5",
                "author": "CHIMERIQUES",
                "created_utc": 1729223173,
                "body": "This is a whole vibe and I love it!! Congratulations!!"
              }
            ],
            "created_utc": 1729195410,
            "imageUrl": null,
            "hasImage": false,
            "url": "https://reddit.com/r/weddingplanning/comments/1g5zzyb/we_did_it/",
            "category": "wedding",
            "author": "Mysterious-Variety28",
            "body": ""
          }
        ],
        "subreddits": [
          "wedding",
          "weddingplanning"
        ],
        "count": 2
      },
      "10 years of marriage lessons i wish i d known from the start": {
        "posts": [
          {
            "id": "1ggu5l1",
            "score": 161,
            "scraped_at": "2025-05-30T08:11:58.878Z",
            "body": "Hello everyone,\n\nAfter a 10-year marriage that ultimately ended in divorce, I found myself reflecting on the entire journey—what went right, what went wrong, and all the lessons that could have made a difference. I spoke with a few people, both men and women, and it hit me: many people are searching for a spouse but may not fully understand the depth of what marriage truly is.\n\nI’m sharing my experiences here, not to discourage anyone but to shed light on what I wish I’d known. Hopefully, these insights will be helpful to anyone seriously considering marriage or looking to strengthen their current relationship.\n\n**1. Intentions Matter More Than We Realize**\n\nWhen I first got married, I thought love alone would carry us through anything. But over the years, I realized that the foundation of a relationship isn’t just emotions; it’s intentions. Having clear, shared intentions from the beginning what we both wanted from life, our values, our commitment to support each other would have helped us steer through the tougher times. Start your marriage with sincerity and know why you’re committing to each other.\n\n**2. Don’t Overlook Small Acts of Kindness**\n\nIt’s easy to assume that grand gestures will keep the spark alive, but I found that small, consistent acts of kindness build a stronger bond over time. A gentle word, a little patience, or even just a smile after a long day speaks volumes. The daily, quiet kindnesses we often overlook are the glue that holds everything together. Over time, I think we forgot this, focusing too much on what wasn’t working rather than nurturing each other in small ways.\n\n**3. Communication is Hard, But it’s the Backbone**\n\nPeople say “communicate” all the time, but let’s be real—it’s not as easy as it sounds. For years, I didn’t know how to express my feelings without holding back or without frustration. We had different communication styles, which sometimes made us feel worlds apart. I learned that communication is a skill you work on continuously. It means being honest, patient, and humble enough to listen without ego. If I had practiced this earlier, maybe we could’ve navigated conflicts better.\n\n**4. Value Growth in Yourself and Each Other**\n\nOne of my biggest regrets is that we didn’t focus on growing together as individuals. Marriage should be a journey where you’re both evolving, learning, and pushing each other towards personal betterment. I learned too late that a healthy marriage is one where each person is supportive of the other’s growth not threatened by it. If you see your partner growing, encourage them. Celebrate their wins, and let them do the same for you.\n\n**5. Don’t Carry Resentments; Address Them Early**\n\nOver time, small grievances and unspoken feelings can turn into resentment. I let issues pile up, hoping they’d resolve on their own, but they rarely do. When you let them fester, they turn into silent barriers. Now I know that when something bothers you, you need to bring it up respectfully and work through it together. An open heart, no matter how difficult the conversation, will save you so much pain down the line.\n\n**6. Understand That It’s Not Always About Winning**\n\nLooking back, I wish I had focused less on being “right” and more on understanding my partner’s perspective. Sometimes, in the heat of disagreements, I felt the need to prove my point, and it drove a wedge between us. Remember that you and your spouse are on the same team. There’s no winning if it comes at the cost of peace in your relationship.\n\n**7. Patience and Forgiveness Are Your Best Friends**\n\nMarriage is full of moments where you’ll need patience and forgiveness. There were times when I was quick to point out flaws and mistakes, but rarely stopped to think about the effect of my words. Learning to forgive genuinely—not holding grudges—is key to a peaceful relationship. Forgiveness doesn’t mean ignoring what hurt you; it means choosing to move forward without bitterness.\n\n**8. Remember That Faith is a Guiding Light**\n\nThroughout my journey, the principles of patience, compassion, and mutual respect kept me grounded. Whether it was enduring hardships, finding compassion during disagreements, or simply reminding myself of the blessings we shared, my faith reminded me of a bigger picture. Leaning on these values, even in the hardest times, gave me peace and perspective.\n\n**My Takeaway**\n\nWhile my marriage ultimately ended, I carry these lessons with me. I hope sharing them can help anyone else out there trying to build or sustain a marriage. Every relationship has its ups and downs, and none of us are perfect, but we can always learn from each other.\n\nIf there’s one thing I’d say to anyone getting married or working through marital challenges, it’s this: cherish and respect each other, forgive easily, and grow together. Because even if things don’t work out in the end, at least you’ll know you did your best.",
            "comments": [
              {
                "body": "&gt;\"**5. Don’t Carry Resentments; Address Them Early**\n\nOver time, small grievances and unspoken feelings can turn into resentment. I let issues pile up, hoping they’d resolve on their own, but they rarely do. When you let them fester, they turn into silent barriers. Now I know that when something bothers you, you need to bring it up respectfully and work through it together. An open heart, no matter how difficult the conversation, will save you so much pain down the line.\"\n\n  \nThis part here hits so strongly for me. Those small resentments kind of slowly creep up on you... Until it explodes and you are wondering how on earth did we get here and things end up this bad. The way you worded this was very beautifully said. It feels like an emotional impact was made from your experience when I read your lesson number 5. \n\n&gt;\"There were times when I was quick to point out flaws and mistakes, but rarely stopped to think about the effect of my words.\"\n\nAs you said in this bullet point. love",
                "score": 18,
                "id": "lusikqs",
                "created_utc": 1730424552,
                "author": "Markie199711"
              },
              {
                "author": "MaleficentMousse7473",
                "id": "lusqmnf",
                "score": 7,
                "body": "There is so much wisdom here. Thank you for sharing your deep reflections with us. Your next marriage, should you choose it, will benefit greatly.\n\nThe small kindnesses resonates a lot with me. My marriage has small kindnesses and it is definitely a huge comfort. Long stretches of disinterest or unkindness with a surprise grand gesture just make for uncertainty and stress",
                "created_utc": 1730427696
              },
              {
                "id": "lusihol",
                "created_utc": 1730424520,
                "score": 5,
                "body": "My stbx carried so much resentment that I didn’t know about. Had he told me I would’ve fixed things.",
                "author": "AmaltheaDreams"
              },
              {
                "body": "I needed this today.  Today my relationship has ended and it's for the best but this will help keep me guided for the future.",
                "created_utc": 1730434084,
                "id": "lut55mq",
                "score": 4,
                "author": "Thoughts-AndPrayers"
              },
              {
                "author": "[deleted]",
                "id": "lutdqmp",
                "score": 3,
                "created_utc": 1730438886,
                "body": "Thank you 🙏"
              }
            ],
            "permalink": "/r/LifeAdvice/comments/1ggu5l1/10_years_of_marriage_lessons_i_wish_id_known_from/",
            "imageUrl": null,
            "num_comments": 17,
            "category": "advice",
            "author": "Zestyclose_Flow_680",
            "thumbnail": null,
            "created_utc": 1730423653,
            "title": "10 Years of Marriage: Lessons I Wish I'd Known from the Start",
            "imageType": null,
            "url": "https://reddit.com/r/LifeAdvice/comments/1ggu5l1/10_years_of_marriage_lessons_i_wish_id_known_from/",
            "hasImage": false,
            "subreddit": "LifeAdvice"
          },
          {
            "id": "1ghu2sd",
            "author": "Zestyclose_Flow_680",
            "scraped_at": "2025-05-30T08:00:41.655Z",
            "hasImage": false,
            "permalink": "/r/DecidingToBeBetter/comments/1ghu2sd/10_years_of_marriage_lessons_i_wish_id_known_from/",
            "subreddit": "DecidingToBeBetter",
            "num_comments": 36,
            "url": "https://reddit.com/r/DecidingToBeBetter/comments/1ghu2sd/10_years_of_marriage_lessons_i_wish_id_known_from/",
            "title": "10 Years of Marriage: Lessons I Wish I'd Known from the Start",
            "score": 833,
            "category": "advice",
            "body": "Hello everyone,\n\nAfter a 10-year marriage that ultimately ended in divorce, I found myself reflecting on the entire journey—what went right, what went wrong, and all the lessons that could have made a difference. I spoke with a few people, both men and women, and it hit me: many people are searching for a spouse but may not fully understand the depth of what marriage truly is.\n\nI’m sharing my experiences here, not to discourage anyone but to shed light on what I wish I’d known. Hopefully, these insights will be helpful to anyone seriously considering marriage or looking to strengthen their current relationship.\n\n**1. Intentions Matter More Than We Realize**\n\nWhen I first got married, I thought love alone would carry us through anything. But over the years, I realized that the foundation of a relationship isn’t just emotions; it’s intentions. Having clear, shared intentions from the beginning what we both wanted from life, our values, our commitment to support each other would have helped us steer through the tougher times. Start your marriage with sincerity and know why you’re committing to each other.\n\n**2. Don’t Overlook Small Acts of Kindness**\n\nIt’s easy to assume that grand gestures will keep the spark alive, but I found that small, consistent acts of kindness build a stronger bond over time. A gentle word, a little patience, or even just a smile after a long day speaks volumes. The daily, quiet kindnesses we often overlook are the glue that holds everything together. Over time, I think we forgot this, focusing too much on what wasn’t working rather than nurturing each other in small ways.\n\n**3. Communication is Hard, But it’s the Backbone**\n\nPeople say “communicate” all the time, but let’s be real—it’s not as easy as it sounds. For years, I didn’t know how to express my feelings without holding back or without frustration. We had different communication styles, which sometimes made us feel worlds apart. I learned that communication is a skill you work on continuously. It means being honest, patient, and humble enough to listen without ego. If I had practiced this earlier, maybe we could’ve navigated conflicts better.\n\n**4. Value Growth in Yourself and Each Other**\n\nOne of my biggest regrets is that we didn’t focus on growing together as individuals. Marriage should be a journey where you’re both evolving, learning, and pushing each other towards personal betterment. I learned too late that a healthy marriage is one where each person is supportive of the other’s growth not threatened by it. If you see your partner growing, encourage them. Celebrate their wins, and let them do the same for you.\n\n**5. Don’t Carry Resentments; Address Them Early**\n\nOver time, small grievances and unspoken feelings can turn into resentment. I let issues pile up, hoping they’d resolve on their own, but they rarely do. When you let them fester, they turn into silent barriers. Now I know that when something bothers you, you need to bring it up respectfully and work through it together. An open heart, no matter how difficult the conversation, will save you so much pain down the line.\n\n**6. Understand That It’s Not Always About Winning**\n\nLooking back, I wish I had focused less on being “right” and more on understanding my partner’s perspective. Sometimes, in the heat of disagreements, I felt the need to prove my point, and it drove a wedge between us. Remember that you and your spouse are on the same team. There’s no winning if it comes at the cost of peace in your relationship.\n\n**7. Patience and Forgiveness Are Your Best Friends**\n\nMarriage is full of moments where you’ll need patience and forgiveness. There were times when I was quick to point out flaws and mistakes, but rarely stopped to think about the effect of my words. Learning to forgive genuinely—not holding grudges—is key to a peaceful relationship. Forgiveness doesn’t mean ignoring what hurt you; it means choosing to move forward without bitterness.\n\n**8. Remember That Faith is a Guiding Light**\n\nThroughout my journey, the principles of patience, compassion, and mutual respect kept me grounded. Whether it was enduring hardships, finding compassion during disagreements, or simply reminding myself of the blessings we shared, my faith reminded me of a bigger picture. Leaning on these values, even in the hardest times, gave me peace and perspective.\n\n**My Takeaway**\n\nWhile my marriage ultimately ended, I carry these lessons with me. I hope sharing them can help anyone else out there trying to build or sustain a marriage. Every relationship has its ups and downs, and none of us are perfect, but we can always learn from each other.\n\nIf there’s one thing I’d say to anyone getting married or working through marital challenges, it’s this: cherish and respect each other, forgive easily, and grow together. Because even if things don’t work out in the end, at least you’ll know you did your best.",
            "imageType": null,
            "thumbnail": null,
            "comments": [
              {
                "id": "lv01uwc",
                "created_utc": 1730546146,
                "body": "Thank you for putting this down here, I wish you all the best for the future.",
                "author": "-Intronaut-",
                "score": 119
              },
              {
                "author": "maasd",
                "created_utc": 1730559470,
                "id": "lv0xdyx",
                "score": 46,
                "body": "I’m so happy for you that you have learned from this experience. My first marriage ended in divorce and while I could have blamed my ex, I spent a long time reflecting on what went wrong, my role in that, and how I would grow and change in my next relationship. I’m now extremely happy married a second time for 9 years and I’m so glad I didn’t immediately jump into a relationship right after my first marriage ended. \n\nPlease, if your serious relationship ends take your time to really deeply reflect and process and figure out how you can grow before diving back in and making the same mistakes. Even if you feel it was the other person’s fault, you may have played a role in allowing things to happen or go unchecked the way they did.\n\nTo add to OP’s points, it’s not only compatible intentions but compatible dispositions and personalities. Do you know what you need from your partner emotionally and personality wise to have your best life? If you don’t fully know this, pump the brakes before "
              },
              {
                "created_utc": 1730586813,
                "body": "Thanks ChatGPT.",
                "score": 27,
                "author": "niceguyted",
                "id": "lv38tem"
              },
              {
                "id": "lv0c6a0",
                "author": "CropTopKitten",
                "created_utc": 1730551471,
                "score": 22,
                "body": "Great lessons! I saved your post. \n\nMy marriage was physically abusive, so it could not have been saved. However, I also went into marriage just thinking about feelings and not actions, as in “emotions are the foundation for everything.” If I felt love, then everything would be okay with marriage. \n\nWhen my husband started abusing me, I stopped feeling love for him. As a result, I blamed myself. I thought that because I couldn’t feel love for him, that I was single handedly destroying my marriage. He also said as much. \n\nI saw my dad treat my mom in all sorts of terrible ways, but she would always end up saying how much she loved him. I learned that if you just keep loving someone, then that’s a “successful” marriage.\n\nIt’s crazy that nobody ever explained to me about all of the many, many actions that are required to actually make a marriage work."
              }
            ],
            "created_utc": 1730545818,
            "imageUrl": null
          }
        ],
        "subreddits": [
          "LifeAdvice",
          "DecidingToBeBetter"
        ],
        "count": 2
      },
      "your body my choice": {
        "posts": [
          {
            "id": "1gmfl1e",
            "created_utc": 1731062075,
            "comments": [
              {
                "score": 2488,
                "body": "I'd be humiliated as a father if either of my sons ever said such a thing.",
                "author": "Anishinaapunk",
                "created_utc": 1731064455
              },
              {
                "score": 2101,
                "author": "DoNotReply111",
                "body": "And yet these were the loudest complainers when people chose the bear.",
                "created_utc": 1731064638
              },
              {
                "score": 1881,
                "created_utc": 1731066384,
                "body": "The Nick Fuentes rant was the scariest shit I've seen in a long time. To think men actually admire this waste of space is beyond me. I hope he trips in traffic.",
                "author": "10000nails"
              },
              {
                "created_utc": 1731071636,
                "score": 1330,
                "author": "blueorchidnotes",
                "body": "Old white man here. From what I’ve seen, the men with this mentality are the men who are most dependent on woman for the necessities of their lives. The income from higher educational attainment. Their food. A sanitary living space. Pushing them to maintain relationships with family and friends. Taking care of children. Making doctor appointments. They base their entire sense of identity and self worth on women. \n\nI suggest women stop providing these things. \n\nWhat this society lacks, and has si"
              }
            ],
            "imageUrl": null,
            "body": "What the actual fuck is that about? I just can’t believe these words are coming out of certain men’s mouths!! It’s fucking vile.\n\nI literally saw a post on twitter where a guy said “Your body my choice” and a girl replied with “we just won’t let you impregnate us” to which another man replied with some shit like “we don’t need your permission”. Like WHAT THE ACTUAL FUCK? \n\nDo people actually think this is funny? Do you think it’s fucking funny that women, who were already wary of men, are now fucking terrified of them?? \n\nDo these men not care about their mothers? Their grandmothers, sisters, aunts, nieces? Their DAUGHTERS??\n\nFuck (not in the way they’d like you to) every man who has said this, thought about saying this and is thinking about acting on this. \n\nYou will NEVER be entitled to a woman’s body. EVER.\n\nEdit: I used twitter as an example because that is where I personally saw the comment where men were bragging about having ownership over a woman’s body. If you read the many comments below you will see that these comments are NOT only being said online, they are being said to women in the real world too. \n\nSo to all those people suggesting that women should “delete their social media accounts” or just simply “ignore the trolling” please do give suggestions on how to do that in real life situations as-well.",
            "title": "“YOUR body MY choice”",
            "num_comments": 838,
            "author": "Sorry-Thing7797",
            "subreddit": "offmychest",
            "thumbnail": null,
            "hasImage": false,
            "url": "https://reddit.com/r/offmychest/comments/1gmfl1e/your_body_my_choice/",
            "scraped_at": 1748572267857,
            "imageType": null,
            "category": "stories",
            "score": 5599
          },
          {
            "id": "1goxa4i",
            "hasImage": false,
            "category": "morality",
            "imageType": null,
            "subreddit": "AmITheDevil",
            "score": 1092,
            "scraped_at": "2025-05-30T07:29:48.626Z",
            "created_utc": 1731344982,
            "author": "[deleted]",
            "permalink": "/r/AmITheDevil/comments/1goxa4i/your_body_my_choice/",
            "comments": [
              {
                "created_utc": 1731345689,
                "author": "LadyBug_0570",
                "id": "lwlx996",
                "score": 1598,
                "body": "Do people who think this is \"just a joke\" realize it's a rapist joke?"
              },
              {
                "body": "Pro tip, rape threats are not funny jokes. EVER! Especially not when it’s your husband threatening your sister because she disagrees with you politically.",
                "score": 1146,
                "author": "valosin",
                "created_utc": 1731345531,
                "id": "lwlwqoa"
              },
              {
                "score": 813,
                "created_utc": 1731345420,
                "author": "BigNutDroppa",
                "body": "&gt; …politics is not worth destroying our relationship\n\nThat statement cannot be more wrong these days. When you support someone that actively wants to destroy the rights of people, especially women, I’m not going to let you in my life. \n\nYou made the bed, lie in it.",
                "id": "lwlwdv2"
              }
            ],
            "imageUrl": null,
            "num_comments": 613,
            "title": "Your body, my choice. ",
            "body": "",
            "thumbnail": null,
            "url": "https://reddit.com/r/AmITheDevil/comments/1goxa4i/your_body_my_choice/"
          }
        ],
        "subreddits": [
          "offmychest",
          "AmITheDevil"
        ],
        "count": 2
      },
      "i graduated 10 19 24": {
        "posts": [
          {
            "id": "1gmjinj",
            "author": "funnynanonymous",
            "subreddit": "weddingplanning",
            "imageType": null,
            "scraped_at": "2025-05-30T04:44:44.442Z",
            "comments": [
              {
                "author": "caprica6ixx",
                "created_utc": 1731088081,
                "body": "These pictures are so beautiful! Love the genuine smiles/laughter and silliness. Congratulations!!",
                "score": 32,
                "id": "lw448l5"
              },
              {
                "id": "lw4de21",
                "author": "LitwickLitten",
                "created_utc": 1731090754,
                "score": 16,
                "body": "Literally gasped at that aisle kiss pic. You two look like queens. Congratulations!"
              },
              {
                "created_utc": 1731092154,
                "body": "You’re venue is gorgeous! And you both looking amazing as well!",
                "author": "julianna96",
                "score": 7,
                "id": "lw4i64e"
              },
              {
                "body": "YOU TWO LOOK SO HAPPY!!! May all of us Wedditors be so lucky to have such wide smiles on our big day 🫶 😍",
                "id": "lw593sh",
                "author": "WeeLittleParties",
                "score": 5,
                "created_utc": 1731100282
              },
              {
                "id": "lw65r6b",
                "body": "The way I excitedly shouted \"BRIDES!\" the second I saw this post lol\nYou both look stunning, and your happiness radiates thru your pictures.",
                "author": "SkitAWulf",
                "created_utc": 1731111037,
                "score": 3
              }
            ],
            "category": "wedding",
            "imageUrl": null,
            "title": "I graduated!! 10.19.24",
            "body": "We just got these sneak peaks from our photographer and had to share! We got married at the New York Botanical Gardens. \n\nMy anxiety is always around but for the wedding, especially as it approached, it went sky high. My anxiety helped me though because I imagined every horrible scenario and nothing horribly bad happened. We did have a scare the day before the wedding that 2 of our bags had been stolen in our apartment building but we found them. \n\nThe day went relatively smoothly! Only a couple things went wrong but honestly by the time the day was here I was so depleted I couldn’t be bothered to be upset. I was incredibly anxious on the day trying to make sure the morning went smoothly with everyone getting ready and mingling and it did.\n\nGood luck to all the future brides out there!! ",
            "thumbnail": null,
            "hasImage": false,
            "num_comments": 35,
            "score": 643,
            "permalink": "/r/weddingplanning/comments/1gmjinj/i_graduated_101924/",
            "created_utc": 1731075389,
            "url": "https://reddit.com/r/weddingplanning/comments/1gmjinj/i_graduated_101924/"
          },
          {
            "id": "1gmkoni",
            "score": 531,
            "thumbnail": null,
            "comments": [
              {
                "score": 16,
                "author": "YouveGotMail920",
                "body": "Congratulations! You both look beautiful 🥰",
                "created_utc": 1731080086,
                "id": "lw3cr69"
              },
              {
                "id": "lw3ltrc",
                "score": 5,
                "author": "HRH_Sarina",
                "body": "Stunning location!",
                "created_utc": 1731082750
              },
              {
                "id": "lw3qfjf",
                "body": "Congratulations!!! I love, love love the dresses!",
                "created_utc": 1731084085,
                "score": 6,
                "author": "Pugloaf1"
              },
              {
                "created_utc": 1731083342,
                "author": "spookiecake",
                "id": "lw3nv1b",
                "body": "Pictures 3, 4, and 5 are breathtaking! Congratulations!",
                "score": 4
              }
            ],
            "subreddit": "wedding",
            "author": "funnynanonymous",
            "category": "wedding",
            "scraped_at": "2025-05-30T04:47:49.221Z",
            "imageType": null,
            "hasImage": false,
            "imageUrl": null,
            "body": "",
            "permalink": "/r/wedding/comments/1gmkoni/i_graduated_101924/",
            "url": "https://reddit.com/r/wedding/comments/1gmkoni/i_graduated_101924/",
            "title": "I graduated! 10.19.24",
            "created_utc": 1731078511,
            "num_comments": 50
          }
        ],
        "subreddits": [
          "weddingplanning",
          "wedding"
        ],
        "count": 2
      },
      "husband 37m attempted to manipulate me 35f i called his bluff now what": {
        "posts": [
          {
            "id": "1h1alyu",
            "permalink": "/r/relationship_advice/comments/1h1alyu/husband_37m_attempted_to_manipulate_me_35f_i/",
            "url": "https://reddit.com/r/relationship_advice/comments/1h1alyu/husband_37m_attempted_to_manipulate_me_35f_i/",
            "score": 8769,
            "subreddit": "relationship_advice",
            "thumbnail": null,
            "title": "Husband, 37M, attempted to manipulate me, 35F. I called his bluff. Now what?",
            "post_type": "top_year",
            "author": "ThrowRABluffCalled",
            "hasImage": false,
            "category": "advice",
            "imageUrl": null,
            "created_utc": 1732730666,
            "scraped_at": "2025-05-30T00:36:00.535Z",
            "comments": [
              {
                "id": "lza1mur",
                "score": 13681,
                "author": "Champion_Flight",
                "body": "He's not just manipulating you - he's exploiting you. You're carrying the financial burden, all household responsibilities, childcare, AND he tried to use divorce as a weapon when you asked for basic partnership. His admission that he was trying to \"scare you into shutting up\" shows he views your valid needs as an inconvenience to be silenced. You're already functioning as a single parent while bankrolling his lifestyle. The only difference is you have an adult dependent who throws his clothes on your couch and watches YouTube while you exhaust yourself.\n\nThe flowers and chocolates now aren't remorse - they're panic because his emotional blackmail didn't work. You're not overreacting; you're finally seeing clearly. When someone tells you they'd rather divorce than contribute to their own household, and then admits they were just trying to scare you into compliance - believe that revelation. He's showing you he prioritizes his comfort over your wellbeing and will use emotional warfare to maintain it. You're not angry because of the manipulation attempt - you're angry because it exposed the fundamental disrespect at the core of your marriage. He contributes minimally financially, does nothing domestically, and when confronted, tries to weaponize divorce to silence you. The flowers aren't going to fix this level of betrayal.",
                "created_utc": 1732731177
              },
              {
                "author": "perksofbeingcrafty",
                "created_utc": 1732731264,
                "id": "lza1wv3",
                "score": 2387,
                "body": "\nKeep saying nothing. Go find a good lawyer. Get a divorce, and make damn sure your lawyer gets you more than 50% of your shared assets because I cannot see what he is contributing to your life and happiness aside from that 15% of expenses. Get out now——if this man is like this approaching 40, he’s not going to change. You deserve so much better. Get out early and go find that better. \n\nI’d suggest you not ruin thanksgiving or give him any ideas that you’re seriously considering a divorce. Contact the lawyer and make preparations on the DL. And when you do finally tell him about wanting the divorce, make sure it’s in a situation where he can’t then take your daughter and hide her somewhere for leverage. (Ie, if she goes to daycare, pick her up and drop her off with a friend or family member you can trust before confronting him)"
              },
              {
                "created_utc": 1732733493,
                "body": "He’s trying to make it up to you with flowers and chocolates… instead of the cleaning you’ve repeatedly asked for 😂😂. \n\nI’m sorry, I can’t. He even fails at groveling. 😂",
                "score": 2221,
                "id": "lza94hd",
                "author": "HappyCabbage9013"
              },
              {
                "created_utc": 1732734597,
                "body": "You don't need permission to leave but here it is anyway: you have permission to leave this really toxic situation and you will probably be happier without him dragging you down.",
                "score": 1559,
                "id": "lzacnzn",
                "author": "Kim_Smoltz_"
              }
            ],
            "imageType": null,
            "body": "Update posted here! : https://www.reddit.com/r/relationship_advice/s/6wOmPQrLqQ \n\nThrowaway because my family uses Reddit! I, 35F, have been married to my husband, 37M, for 5 1/2 years, and we have an 18mo daughter. We have generally had a good marriage, but have repeatedly had the same two arguments for 3+ years.\n\nThe first argument is that I work full time, pay 85% of our bills and do all of the cooking, cleaning, shopping, laundry, running of the household, etc. He also works full time, but after work comes home and immediately takes his work clothes off, throws them on the couch in my living room and goes into the family room to watch YouTube. I have repeatedly asked for help and get the run around.\n\nThe second is that he has a small porn addiction and suffers from premature ejaculation. An issue in itself but not our main problem currently.\n\nThe last week and a half or so, I had been running 80 miles an hour getting ready for the holiday this week. I was cleaning the house, washing the bedding in the guest room, cleaning the fridge, doing all the bits and pieces that you need to do to host family for Thanksgiving. I was also doing all of my daily things as well. For example on a typical day, I wake up make sure his, mine, and the baby's lunches are packed, she's dressed for daycare, my work bag is packed, drive to work. After work I drive to the daycare to pick up baby girl, often taking meetings via phone on the commute. Do any errands that need done (grocery, Costco, pharmacy, etc) come home, immediately breastfeed the baby, start dinner so we can eat once he’s home, give the baby a bath, let her play while I clean off the table, do the dishes, clean the kitchen, tidy up, feed her again, get her to sleep and then finally take a shower myself! It’s basic daily tasks, but I don’t stop until 9-10 at night.\n\nLast week I asked again for help but was told that he needed the break because he is tired. I naturally told him that I never get a break and I'm tired too and need help with the house and if he can't contribute half financially he can at least contribute half of the cleaning. He shut down and just gave me the silent treatment for 2 days, then asked me if I wanted to go to his mother's house with him and the baby. I said only if he wasn't going to ignore me the whole time. That was the match that lit the fuse.\nHe EXPLODED. Evidently I have done nothing but bitch for the last 3 years, he hates cleaning and isn't going to do it, that if him contributing is such a big deal then we should divorce. I asked him to explain what that looks like to him. He said \"I'll get an apartment and sign the house over to you, refinance it in your name. We'll split custody 50/50 and split her expenses 50/50 as well\". He then stormed out of the house and went to his mother's until about 1AM.\nHe again gave me the silent treatment for 2 days.\n\nThe other day I asked him how his apartment hunting was going and he said \"what?\" I told him I thought he was right, I had been bitching about this for 3 years, I'm miserable and he's not helping make my life easier. That I agreed divorce is the best option and that I would rather separate as friends and be good coparents than grow to hate him and feel stuck in a toxic marriage. He then said \"I only said that to scare you into shutting up.\" Basically he attempted to emotionally abuse/manipulate me to get his way. As someone who grew up in a toxic and abusive childhood, this immediately shut me down emotionally. Like I look at him and I feel nothing. He is trying now to get back in my good graces, bringing flowers, chocolates... and all it does is make me angrier.\n\nI need advice. Is the fact that he tried to manipulate me and ADMITTED it a valid reason for me to just want to shut this down? Because I have to be honest, I'm tempted to ruin Thanksgiving. I don't know if I'm just angry and reacting out of that or if I am truly at the end of my rope.",
            "num_comments": 1642
          },
          {
            "id": "1kroqfh",
            "imageType": null,
            "permalink": "/r/BestofRedditorUpdates/comments/1kroqfh/husband_37m_attempted_to_manipulate_me_35f_i/",
            "category": "stories",
            "author": "Choice_Evidence1983",
            "title": "Husband, 37M, attempted to manipulate me, 35F. I called his bluff. Now what?",
            "scraped_at": "2025-05-30T07:32:35.337Z",
            "thumbnail": null,
            "score": 4353,
            "hasImage": false,
            "imageUrl": null,
            "comments": [
              {
                "body": "Why the fuck do insane deadbeats think they're something special?",
                "author": "bananarepama",
                "id": "mtf3nwv",
                "score": 4855,
                "created_utc": 1747800598
              },
              {
                "body": "So husband threatens suicide and becomes abusive, yet she is considered the crazy one? Oh fuck that family and that husband!",
                "author": "peter095837",
                "id": "mtf3bak",
                "score": 2882,
                "created_utc": 1747800440
              }
            ],
            "url": "https://reddit.com/r/BestofRedditorUpdates/comments/1kroqfh/husband_37m_attempted_to_manipulate_me_35f_i/",
            "body": "**I am NOT OOP, OOP is** u/ThrowRABluffCalled\n\n**Originally posted to r/relationship_advice**\n\n**Husband, 37M, attempted to manipulate me, 35F. I called his bluff. Now what?**\n\n**Trigger Warnings:** &gt;!emotional abuse and manipulation, verbal abuse, past trauma, suicidal ideation/threats, self-harm, threats of gun violence, assault!&lt;\n\n**Mood Spoilers:** &gt;!miraculously positive for OOP!&lt;\n\n-----\n\n[Original Post](https://www.reddit.com/r/relationship_advice/s/o0upQngys4): **November 27, 2024**\n\nThrowaway because my family uses Reddit! \n\nI, 35F, have been married to my husband, 37M, for 5 1/2 years, and we have an 18mo daughter. We have generally had a good marriage, but have repeatedly had the same two arguments for 3+ years.\n\nThe first argument is that I work full time, pay 85% of our bills and do all of the cooking, cleaning, shopping, laundry, running of the household, etc. He also works full time, but after work comes home and immediately takes his work clothes off, throws them on the couch in my living room and goes into the family room to watch YouTube. I have repeatedly asked for help and get the run around.\n\nThe second is that he has a small porn addiction and suffers from premature ejaculation. An issue in itself but not our main problem currently.\n\nThe last week and a half or so, I had been running 80 miles an hour getting ready for the holiday this week. I was cleaning the house, washing the bedding in the guest room, cleaning the fridge, doing all the bits and pieces that you need to do to host family for Thanksgiving. I was also doing all of my daily things as well. For example on a typical day, I wake up make sure his, mine, and the baby's lunches are packed, she's dressed for daycare, my work bag is packed, drive to work. After work I drive to the daycare to pick up baby girl, often taking meetings via phone on the commute. Do any errands that need done (grocery, Costco, pharmacy, etc) come home, immediately breastfeed the baby, start dinner so we can eat once he’s home, give the baby a bath, let her play while I clean off the table, do the dishes, clean the kitchen, tidy up, feed her again, get her to sleep and then finally take a shower myself! It’s basic daily tasks, but I don’t stop until 9-10 at night.\n\nLast week I asked again for help but was told that he needed the break because he is tired. I naturally told him that I never get a break and I'm tired too and need help with the house and if he can't contribute half financially he can at least contribute half of the cleaning. He shut down and just gave me the silent treatment for 2 days, then asked me if I wanted to go to his mother's house with him and the baby. I said only if he wasn't going to ignore me the whole time. That was the match that lit the fuse.\n\nHe EXPLODED. Evidently I have done nothing but bitch for the last 3 years, he hates cleaning and isn't going to do it, that if him contributing is such a big deal then we should divorce. I asked him to explain what that looks like to him. He said \"I'll get an apartment and sign the house over to you, refinance it in your name. We'll split custody 50/50 and split her expenses 50/50 as well\". He then stormed out of the house and went to his mother's until about 1AM.\n\nHe again gave me the silent treatment for 2 days.\n\nThe other day I asked him how his apartment hunting was going and he said \"what?\" I told him I thought he was right, I had been bitching about this for 3 years, I'm miserable and he's not helping make my life easier. That I agreed divorce is the best option and that I would rather separate as friends and be good coparents than grow to hate him and feel stuck in a toxic marriage. He then said \"I only said that to scare you into shutting up.\" Basically he attempted to emotionally abuse/manipulate me to get his way. As someone who grew up in a toxic and abusive childhood, this immediately shut me down emotionally. Like I look at him and I feel nothing. He is trying now to get back in my good graces, bringing flowers, chocolates... and all it does is make me angrier.\n\nI need advice. Is the fact that he tried to manipulate me and ADMITTED it a valid reason for me to just want to shut this down? Because I have to be honest, I'm tempted to ruin Thanksgiving. I don't know if I'm just angry and reacting out of that or if I am truly at the end of my rope.\n\n**Relevant Comments**\n\n**Commenter 1:** Follow through and give him that divorce. You are already taking care of everything, it'll be easier without him in the house with you. And you'll at least get a break during his custody time. I'm honestly just surprised you had a child with him if this has been a problem for 3+ years.\n\n&gt; **OOP:** Ha! That was my thought too. And you are right, at first it didn’t seem like a huge issue, and it was only a couple months after I started bringing it up that I got pregnant. Now it’s like he thinks I’m trapped and have to put up with scraps.\n\n**Commenter 2:** He's not just manipulating you - he's exploiting you. You're carrying the financial burden, all household responsibilities, childcare, AND he tried to use divorce as a weapon when you asked for basic partnership. His admission that he was trying to \"scare you into shutting up\" shows he views your valid needs as an inconvenience to be silenced. You're already functioning as a single parent while bankrolling his lifestyle. The only difference is you have an adult dependent who throws his clothes on your couch and watches YouTube while you exhaust yourself.\n\nThe flowers and chocolates now aren't remorse - they're panic because his emotional blackmail didn't work. You're not overreacting; you're finally seeing clearly. When someone tells you they'd rather divorce than contribute to their own household, and then admits they were just trying to scare you into compliance - believe that revelation. He's showing you he prioritizes his comfort over your wellbeing and will use emotional warfare to maintain it. You're not angry because of the manipulation attempt - you're angry because it exposed the fundamental disrespect at the core of your marriage. He contributes minimally financially, does nothing domestically, and when confronted, tries to weaponize divorce to silence you. The flowers aren't going to fix this level of betrayal.\n&gt; \n&gt; **Commenter 3:** He wants 50/50 custody yet cannot manage 50/50 parenting with the other parent in the home. If he's somehow granted 50% custody he is in for a massive shock.\n&gt;&gt; \n&gt;&gt; **Commenter 4:** Good. Let him learn. This man fucked around and it's find-out time.\n&gt;&gt; \n&gt;&gt; OP, you've called a lawyer, right? You need to get the drop on him for filing before his mommy does it for him. And congratulations on your upcoming liberation from the sad freeloading limp dick you're married to.\n&gt;&gt;&gt; \n&gt;&gt;&gt; **OOP:** I have an appointment with one next week for a consult. And what makes me laugh is my SIL knows about the issue and 100% thinks his mom and dad are going to be angry with him. Evidently they have told him he needs to step up previously.\n\n**OOP explains why her husband only was paying 15% of the bills?**\n\n&gt; **OOP:** I make double what he makes. So I put down the money for the house. He pays half the mortgage, I pay literally everything else, from utilities to daily living expenses. The other half off the mortgage would hurt, but I could pay it on my own and still have disposable income.\n\n**Commenter 5:** He bought you flowers and chocolates?? You mean he didn't get on his hands and knees and scrub the floors, do the washing. Get the shopping in. Bath the baby. Apply for better paid jobs???\n\nHe got flowers and chocolates in response to this? Jeez\n\n&gt; **OOP:** I’d settle for using the swiffer honestly. That’s why the chocolates make me so angry! It’s just an avoidance and an “I did something” to try and excuse himself\n\n**Commenter 6:** You don't need permission to leave but here it is anyway: you have permission to leave this really toxic situation and you will probably be happier without him dragging you down.\n\n&gt; **OOP:** I don’t know why this comment made me cry, but it did. I think I did need permission to leave. I feel selfish for wanting more and breaking the family. I was raised in a family where divorce wasn’t an option. Now I have cut off my family and don’t have that additional pressure but I guess old wounds still fester.\n\n**Does OOP's husband do any tasks at home?** \n\n&gt; **OOP:** He mows the front year and takes the garbage out to the curb. He will empty the recycling bin if it’s full. As far as parenting, he will be in the room with her while she plays, but no real interaction. He does take her to daycare in the morning because it’s on the way to his job.\n\n**How did OOP and her husband meet?**\n\n&gt; **OOP:** He found me online. Then turned out I was friends with his brother’s wife already and we had just never met.\n\n**What do OOP and her husband do for the living?**\n\n&gt; **OOP:** I work in a corporate job and he is currently courier.\n\n&amp;nbsp;\n\n[Update](https://www.reddit.com/r/relationship_advice/s/FhOlBoi7xy): **May 14, 2025 (5.5 months later)**\n\nTW: &gt;!suicidal ideation/threats, self harm!&lt;\n\nLink to original post: https://www.reddit.com/r/relationship_advice/s/8hrvRGD9mT\n\nHi y’all! It’s been a while since I posted, but I wanted to let things play out and give you a full update. \n\nFirstly, I wanted to say thank you to all of you who responded and gave encouragement, you helped more than you know.\n\nI did it! I filed for divorce, our divorce should be final mid-June! He fought it for a few months, but finally seems to see that I can’t move on and I won’t let him rug sweep it anymore. He is still talking about hoping for a future reconciliation, but I told him that honestly without massive amounts of therapy for both of us, I don’t see much hope there.\n\nHonestly, once he accepted that I wasn’t giving in and that the divorce was real, he was very agreeable to discussing terms and working with me on custody arrangements, housing, etc. That’s not to say we didn’t have our drama, lord knows we did.\n\nFortunately, nothing too physical towards me, he grabbed me a few times trying to force me to stay in a room to get yelled at, but I set him straight real quick there. His threats were mostly towards self harm.\n\nThe first time was back in February. He was still in denial that I had filed and was very angry about “losing the best things in his life”. He threatened to go downstairs and take his own life. Because I’m stubborn as the day is long and don’t have the sense God gave a goose I followed him down there. I ended up wrestling his gun away and locking myself and the toddler in the bedroom. I should have called the police. I still don’t know why I didn’t. Instead I called his brother and told him to come get him. They did and the next day I took the gun (that was unloaded and NEVER had ammo because he was manipulating me again) to his parents and said if that gun made another appearance in my home or around my child I would ensure he was never around her again. It hasn’t been seen since.\n\nA few weeks later, on their bday (toddler and stbx share a bday) he jumped off my two story deck after my daughter’s bday party. I didn’t see it, I came down the hall and our 2 yo said “Mama, Daddy fall”. I walked outside and he was kneeling by my lawnmower, said he was fixing it. Obviously, my 2 yo hasn’t learned to lie yet. I text my friend and said “I’m pretty sure he just jumped off the deck. He doesn’t seem hurt but idk what to do.” As I hit send I hear him on the deck talking to our kid. I looked out the door and he’s leaning off the edge obviously about to jump again. I LOST it.\n\nIt probably wasn’t the appropriate thing to say, and I probably am a terrible person for saying it, but it worked and I don’t regret it. I told him, “So help me God, if you jump off this deck and die, I will move and your family will likely only see her once a year. You jump off this deck and live and I guarantee you will never see her unsupervised again. You step back over that railing and get both feet on this deck right now, or I swear to God, I’ll make sure of it.” He stepped back on the deck pretty quickly.\n\nHe of course wanted to then argue about how I am driving him to this. How he doesn’t deserve to be left alone. I’m breaking his heart. I reminded him he spent the last almost 4 years now breaking my heart and spirit and I was done having this conversation. As I turned to walk away, this man grabbed my wrist to force me to turn around. I already had my phone in my hand and I never called 911 so fast.\n\nThe police showed up and took him to the hospital for a psych evaluation. I was under the impression that a suicide attempt in this state required a 72 hour hold. They released him after 2 hours, suggesting he talk to a therapist.\n\nI didn’t want to involve the police, I tried to avoid it, but I kind of wish I had involved them earlier. He has been much more docile and accepting since. No more grabbing, no more threats. We still argue, but at least the worst part seems to have disappeared. It helps that even his parents are telling him “She called the cops on you, she’s crazy, let her go.” I’m fine with being labeled the crazy one. I’ve been called worse by better people.\n\nTLDR: Little bit of drama, but everything is going good now and divorce SHOULD be final in mid June!! Send good vibes!!\n\nThank you again. Y’all were the voice of reason I needed, and you have no idea how many times I read those comments when I needed encouragement and felt like I had no one in my corner.\n\n**Relevant / Top Comments**\n\n**Commenter 1:** May be good to document all of these actions with your attorney. And that he be required to have supervised visitation for the foreseeable future, regardless of how he is acting now. He still doesn't sound mentally stable enough to be a sole parent during his time with your child, or beyond some other action such as abducting your kid.\n\nSorry you've gone through all this. But I think your child's safety should be your paramount thoughts.\n\n&gt; **OOP:** Absolutely! Have made sure everything is documented and ensured he is in fact seeing a therapist. Fortunately, his time with our kid happens with his parents present, as he is staying there for now. They might not like me very much right now, but I trust them. They have made it very clear that I’m still family to them.\n\n**Commenter 2:** I’m glad you are aiming to be free. But from reading that my heart and stomach plummeted. Especially when you said he is now more docile and accepting. This particular time is now the most dangerous for you and your daughter. He’s unstable and has access to a gun. You need to insist he’s never unsupervised around her. You need to stop being around him. I really hope I’m proven wrong here but everything is pointing to him escalating.\n\n**Commenter 3:** I’m proud of you for getting out. You gave him more chances than most would, and his own actions sealed the deal. He weaponized threats, manipulated your emotions, refused to contribute as a partner, and tried to keep control even through the divorce. You stayed strong through it all, for yourself and your daughter. Here’s to your peace, your freedom, and your future.\n\n&amp;nbsp;\n\n**DO NOT COMMENT IN LINKED POSTS OR MESSAGE OOPs – BoRU Rule #7**\n\n**THIS IS A REPOST SUB - I AM NOT OOP**",
            "subreddit": "BestofRedditorUpdates",
            "created_utc": 1747800126,
            "num_comments": 387
          }
        ],
        "subreddits": [
          "relationship_advice",
          "BestofRedditorUpdates"
        ],
        "count": 2
      },
      "found wife of 9 years in bed with another man after she forgot to pick up our daughter from her cousins house": {
        "posts": [
          {
            "id": "1hpxxoe",
            "category": "relationships",
            "author": "[deleted]",
            "scraped_at": "2025-05-30T05:09:14.862Z",
            "imageType": null,
            "url": "https://reddit.com/r/survivinginfidelity/comments/1hpxxoe/found_wife_of_9_years_in_bed_with_another_man/",
            "body": "I feel like I’m going crazy or something because she’s so calm and acting like nothing happened. \n\nYesterday I was at an event in the morning to celebrate the employees who’ve worked at the company I own. I have worked hard to provide both my wife and daughter with a better life. \n\nWe both married young and were raised in a rough neighborhood. We had our daughter young and graduated high school the same year our daughter was born. \n\nIt was rough at the beginning, I worked a lot and went to school and maybe in some aspects I neglected her and should have been more present but when I would I would also cook, clean, and take my daughter with me as a newborn to school or work. \n\nAnyways yesterday I get a call at this event from my wife’s cousin and she’s annoyed cause my wife didn’t pick up our daughter at the time she said she would. I was surprised cause that didn’t sound like her and then immediately drove over to pick up my daughter. \n\nBefore leaving I checked my wife’s location and it looked like it was turned off. I brushed it off and thought it was the signal messing up because our area doesn’t always have the best since it’s tucked in the hills. \n\nMy daughter was tired so when we got home she went straight to bed. I went upstairs and heard another man’s voice and my heart sank to my stomach. When I opened the door I saw both of them it looked like they were trying to hide under the bed but failed. \n\nI threw him out the house quietly so my daughter wouldn’t see. Since then I’ve been sleeping in the guest room. My wife says that I’d be stupid to file for a divorce cause our daughter would see me as a deadbeat who left her and her mom and that I work too much and it’s my fault she was with that man. \n\nI mean I think she’s partially right, I have always worked a lot and this month was so hectic that we haven’t been intimate but it’s always been for her and for our family. I’m just so torn. \n\nIt’s driving me crazy that she keeps on saying that I’m overreacting and that this kind of thing is normal in marriage and I don’t know, this kind of thing never crossed my mind. \n\nUpdate: thank you everyone for the love and advice this post got. I am talking to lawyers, she is being kicked out, and I am keeping custody of my daughter.",
            "comments": [
              {
                "created_utc": 1735594309,
                "author": "Mountain-Jicama-3207",
                "score": 685,
                "id": "m4l74uc",
                "body": "She's gaslighting you and its apparently working but no if you expose her infidelity too friends and family they won't see you as a deadbeat for working. She could have communicated you having shorter work hours or more vacation for family time. She choose to be selfish and it isn't normal if she tried to hide under the bed. She's trying to rugsweep and make you out too be the bad guy.\n\nYour daughter is young but will understand later on but if you let this slide she will continue."
              },
              {
                "created_utc": 1735594314,
                "author": "plants_pants",
                "score": 133,
                "body": "1. Why are you sleeping in the guest bedroom?\n\n2. DNA test your daughter\n\n3. Control the narrative. Let people know exactly what happened because she will paint herself as the victim and you are the abuser.\n\n4. Have dignity and get a divorce",
                "id": "m4l75h1"
              }
            ],
            "hasImage": false,
            "thumbnail": null,
            "subreddit": "survivinginfidelity",
            "title": "Found wife of 9 years in bed with another man after she forgot to pick up our daughter from her cousins house.",
            "imageUrl": null,
            "created_utc": 1735593930,
            "num_comments": 260,
            "score": 664,
            "permalink": "/r/survivinginfidelity/comments/1hpxxoe/found_wife_of_9_years_in_bed_with_another_man/"
          },
          {
            "id": "1hpylp9",
            "created_utc": 1735595657,
            "url": "https://reddit.com/r/DeadBedrooms/comments/1hpylp9/found_wife_of_9_years_in_bed_with_another_man/",
            "score": 884,
            "imageUrl": null,
            "category": "relationships",
            "thumbnail": null,
            "title": "Found wife of 9 years in bed with another man after she forgot to pick up our daughter from her cousins house.",
            "body": "TLDR: 1 month of DB crashes and burns a 9 year marriage, just need to vent. Thanks all.\n\nI feel like I’m going crazy or something because she’s so calm and acting like nothing happened. \n\nYesterday I was at an event in the morning to celebrate the employees who’ve worked at the company I own. I have worked hard to provide both my wife and daughter with a better life. \n\nWe both married young and were raised in a rough neighborhood. We had our daughter young and graduated high school the same year our daughter was born. \n\nIt was rough at the beginning, I worked a lot and went to school and maybe in some aspects I neglected her and should have been more present but when I would I would also cook, clean, and take my daughter with me as a newborn to school or work. \n\nAnyways yesterday I get a call at this event from my wife’s cousin and she’s annoyed cause my wife didn’t pick up our daughter at the time she said she would. I was surprised cause that didn’t sound like her and then immediately drove over to pick up my daughter. \n\nBefore leaving I checked my wife’s location and it looked like it was turned off. I brushed it off and thought it was the signal messing up because our area doesn’t always have the best since it’s tucked in the hills. \n\nMy daughter was tired so when we got home she went straight to bed. I went upstairs and heard another man’s voice and my heart sank to my stomach. When I opened the door I saw both of them it looked like they were trying to hide under the bed but failed. \n\nI threw him out the house quietly so my daughter wouldn’t see. Since then I’ve been sleeping in the guest room. My wife says that I’d be stupid to file for a divorce cause our daughter would see me as a deadbeat who left her and her mom and that I work too much and it’s my fault she was with that man. \n\nI mean I think she’s partially right, I have always worked a lot and this month was so hectic that we haven’t been intimate but it’s always been for her and for our family. I’m just so torn. \n\nIt’s driving me crazy that she keeps on saying that I’m overreacting and that this kind of thing is normal in marriage and I don’t know, this kind of thing never crossed my mind. \n\nUpdate: thank you everyone for the love and advice this post got. I am talking to lawyers, she is being kicked out, and I am keeping custody of my daughter.",
            "hasImage": false,
            "comments": [
              {
                "body": "If you divorce, your daughter will eventually learn the truth.",
                "author": "Alarmed-Astronomer57",
                "created_utc": 1735596089,
                "id": "m4lcy13",
                "score": 1051
              },
              {
                "id": "m4lfa17",
                "score": 371,
                "author": "curbz81",
                "created_utc": 1735596834,
                "body": "Tell her if she ever tries to poison her daughter against you that you’ll make sure she finds out the truth.\nAlso, keep a record of what she’s saying in case she denies cheating later."
              }
            ],
            "imageType": null,
            "permalink": "/r/DeadBedrooms/comments/1hpylp9/found_wife_of_9_years_in_bed_with_another_man/",
            "scraped_at": "2025-05-30T05:07:23.726Z",
            "num_comments": 219,
            "author": "[deleted]",
            "subreddit": "DeadBedrooms"
          }
        ],
        "subreddits": [
          "survivinginfidelity",
          "DeadBedrooms"
        ],
        "count": 2
      },
      "what do i do": {
        "posts": [
          {
            "id": "1i6hm6s",
            "comments": [
              {
                "score": 322,
                "id": "m8c7z1m",
                "author": "Clean_Factor9673",
                "created_utc": 1737463376,
                "body": "Bow out. She's not treating you the same as her other friends. My guess because of the timing is you're a replacement for someone else."
              },
              {
                "score": 56,
                "created_utc": 1737463576,
                "author": "[deleted]",
                "id": "m8c8fzo",
                "body": "Drop out. You’re a filler. She either had a different bridesmaid that dropped out or her future husband has more groomsmen and she wants to make it even. You’re not a true bridesmaid. You’re just there to make the number of bridesmaids and groomsmen match. Nobody would treat just one bridesmaid like shit otherwise."
              }
            ],
            "created_utc": 1737463006,
            "body": "so a girl that I am close friends with just asked me to be her bridesmaid a week ago, I said yes, assuming the wedding was quite a long time away. Turns out her wedding is in four months in April. But that’s not the big problem here, so there’s me and three other girls, two are other bridesmaids, and one of them is the maid of honor. about four days after she had asked me to be her bridesmaid I had seen on her Snapchat that she went to go look at bridesmaids dresses with the other bridesmaids, but did not invite me. They also had went shopping and went out for food and then went back to her house to have a couple drinks afterwards, and when I had asked why I was not invited at first she said she didn’t think it was my thing and then she said that because I was in between jobs, she assumed I wouldn’t have the money to go. I don’t understand why she couldn’t have at least invited me to look at bridesmaids dresses. then about a day later, after she said she had assumed I wouldn’t have any money. She tells me the bridesmaid dresses are about $300 and then tells me my hair and my makeup will be $200 and I also have to pay $100 for her bachelorette, and I’m assuming that they are expecting a wedding gift. (and if you don’t assume I have money, how would you expect me to pay $700 for this whole ordeal). So fast-forward to today, we went to the dress shop to go and buy our dresses, it turns out that everybody had gotten to pick their color that they wanted to do because she’s doing four different pastels and I was stuck with the color that nobody else wanted. nothing was ever communicated with me about the colors of the dresses. I was never asked what color I would like to wear or anything, but the other bridesmaids were asked. We found one that we had liked at the bridal shop, but since it is already the middle of January and her wedding is in the beginning of April, we would have to pay $100 extra to get it shipped fast, we ended up not getting the dress and we are going this Sunday to look at dresses. I think she expects me to pay 100 extra dollars to get the dress shipped fast, whenever it’s not my fault that the dress won’t be here on time because she had let me know that I am a bridesmaid four months before the wedding. (also, before this whole thing she had started acting very weird towards me for the past year she had stopped asking me to hang out. She didn’t get me a Christmas gift this year, which is not a big deal, but I just find it weird because she gets me one every single year for the past four or five years.) Also not to mention they had a bridesmaid group chat that I was not even included in and they just added me to it today. What should I do about this whole situation? Should I even attend the wedding or be a bridesmaid? \n\nupdate:\nI did end up bowing out and i said “I’m sorry I have to bow out of my duties as your bridesmaid. thank you so so much for asking me, and even considering me as a bridesmaid it really means the world to me and I truly do appreciate it. But this is a little out of my budget and all happening to fast for me to come up with so much, when you had asked I figured the wedding was at least six months in advance, I ended up doing some of the math last night and with all the money I would be borrowing for everything, not even counting altering the dress that would be almost my whole first paycheck from this job and I still have to finish paying off my schooling and pay $150 to register as a pharmacy technician. I also do feel kind of left out between me not being invited the other day also I just kind of feel like I don’t belong and it kind of makes me feel like a last resort, but I really still want to celebrate with you and support you on your big day by being one of your guests if you would still want me there. I really hope this doesn’t affect our friendship in any way. I genuinely am so excited for you and —“\n\n\nAll she had to say was “thats not a problem.” shes most definitely mad and im most definitely not invited to the wedding, but honestly i could care less after i made my post i went and calculated everything (dress alterations, bridal shower, hair and makeup, shoes, the dress and to have it rushed shipped, wedding gift and what i have to pay for the bachelorette party plus food and drinks there) It came out to $1,600 I absolutely refuse to pay that much with how im being treated.\n\n\nAll in all im pretty sure I lost a “friendship” if i can even call it that. but honestly I could really care less we already barley talk and dont even hang out anymore. Thank you all for reading my post and taking the time to give me your advice. \n\n\nanother update: she texted me again and said “Hey I’m sorry I hate my response. I absolutely still want you to be there! And thank you for letting me know how you feel 🥺 ik we have drifted but I love you so much I miss seeing you and hanging out every weekend. I can’t imagine getting married without you being there. I’m sorry for everything I’ve done that hurt your feelings I promise it was not intentional!❤️” \n\nI absolutely appreciate that she said that and after she said that I genuinely do forgive her since she is being so understanding and apologetic ",
            "category": "wedding",
            "num_comments": 94,
            "scraped_at": "2025-05-30T04:37:57.797Z",
            "imageType": null,
            "score": 263,
            "permalink": "/r/bridezillas/comments/1i6hm6s/what_do_i_do/",
            "imageUrl": null,
            "author": "kendra22222444",
            "hasImage": false,
            "title": "What do I do?",
            "subreddit": "bridezillas",
            "url": "https://reddit.com/r/bridezillas/comments/1i6hm6s/what_do_i_do/",
            "thumbnail": null
          },
          {
            "id": "1kyn4cu",
            "author": "sagisuncapmoon",
            "comments": [
              {
                "created_utc": 1748555729,
                "score": 1347,
                "author": "NH_Lion12",
                "id": "muyn4r2",
                "body": "Fucking say nothing, first of all. Don't get yourself more work than you should have."
              },
              {
                "author": "DashAndSmash",
                "id": "muyn9vm",
                "score": 378,
                "body": "You’re living the dream.",
                "created_utc": 1748555772
              },
              {
                "body": "I did absolutely nothing for my first three months at PwC because they were too busy to show me anything. I worked remotely and would just lie on my home office floor due to sheer boredom. \n\nThis is not normal, but it can happen at very large operations.",
                "id": "muyn8su",
                "author": "LoveEnvironmental252",
                "created_utc": 1748555763,
                "score": 176
              }
            ],
            "title": "What do I do?",
            "num_comments": 245,
            "created_utc": 1748555008,
            "url": "https://reddit.com/r/jobs/comments/1kyn4cu/what_do_i_do/",
            "imageType": null,
            "permalink": "/r/jobs/comments/1kyn4cu/what_do_i_do/",
            "category": "advice",
            "scraped_at": "2025-05-30T08:07:29.391Z",
            "score": 2424,
            "thumbnail": null,
            "subreddit": "jobs",
            "hasImage": false,
            "imageUrl": null,
            "body": "Genuinely have done two things of importance today. I’m entry level in a clinical setting (I’m just admin) so my duties are minimal and need-based. \n\nMy computer is monitored and I hate being on my phone, but I genuinely have nothing to do and everyone in the office seemed to have known that when I started. \n\nIs this normal for entry level office jobs? Do you just wait until someone needs help? What do you do when you can’t ask for more work because it’s above your pay grade? "
          }
        ],
        "subreddits": [
          "bridezillas",
          "jobs"
        ],
        "count": 2
      },
      "update the wedding": {
        "posts": [
          {
            "id": "1kvammq",
            "score": 448,
            "subreddit": "neighborsfromhell",
            "permalink": "/r/neighborsfromhell/comments/1kvammq/update_the_wedding/",
            "author": "Desperate_Earth_6763",
            "scraped_at": "2025-05-30T07:09:09.315Z",
            "url": "https://reddit.com/r/neighborsfromhell/comments/1kvammq/update_the_wedding/",
            "category": "neighbors",
            "num_comments": 112,
            "created_utc": 1748200713,
            "thumbnail": null,
            "body": "Original: https://www.reddit.com/r/neighborsfromhell/s/ynjkeppxNE\n\nI haven’t updated in a while even though some stuff is happened just so I could save it for this giant update. I am so shocked by what happened and I guess I should have listened to some advice about being safe. Also, I phrased the update about the card wrong as the bridesmaids party was last night and the wedding is today (the ceremony just finished just a couple minutes ago and I got the news of what happened by a mutual friend who went to the wedding (I didn’t know he was a mutual friend or going to the wedding. I told him about the situation a while ago and he decided to let me know).\n\nFriday: CN kept looking over the fence. I would have turned on sprinklers, but I don’t have any because I don’t really have grass in my backyard. Later in the day, a police car pulled into CN’s driveway and a bit after, it left. CN’s “revenge” of staring at me continued a lot more after that. I don’t understand why she wastes her time doing it. It doesn’t make me feel uncomfortable.\n\nSaturday: Some people knocked on my door mid day asking if I could let them into the backyard to set up for the bridal party. I called GD and he said it was the right people (just to be safe). They set up some surprisingly expensive and nice decorations and furniture in the yard (not in a destructive way). People come in and out while setting up and the backyard looks amazing. CN continuously peered over the fence for a good amount of time, but I didn’t care. Around 6, B and all the bridesmaids (I’ll do M for bridesmaids) (also about 20 bridesmaids there). I stayed inside mostly, but they occasionally asked me to come out and they drunkenly thanked me. I think the Ms were very wealthy as I received a little over 3K in “tips” from them as I occasionally brought out a carton of ice cream. Well worth it I think. \n\nMore to the events of the party. CN had a campfire in her backyard around 9, but there wasn’t really any wind, so the smoke just stayed in her yard. I think she tried to smoke us out, but maybe she was just having a little fire (I doubt it though). She then gets her hose to put out the fire and “accidentally” sprays water over the fence. Eventually, once the party winds down and they’re packing up, B hands a card signed by all of them thanking me for hosting with additional tips inside (about 2K). I was honestly stunned how nice they were. \n\nAround 11, a very drunk CN bangs on my front door as I’m about to go to sleep. I don’t answer, but have the video on the doorbell camera. She leaves after a bit and I go to bed.\n\nThis morning: this is a secondhand account, so I won’t have all the details. CN comes to the wedding in her very white dress and demands to be let in, but the security denies her. She tries to push the security, but he isn’t fazed. People were watching, but my friend who was there had to go do something (I didn’t ask what). When he gets back, CN isn’t there. \n\nWhat’s happening on my side: this is my account that is right after, but before I got the news about what happened. CN bangs on my door and tries the knob. Since I was getting groceries a bit before, I had accidentally left it unlocked. She comes into my house. I call the cops as soon as I see her open my door. I run upstairs while I give the info to the cops. CN screams at me and eventually slaps me in the face. I’m screaming at her to leave and she tries to slap me again. I grab her wrist and she screams. I basically drag her out the front door right as the police arrive. She is put in the back of the cop car and the police interview me. I tell them and they leave, then I get the news.\n\nCN is not back. I honestly won’t argue with people about if this is true or not as what happened this morning doesn’t feel real even though I just lived through it. ",
            "title": "Update: The Wedding",
            "comments": [
              {
                "score": 160,
                "id": "mu80dqc",
                "body": "I still believe this is partially on CN's husband. She should have had a mental health vacation whether she wanted to or not. She needs grippy socks help.",
                "created_utc": 1748201352,
                "author": "Agreeable-League-366"
              },
              {
                "id": "mu7zj0t",
                "body": "Assault charges being placed on her for that slap?",
                "author": "PiccChicc",
                "score": 62,
                "created_utc": 1748201076
              },
              {
                "created_utc": 1748201441,
                "body": "I love that CN keeps her pedal to the metal on crazy",
                "score": 40,
                "id": "mu80nq2",
                "author": "BraveRefrigerator552"
              },
              {
                "id": "mu857s0",
                "created_utc": 1748202890,
                "author": "2Dogs3Tents",
                "body": "Your neighbor is undoubtedly an insane malignant narcissist.  get the restraining on her in place and enforce it religiously.  Eventually she'll learn.  maybe.",
                "score": 44
              }
            ],
            "imageType": null,
            "hasImage": false,
            "imageUrl": null
          },
          {
            "id": "1kvankh",
            "score": 270,
            "body": "Original: https://www.reddit.com/r/neighborsfromhell/s/ynjkeppxNE\n\nI haven’t updated in a while even though some stuff is happened just so I could save it for this giant update. I am so shocked by what happened and I guess I should have listened to some advice about being safe. Also, I phrased the update about the card wrong as the bridesmaids party was last night and the wedding is today (the ceremony just finished just a couple minutes ago and I got the news of what happened by a mutual friend who went to the wedding (I didn’t know he was a mutual friend or going to the wedding. I told him about the situation a while ago and he decided to let me know).\n\nFriday: CN kept looking over the fence. I would have turned on sprinklers, but I don’t have any because I don’t really have grass in my backyard. Later in the day, a police car pulled into CN’s driveway and a bit after, it left. CN’s “revenge” of staring at me continued a lot more after that. I don’t understand why she wastes her time doing it. It doesn’t make me feel uncomfortable.\n\nSaturday: Some people knocked on my door mid day asking if I could let them into the backyard to set up for the bridal party. I called GD and he said it was the right people (just to be safe). They set up some surprisingly expensive and nice decorations and furniture in the yard (not in a destructive way). People come in and out while setting up and the backyard looks amazing. CN continuously peered over the fence for a good amount of time, but I didn’t care. Around 6, B and all the bridesmaids (I’ll do M for bridesmaids) (also about 20 bridesmaids there). I stayed inside mostly, but they occasionally asked me to come out and they drunkenly thanked me. I think the Ms were very wealthy as I received a little over 3K in “tips” from them as I occasionally brought out a carton of ice cream. Well worth it I think. \n\nMore to the events of the party. CN had a campfire in her backyard around 9, but there wasn’t really any wind, so the smoke just stayed in her yard. I think she tried to smoke us out, but maybe she was just having a little fire (I doubt it though). She then gets her hose to put out the fire and “accidentally” sprays water over the fence. Eventually, once the party winds down and they’re packing up, B hands a card signed by all of them thanking me for hosting with additional tips inside (about 2K). I was honestly stunned how nice they were. \n\nAround 11, a very drunk CN bangs on my front door as I’m about to go to sleep. I don’t answer, but have the video on the doorbell camera. She leaves after a bit and I go to bed.\n\nThis morning: this is a secondhand account, so I won’t have all the details. CN comes to the wedding in her very white dress and demands to be let in, but the security denies her. She tries to push the security, but he isn’t fazed. People were watching, but my friend who was there had to go do something (I didn’t ask what). When he gets back, CN isn’t there. \n\nWhat’s happening on my side: this is my account that is right after, but before I got the news about what happened. CN bangs on my door and tries the knob. Since I was getting groceries a bit before, I had accidentally left it unlocked. She comes into my house. I call the cops as soon as I see her open my door. I run upstairs while I give the info to the cops. CN screams at me and eventually slaps me in the face. I’m screaming at her to leave and she tries to slap me again. I grab her wrist and she screams. I basically drag her out the front door right as the police arrive. She is put in the back of the cop car and the police interview me. I tell them and they leave, then I get the news.\n\nCN is not back. I honestly won’t argue with people about if this is true or not as what happened this morning doesn’t feel real even though I just lived through it. ",
            "scraped_at": "2025-05-30T00:29:15.501Z",
            "url": "https://reddit.com/r/entitledparents/comments/1kvankh/update_the_wedding/",
            "created_utc": 1748200778,
            "permalink": "/r/entitledparents/comments/1kvankh/update_the_wedding/",
            "num_comments": 34,
            "title": "Update: The Wedding",
            "hasImage": false,
            "thumbnail": null,
            "subreddit": "entitledparents",
            "category": "drama",
            "imageType": null,
            "imageUrl": null,
            "author": "Desperate_Earth_6763",
            "comments": [
              {
                "body": "Her entering your home and assaulting you should be enough for you to get a restraining order. Get one for your own wellbeing, keep your cellphone on you at all times, cameras rolling, and doors locked. And a big dog might be of help.",
                "created_utc": 1748201533,
                "id": "mu80xzc",
                "score": 169,
                "author": "D_Mom"
              },
              {
                "body": "CN is about to be on psych hold if her husband back you up",
                "author": "SituationSad4304",
                "id": "mu8bxk6",
                "score": 39,
                "created_utc": 1748205042
              },
              {
                "score": 32,
                "created_utc": 1748207155,
                "author": "FlutteringFae",
                "body": "At this point I'm going to be grateful that the slaps were slaps and not 'CN attacked me with a weapon'",
                "id": "mu8ilhb"
              },
              {
                "author": "Maleficent_Pay_4154",
                "id": "mu8qqzb",
                "body": "Pleased you are ok. I’m sure it was scary",
                "created_utc": 1748209905,
                "score": 5
              },
              {
                "author": "WickedKermit",
                "body": "Updateme!",
                "id": "mu8bktm",
                "created_utc": 1748204927,
                "score": 3
              }
            ]
          },
          {
            "id": "1kvann7",
            "num_comments": 63,
            "scraped_at": "2025-05-30T04:49:37.847Z",
            "permalink": "/r/EntitledPeople/comments/1kvann7/update_the_wedding/",
            "subreddit": "EntitledPeople",
            "comments": [
              {
                "id": "mu81bdg",
                "created_utc": 1748201650,
                "body": "Please tell me you are going to file all the paperwork to see if she's charged or not?  \n\nYou may also want to check your department's FB page for her mugshot. Then make that her picture on your phone.",
                "author": "Substantial_Shoe_360",
                "score": 97
              },
              {
                "id": "mu82b94",
                "score": 63,
                "created_utc": 1748201971,
                "body": "Love getting these updates! I would maybe sit on that 5k in case you need a lawyer though because this lady is crashing out and will probably go the legal route at some point. You’re in the right here, but protect your self legally and just stay safe in case she really flies off the handle",
                "author": "SleepParalysisPal"
              },
              {
                "author": "SweeperOfChimneys",
                "body": "So, breaking and entering, and assault at minimum. Hopefully harassment too. Push them to trespass her and the children from your property. Every time you have proof she or her children set foot on your property from then on, call her in for trespassing. Keep it up until she moves or FINALLY learns the lesson. She might bankrupt herself in fines and legal fees, but oh well. Play stupid games, win stupid prizes.",
                "score": 55,
                "id": "mu86kv2",
                "created_utc": 1748203322
              },
              {
                "created_utc": 1748204294,
                "body": "You should absolutely press charges for assault, breaking and entering, and trespassing. This is absolutely insane!!!",
                "author": "BrushFantastic3170",
                "id": "mu89m1j",
                "score": 51
              }
            ],
            "url": "https://reddit.com/r/EntitledPeople/comments/1kvann7/update_the_wedding/",
            "imageType": null,
            "title": "Update: The Wedding",
            "created_utc": 1748200784,
            "body": "Original: https://www.reddit.com/r/neighborsfromhell/s/ynjkeppxNE\n\nI haven’t updated in a while even though some stuff is happened just so I could save it for this giant update. I am so shocked by what happened and I guess I should have listened to some advice about being safe. Also, I phrased the update about the card wrong as the bridesmaids party was last night and the wedding is today (the ceremony just finished just a couple minutes ago and I got the news of what happened by a mutual friend who went to the wedding (I didn’t know he was a mutual friend or going to the wedding. I told him about the situation a while ago and he decided to let me know).\n\nFriday: CN kept looking over the fence. I would have turned on sprinklers, but I don’t have any because I don’t really have grass in my backyard. Later in the day, a police car pulled into CN’s driveway and a bit after, it left. CN’s “revenge” of staring at me continued a lot more after that. I don’t understand why she wastes her time doing it. It doesn’t make me feel uncomfortable.\n\nSaturday: Some people knocked on my door mid day asking if I could let them into the backyard to set up for the bridal party. I called GD and he said it was the right people (just to be safe). They set up some surprisingly expensive and nice decorations and furniture in the yard (not in a destructive way). People come in and out while setting up and the backyard looks amazing. CN continuously peered over the fence for a good amount of time, but I didn’t care. Around 6, B and all the bridesmaids (I’ll do M for bridesmaids) (also about 20 bridesmaids there). I stayed inside mostly, but they occasionally asked me to come out and they drunkenly thanked me. I think the Ms were very wealthy as I received a little over 3K in “tips” from them as I occasionally brought out a carton of ice cream. Well worth it I think. \n\nMore to the events of the party. CN had a campfire in her backyard around 9, but there wasn’t really any wind, so the smoke just stayed in her yard. I think she tried to smoke us out, but maybe she was just having a little fire (I doubt it though). She then gets her hose to put out the fire and “accidentally” sprays water over the fence. Eventually, once the party winds down and they’re packing up, B hands a card signed by all of them thanking me for hosting with additional tips inside (about 2K). I was honestly stunned how nice they were. \n\nAround 11, a very drunk CN bangs on my front door as I’m about to go to sleep. I don’t answer, but have the video on the doorbell camera. She leaves after a bit and I go to bed.\n\nThis morning: this is a secondhand account, so I won’t have all the details. CN comes to the wedding in her very white dress and demands to be let in, but the security denies her. She tries to push the security, but he isn’t fazed. People were watching, but my friend who was there had to go do something (I didn’t ask what). When he gets back, CN isn’t there. \n\nWhat’s happening on my side: this is my account that is right after, but before I got the news about what happened. CN bangs on my door and tries the knob. Since I was getting groceries a bit before, I had accidentally left it unlocked. She comes into my house. I call the cops as soon as I see her open my door. I run upstairs while I give the info to the cops. CN screams at me and eventually slaps me in the face. I’m screaming at her to leave and she tries to slap me again. I grab her wrist and she screams. I basically drag her out the front door right as the police arrive. She is put in the back of the cop car and the police interview me. I tell them and they leave, then I get the news.\n\nCN is not back. I honestly won’t argue with people about if this is true or not as what happened this morning doesn’t feel real even though I just lived through it. ",
            "thumbnail": null,
            "author": "Desperate_Earth_6763",
            "category": "drama",
            "score": 400,
            "hasImage": false,
            "imageUrl": null
          }
        ],
        "subreddits": [
          "neighborsfromhell",
          "entitledparents",
          "EntitledPeople"
        ],
        "count": 3
      }
    },
    "similarTitles": [
      {
        "similarity": 91,
        "post1": {
          "id": "15stiyd",
          "title": "Ex Cheat on me with her cousin and expected to save face, I think not.",
          "subreddit": "ProRevenge",
          "score": 4952
        },
        "post2": {
          "id": "15subcx",
          "title": "Ex Cheated with her cousin and expected to save face; I think not",
          "subreddit": "NuclearRevenge",
          "score": 5395
        }
      },
      {
        "similarity": 97,
        "post1": {
          "id": "15vhzob",
          "title": "I blew up a romance scammer’s life",
          "subreddit": "NuclearRevenge",
          "score": 2325
        },
        "post2": {
          "id": "15vijli",
          "title": "I blew up a romance scammers life",
          "subreddit": "ProRevenge",
          "score": 4793
        }
      },
      {
        "similarity": 91,
        "post1": {
          "id": "1bvc3bk",
          "title": "Threaten my friend with revenge porn? I'll ruin your whole damn life.",
          "subreddit": "ProRevenge",
          "score": 11673
        },
        "post2": {
          "id": "1bvqsj6",
          "title": "Update: Threaten my friend with revenge porn? I'll ruin your whole damn life.",
          "subreddit": "NuclearRevenge",
          "score": 4253
        }
      },
      {
        "similarity": 94,
        "post1": {
          "id": "1ehmi4j",
          "title": "Something I’ll never understand 💀💀💀💁🏿‍♀️",
          "subreddit": "povertyfinance",
          "score": 8467
        },
        "post2": {
          "id": "1how5yr",
          "title": "Something I will never understand ",
          "subreddit": "jobs",
          "score": 6852
        }
      }
    ],
    "exactContentMatches": {
      "for context it was her cousin in law let s start this story by saying this happened 12 years ago i m...": {
        "posts": [
          {
            "id": "15stiyd",
            "comments": [
              {
                "created_utc": 1692201630,
                "body": "Would call this nuclear revenge but we'll worth it.",
                "author": "Cybermagetx",
                "score": 1970,
                "id": "jwg39hz"
              },
              {
                "created_utc": 1692203100,
                "author": "pokiedokie24",
                "body": "“I asked her if it was snot or cum on her face”\n\nI CANNOT 💀💀💀",
                "score": 399,
                "id": "jwg7eds"
              },
              {
                "body": "that's...nuclear revenge",
                "score": 375,
                "created_utc": 1692201821,
                "id": "jwg3sre",
                "author": "Emotional_Eye7766"
              }
            ],
            "author": "Bigjerr2007",
            "hasImage": false,
            "permalink": "/r/ProRevenge/comments/15stiyd/ex_cheat_on_me_with_her_cousin_and_expected_to/",
            "imageUrl": null,
            "created_utc": 1692200871,
            "num_comments": 445,
            "url": "https://reddit.com/r/ProRevenge/comments/15stiyd/ex_cheat_on_me_with_her_cousin_and_expected_to/",
            "title": "Ex Cheat on me with her cousin and expected to save face, I think not.",
            "body": "For context, it was her cousin-in-law.\n\nLet's start this story by saying this happened 12 years ago. I'm now happily married with three children and regret absolutely nothing.\n\nI was with my new ex for 3 years. I had noticed that she was being extremely controlling. I was expected to give every little detail of my day and tell her my schedule in advance, and if I deviated from that, she would be very upset. She chalked it up to just bad feelings she was having and shrugged it off as her paranoia for past relationships of infidelity. I had never once cheated or strayed, and I never gave her a reason to act like this. It felt unbecoming of my fiance to act in such a way.\n\nNow this is where it gets juicy. After she had asked for my schedule to make plans, as mine tends to be more hectic than hers, I noticed she was texting someone. In my line of work, if I put in more than 40 hours, I have the ability to take time off at will as long as the work is completed at a later date. I was very good friends with a brother and still am. We laugh about this to this day, and he actively reminds her of it. I messaged him stating I wanted to do something special for her a little bit earlier than our anniversary to make sure it was a special surprise. They both worked in the same fabrication facility. He was a fabricator and she a shipping manager. He was kind enough to let me know her schedule. That's where the discrepancy falls into place. Without my knowledge, she was foregoing overtime; she worked 12-hour shifts Monday through Friday, with the exception of Wednesday, when she would only work half a day. She had been taking Wednesdays off right around the time that she started getting extremely controlling. Lucky for me, I had stacked several days of leisure time up, so taking a Wednesday off for me was not an issue. A few days go by, and Wednesday's here. I put on my work gear and \"leave\" for work. I was expecting her to leave as our apartment complex had two exits on the same road I could see directly across from a shopping center, so I parked my car near the back and waited.\n\nAfter about an hour, I notice a very specific red Mustang with a specific decal on the back window. It was her cousin by marriage. I had also done my due diligence to take an old laptop, which we kept on our desk in an office area with a full view of the living room, bedroom door and bathroom plus the kitchen. I had set it up for remote access and had it alert me when the webcam noticed movement. Giving her the benefit of the doubt, I thought he may be dropping something off or coming over to assist her with something, as her family sometimes does. Sure enough, a message came through so I remote into my laptop. He walks through the door without skipping a beat, she unbuttons his shirt and begins kissing him. I created a URL link for the live stream. And as she was preoccupied, we had a family group text and a friend group text. They were both part of it, but at the current time, they were currently indisposed and didn't look at their phones. They didn't even wait; they could have gone to the bedroom, but no, they decided to get freaky deeky right there on the couch. I sent the link off to the friend group chat and the family group chat. Within minutes, I'm getting calls non-stop from friends and family alike. There was no turning back. She was getting blown up, but she was ignoring her phone. Not until the 4th or 5th call came through did they decide to take a break.\n\nFor context, the state I live in allows recording of personal property regardless of occupancy. I was the only one on the lease; she wasn't allowed to be on the lease because of poor credit.\n\nThe call she had picked up was from her cousins mother who she was banging. She answers the phone on speaker, and I kid you not, the first words out of his mother's mouth were stop fucking my son. They both became rigid, and she began to stutter over her words, saying, What are you talking about? etc. The mother then divulged that there was a live feed of them sent out by me to her family. She grabbed every pillow off the couch and covered herself up. The cousin staggered off, trying to put on his pants and shoes, just to trip himself up and bang his head off of my coffee table. Leaving it with a divot. By this time, I had made my way to the front of the apartment complex. I was there to greet the adulterer as he came out of the front exit. He froze and began to cry, apologizing profusely. I'm not going to lie; what happened afterwards wasn't my best moment, and I nearly got into legal trouble if it weren't for the fact that he was trespassing on private property. Let's just say I had a cast for 6 weeks, and he wasn't in any family photos for months.\n\nI went up to the apartment, where she was now fully clothed and crying inconsolably. I asked her if it was snot or cum on her face. Then I told her not to answer because it didn't matter anyway. I gave her 1 hour to remove all her belongings, as again, everything in the apartment was mine except for clothes, some makeup, and a few kitchen utensils.\n\nHer mother would not let her move in, as she was just filled with embarrassment. Same for her brothers, and the cousin's mother kicked her son out. Rumor spread around our town very quickly, and for a lack of better words, she was untouchable.\n\nEdited for bad grammar juju.\nEdited for UPDATE of proof\nNo police report for theft of property I apologize y'all.\n\n\nhttps://ibb.co/sbvTXsY\n\nhttps://ibb.co/R3CKKxp\nhttps://ibb.co/9HQVSnc\n\nhttps://ibb.co/x5p36zS\nhttps://ibb.co/cQZg7RN\n\nhttps://ibb.co/qYv6wW7\nhttps://ibb.co/RzBsQh4",
            "imageType": null,
            "score": 4952,
            "thumbnail": null,
            "subreddit": "ProRevenge",
            "scraped_at": "2025-05-30T07:34:08.024Z",
            "category": "revenge"
          },
          {
            "id": "15subcx",
            "author": "Bigjerr2007",
            "category": "revenge",
            "score": 5395,
            "title": "Ex Cheated with her cousin and expected to save face; I think not",
            "imageUrl": null,
            "thumbnail": null,
            "num_comments": 318,
            "scraped_at": "2025-05-30T07:35:27.285Z",
            "imageType": null,
            "comments": [
              {
                "author": "Cuntbagfloppycock",
                "body": "Can’t wait to hear Microsoft Sam read this to me as I work\n\n“Is that snot or cum on your face?” Beautiful man just beautiful",
                "created_utc": 1692203244,
                "score": 2509,
                "id": "jwg7t1l"
              },
              {
                "id": "jwg99d2",
                "body": "Dude what happened next?",
                "author": "Apprehensive_Fee_554",
                "created_utc": 1692203763,
                "score": 503
              }
            ],
            "created_utc": 1692202624,
            "hasImage": false,
            "url": "https://reddit.com/r/NuclearRevenge/comments/15subcx/ex_cheated_with_her_cousin_and_expected_to_save/",
            "permalink": "/r/NuclearRevenge/comments/15subcx/ex_cheated_with_her_cousin_and_expected_to_save/",
            "subreddit": "NuclearRevenge",
            "body": "For context, it was her cousin-in-law.\n\nLet's start this story by saying this happened 12 years ago. I'm now happily married with three children and regret absolutely nothing.\n\nI was with my new ex for 3 years. I had noticed that she was being extremely controlling. I was expected to give every little detail of my day and tell her my schedule in advance, and if I deviated from that, she would be very upset. She chalked it up to just bad feelings she was having and shrugged it off as her paranoia for past relationships of infidelity. I had never once cheated or strayed, and I never gave her a reason to act like this. It felt unbecoming of my fiance to act in such a way.\n\nNow this is where it gets juicy. After she had asked for my schedule to make plans, as mine tends to be more hectic than hers, I noticed she was texting someone. In my line of work, if I put in more than 40 hours, I have the ability to take time off at will as long as the work is completed at a later date. I was very good friends with a brother and still am. We laugh about this to this day, and he actively reminds her of it. I messaged him stating I wanted to do something special for her a little bit earlier than our anniversary to make sure it was a special surprise. They both worked in the same fabrication facility. He was a fabricator and she a shipping manager. He was kind enough to let me know her schedule. That's where the discrepancy falls into place. Without my knowledge, she was foregoing overtime; she worked 12-hour shifts Monday through Friday, with the exception of Wednesday, when she would only work half a day. She had been taking Wednesdays off right around the time that she started getting extremely controlling. Lucky for me, I had stacked several days of leisure time up, so taking a Wednesday off for me was not an issue. A few days go by, and Wednesday's here. I put on my work gear and \"leave\" for work. I was expecting her to leave as our apartment complex had two exits on the same road I could see directly across from a shopping center, so I parked my car near the back and waited.\n\nAfter about an hour, I notice a very specific red Mustang with a specific decal on the back window. It was her cousin by marriage. I had also done my due diligence to take an old laptop, which we kept on our desk in an office area with a full view of the living room, bedroom door and bathroom plus the kitchen. I had set it up for remote access and had it alert me when the webcam noticed movement. Giving her the benefit of the doubt, I thought he may be dropping something off or coming over to assist her with something, as her family sometimes does. Sure enough, a message came through so I remote into my laptop. He walks through the door without skipping a beat, she unbuttons his shirt and begins kissing him. I created a URL link for the live stream. And as she was preoccupied, we had a family group text and a friend group text. They were both part of it, but at the current time, they were currently indisposed and didn't look at their phones. They didn't even wait; they could have gone to the bedroom, but no, they decided to get freaky deeky right there on the couch. I sent the link off to the friend group chat and the family group chat. Within minutes, I'm getting calls non-stop from friends and family alike. There was no turning back. She was getting blown up, but she was ignoring her phone. Not until the 4th or 5th call came through did they decide to take a break.\n\nFor context, the state I live in allows recording of personal property regardless of occupancy. I was the only one on the lease; she wasn't allowed to be on the lease because of poor credit.\n\nThe call she had picked up was from her cousins mother who she was banging. She answers the phone on speaker, and I kid you not, the first words out of his mother's mouth were stop fucking my son. They both became rigid, and she began to stutter over her words, saying, What are you talking about? etc. The mother then divulged that there was a live feed of them sent out by me to her family. She grabbed every pillow off the couch and covered herself up. The cousin staggered off, trying to put on his pants and shoes, just to trip himself up and bang his head off of my coffee table. Leaving it with a divot. By this time, I had made my way to the front of the apartment complex. I was there to greet the adulterer as he came out of the front exit. He froze and began to cry, apologizing profusely. I'm not going to lie; what happened afterwards wasn't my best moment, and I nearly got into legal trouble if it weren't for the fact that he was trespassing on private property. Let's just say I had a cast for 6 weeks, and he wasn't in any family photos for months.\n\nI went up to the apartment, where she was now fully clothed and crying inconsolably. I asked her if it was snot or cum on her face. Then I told her not to answer because it didn't matter anyway. I gave her 1 hour to remove all her belongings, as again, everything in the apartment was mine except for clothes, some makeup, and a few kitchen utensils.\n\nHer mother would not let her move in, as she was just filled with embarrassment. Same for her brothers, and the cousin's mother kicked her son out. Rumor spread around our town very quickly, and for a lack of better words, she was untouchable.\n\nEdited: Supplying proof for the nay sayers. Eat your heart out.\n\nI couldn't find my digital scan of the theft of property for my cat. My apologies \n\nhttps://ibb.co/sbvTXsY\n\nhttps://ibb.co/R3CKKxp\n\nhttps://ibb.co/9HQVSnc\n\nhttps://ibb.co/x5p36zS\n\nhttps://ibb.co/qYv6wW7\n\nhttps://ibb.co/RzBsQh4"
          }
        ],
        "subreddits": [
          "ProRevenge",
          "NuclearRevenge"
        ],
        "count": 2
      },
      "my very good friend made some slightly dumb mistakes and sent some pictures to someone that she reas...": {
        "posts": [
          {
            "id": "1bvc3bk",
            "comments": [
              {
                "id": "kxyhiu6",
                "body": "I feel like you win 2024.\n\nLegit revenge - check\n\nPerson's life now super fucked - check\n\nDone in record time - Also check",
                "created_utc": 1712198960,
                "author": "rengamez",
                "score": 4413
              },
              {
                "id": "kxyh31i",
                "created_utc": 1712198779,
                "body": "That's some r/nuclearrevenge and I am all for it",
                "author": "slightly_illegal",
                "score": 1007
              },
              {
                "id": "kxyhs5e",
                "author": "Atypicosaurus",
                "score": 719,
                "created_utc": 1712199069,
                "body": "I'm really curious of his face next day when HR calls him in."
              }
            ],
            "hasImage": false,
            "subreddit": "ProRevenge",
            "permalink": "/r/ProRevenge/comments/1bvc3bk/threaten_my_friend_with_revenge_porn_ill_ruin/",
            "imageType": null,
            "thumbnail": null,
            "score": 11673,
            "imageUrl": null,
            "created_utc": 1712198231,
            "category": "revenge",
            "num_comments": 480,
            "author": "furtherdimensions",
            "scraped_at": "2025-05-30T07:33:32.581Z",
            "body": "My very good friend made...some slightly dumb mistakes and sent some pictures to someone that she reasonably thought she could trust, but not knowing much more than than his first name, his screen name, and roughly where he lived and the type of work he did.  He is not in our country but had indicated that he would be traveling for work to near us shortly, and they had made some plans to meet.\n\nAnd when she got some red flags and backed out, the dude threatened to publish these pictures online.\n\nI am, incidentally, an attorney.\n\nSo, some searching later, and gathering up any pictures he sent her of him, that could possibly identify him, his online handle let me to a TikTok page, which lead me to an instagram page with his name on it.\n\nThat lead to a linkedin page with his place of work that matched a picture he sent with a branded polo he was wearing.\n\nSome more searched got me the email of the CEO, VP of HR, operations manager, and public relations manager.\n\nI just fired off an email on behalf of *my client* of the screenshots of him threatening revenge porn, snippets of the conversation showing that username while he sent that exact picture of him wearing his company's branded apparel, links to how I know it's him, along with pictures he sent her of his motorcycle with the license plate showing, as further proof it is him.  I also included screenshots of him discussing a workplace incident that were time stamped, along with pieces of dialogue discussing how he had sex with an ex at his place of work, and discussing plans to have sex with her in his office as well.\n\nI also included a picture he sent her showing his work laptop with his entire outlook calendar, along with proprietary information (which he sent to \"prove he was busy\") along with other pictures he took of his workplace with non-consenting employees.\n\nI further informed his employer that I will be forwarding all this information to local (to them) law enforcement and since he had indicated that he would be traveling to the United States soon, will also forward this to the local office of the Federal Bureau of Investigation as, since *my client* is a US citizen on US soil, these threats constituted a federal crime.  So that should they continue with his employment, and continue with their plans to send him to the United State for work, I will ensure, on behalf of *my client* that federal law enforcement is waiting for him on arrival.  Which I will do, as one of the assistant US attorney's for this region is a law school buddy of mine.  \n\nSince I have his license plate # I know where he lives, and will be contacting his local authorities tomorow.\n\nYou dumb mother fucker thinking you were hiding around anonymity thinking you could threaten ***my friend***?  It took me 45 minutes to destroy your life.",
            "title": "Threaten my friend with revenge porn? I'll ruin your whole damn life.",
            "url": "https://reddit.com/r/ProRevenge/comments/1bvc3bk/threaten_my_friend_with_revenge_porn_ill_ruin/"
          },
          {
            "id": "1bvc68q",
            "permalink": "/r/NuclearRevenge/comments/1bvc68q/threaten_my_friend_with_revenge_porn_ill_ruin/",
            "url": "https://reddit.com/r/NuclearRevenge/comments/1bvc68q/threaten_my_friend_with_revenge_porn_ill_ruin/",
            "author": "furtherdimensions",
            "hasImage": false,
            "imageType": null,
            "body": "My very good friend made...some slightly dumb mistakes and sent some pictures to someone that she reasonably thought she could trust, but not knowing much more than than his first name, his screen name, and roughly where he lived and the type of work he did.  He is not in our country but had indicated that he would be traveling for work to near us shortly, and they had made some plans to meet.\n\nAnd when she got some red flags and backed out, the dude threatened to publish these pictures online.\n\nI am, incidentally, an attorney.\n\nSo, some searching later, and gathering up any pictures he sent her of him, that could possibly identify him, his online handle let me to a TikTok page, which lead me to an instagram page with his name on it.\n\nThat lead to a linkedin page with his place of work that matched a picture he sent with a branded polo he was wearing.\n\nSome more searches got me the email of the CEO, VP of HR, operations manager, and public relations manager.\n\nI just fired off an email on behalf of my client of the screenshots of him threatening revenge porn, snippets of the conversation showing that username while he sent that exact picture of him wearing his company's branded apparel, links to how I know it's him, along with pictures he sent her of his motorcycle with the license plate showing, as further proof it is him.  I also included screenshots of him discussing a workplace incident that were time stamped, along with pieces of dialogue discussing how he had sex with an ex at his place of work, and discussing plans to have sex with her in his office as well.\n\nI also included a picture he sent her showing his work laptop with his entire outlook calendar, along with proprietary information (which he sent to \"prove he was busy\") along with other pictures he took of his workplace with non-consenting employees.\n\nI further informed his employer that I will be forwarding all this information to local (to them) law enforcement and since he had indicated that he would be traveling to the United States soon, will also forward this to the local office of the Federal Bureau of Investigation as, since my client is a US citizen on US soil, these threats constituted a federal crime.  So that should they continue with his employment, and continue with their plans to send him to the United State for work, I will ensure, on behalf of my client that federal law enforcement is waiting for him on arrival.  Which I will do, as one of the assistant US attorney's for this region is a law school buddy of mine.\n\nSince I have his license plate # I know where he lives, and will be contacting his local authorities tomorow.\n\nYou dumb mother fucker thinking you were hiding around anonymity thinking you could threaten my friend?  It took me 45 minutes to destroy your life.",
            "thumbnail": null,
            "title": "Threaten my friend with revenge porn? I'll ruin your whole damn life.",
            "score": 6132,
            "num_comments": 324,
            "imageUrl": null,
            "subreddit": "NuclearRevenge",
            "scraped_at": "2025-05-30T07:35:02.397Z",
            "created_utc": 1712198462,
            "comments": [
              {
                "author": "MyChoiceNotYours",
                "body": "Please keep us updated because damn I do love karma",
                "score": 2329,
                "id": "kxyhudj",
                "created_utc": 1712199095
              },
              {
                "author": "PB111",
                "created_utc": 1712198879,
                "score": 967,
                "id": "kxyhbtm",
                "body": "jeans meeting smell intelligent fall rock merciful include market tan\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*"
              },
              {
                "author": "nick5th",
                "created_utc": 1712199109,
                "body": "holy testicle tuesday batman",
                "id": "kxyhvjd",
                "score": 559
              }
            ],
            "category": "revenge"
          }
        ],
        "subreddits": [
          "ProRevenge",
          "NuclearRevenge"
        ],
        "count": 2
      },
      "hello everyone after a 10 year marriage that ultimately ended in divorce i found myself reflecting o...": {
        "posts": [
          {
            "id": "1ggu5l1",
            "score": 161,
            "scraped_at": "2025-05-30T08:11:58.878Z",
            "body": "Hello everyone,\n\nAfter a 10-year marriage that ultimately ended in divorce, I found myself reflecting on the entire journey—what went right, what went wrong, and all the lessons that could have made a difference. I spoke with a few people, both men and women, and it hit me: many people are searching for a spouse but may not fully understand the depth of what marriage truly is.\n\nI’m sharing my experiences here, not to discourage anyone but to shed light on what I wish I’d known. Hopefully, these insights will be helpful to anyone seriously considering marriage or looking to strengthen their current relationship.\n\n**1. Intentions Matter More Than We Realize**\n\nWhen I first got married, I thought love alone would carry us through anything. But over the years, I realized that the foundation of a relationship isn’t just emotions; it’s intentions. Having clear, shared intentions from the beginning what we both wanted from life, our values, our commitment to support each other would have helped us steer through the tougher times. Start your marriage with sincerity and know why you’re committing to each other.\n\n**2. Don’t Overlook Small Acts of Kindness**\n\nIt’s easy to assume that grand gestures will keep the spark alive, but I found that small, consistent acts of kindness build a stronger bond over time. A gentle word, a little patience, or even just a smile after a long day speaks volumes. The daily, quiet kindnesses we often overlook are the glue that holds everything together. Over time, I think we forgot this, focusing too much on what wasn’t working rather than nurturing each other in small ways.\n\n**3. Communication is Hard, But it’s the Backbone**\n\nPeople say “communicate” all the time, but let’s be real—it’s not as easy as it sounds. For years, I didn’t know how to express my feelings without holding back or without frustration. We had different communication styles, which sometimes made us feel worlds apart. I learned that communication is a skill you work on continuously. It means being honest, patient, and humble enough to listen without ego. If I had practiced this earlier, maybe we could’ve navigated conflicts better.\n\n**4. Value Growth in Yourself and Each Other**\n\nOne of my biggest regrets is that we didn’t focus on growing together as individuals. Marriage should be a journey where you’re both evolving, learning, and pushing each other towards personal betterment. I learned too late that a healthy marriage is one where each person is supportive of the other’s growth not threatened by it. If you see your partner growing, encourage them. Celebrate their wins, and let them do the same for you.\n\n**5. Don’t Carry Resentments; Address Them Early**\n\nOver time, small grievances and unspoken feelings can turn into resentment. I let issues pile up, hoping they’d resolve on their own, but they rarely do. When you let them fester, they turn into silent barriers. Now I know that when something bothers you, you need to bring it up respectfully and work through it together. An open heart, no matter how difficult the conversation, will save you so much pain down the line.\n\n**6. Understand That It’s Not Always About Winning**\n\nLooking back, I wish I had focused less on being “right” and more on understanding my partner’s perspective. Sometimes, in the heat of disagreements, I felt the need to prove my point, and it drove a wedge between us. Remember that you and your spouse are on the same team. There’s no winning if it comes at the cost of peace in your relationship.\n\n**7. Patience and Forgiveness Are Your Best Friends**\n\nMarriage is full of moments where you’ll need patience and forgiveness. There were times when I was quick to point out flaws and mistakes, but rarely stopped to think about the effect of my words. Learning to forgive genuinely—not holding grudges—is key to a peaceful relationship. Forgiveness doesn’t mean ignoring what hurt you; it means choosing to move forward without bitterness.\n\n**8. Remember That Faith is a Guiding Light**\n\nThroughout my journey, the principles of patience, compassion, and mutual respect kept me grounded. Whether it was enduring hardships, finding compassion during disagreements, or simply reminding myself of the blessings we shared, my faith reminded me of a bigger picture. Leaning on these values, even in the hardest times, gave me peace and perspective.\n\n**My Takeaway**\n\nWhile my marriage ultimately ended, I carry these lessons with me. I hope sharing them can help anyone else out there trying to build or sustain a marriage. Every relationship has its ups and downs, and none of us are perfect, but we can always learn from each other.\n\nIf there’s one thing I’d say to anyone getting married or working through marital challenges, it’s this: cherish and respect each other, forgive easily, and grow together. Because even if things don’t work out in the end, at least you’ll know you did your best.",
            "comments": [
              {
                "body": "&gt;\"**5. Don’t Carry Resentments; Address Them Early**\n\nOver time, small grievances and unspoken feelings can turn into resentment. I let issues pile up, hoping they’d resolve on their own, but they rarely do. When you let them fester, they turn into silent barriers. Now I know that when something bothers you, you need to bring it up respectfully and work through it together. An open heart, no matter how difficult the conversation, will save you so much pain down the line.\"\n\n  \nThis part here hits so strongly for me. Those small resentments kind of slowly creep up on you... Until it explodes and you are wondering how on earth did we get here and things end up this bad. The way you worded this was very beautifully said. It feels like an emotional impact was made from your experience when I read your lesson number 5. \n\n&gt;\"There were times when I was quick to point out flaws and mistakes, but rarely stopped to think about the effect of my words.\"\n\nAs you said in this bullet point. love",
                "score": 18,
                "id": "lusikqs",
                "created_utc": 1730424552,
                "author": "Markie199711"
              },
              {
                "author": "MaleficentMousse7473",
                "id": "lusqmnf",
                "score": 7,
                "body": "There is so much wisdom here. Thank you for sharing your deep reflections with us. Your next marriage, should you choose it, will benefit greatly.\n\nThe small kindnesses resonates a lot with me. My marriage has small kindnesses and it is definitely a huge comfort. Long stretches of disinterest or unkindness with a surprise grand gesture just make for uncertainty and stress",
                "created_utc": 1730427696
              },
              {
                "id": "lusihol",
                "created_utc": 1730424520,
                "score": 5,
                "body": "My stbx carried so much resentment that I didn’t know about. Had he told me I would’ve fixed things.",
                "author": "AmaltheaDreams"
              },
              {
                "body": "I needed this today.  Today my relationship has ended and it's for the best but this will help keep me guided for the future.",
                "created_utc": 1730434084,
                "id": "lut55mq",
                "score": 4,
                "author": "Thoughts-AndPrayers"
              },
              {
                "author": "[deleted]",
                "id": "lutdqmp",
                "score": 3,
                "created_utc": 1730438886,
                "body": "Thank you 🙏"
              }
            ],
            "permalink": "/r/LifeAdvice/comments/1ggu5l1/10_years_of_marriage_lessons_i_wish_id_known_from/",
            "imageUrl": null,
            "num_comments": 17,
            "category": "advice",
            "author": "Zestyclose_Flow_680",
            "thumbnail": null,
            "created_utc": 1730423653,
            "title": "10 Years of Marriage: Lessons I Wish I'd Known from the Start",
            "imageType": null,
            "url": "https://reddit.com/r/LifeAdvice/comments/1ggu5l1/10_years_of_marriage_lessons_i_wish_id_known_from/",
            "hasImage": false,
            "subreddit": "LifeAdvice"
          },
          {
            "id": "1ghu2sd",
            "author": "Zestyclose_Flow_680",
            "scraped_at": "2025-05-30T08:00:41.655Z",
            "hasImage": false,
            "permalink": "/r/DecidingToBeBetter/comments/1ghu2sd/10_years_of_marriage_lessons_i_wish_id_known_from/",
            "subreddit": "DecidingToBeBetter",
            "num_comments": 36,
            "url": "https://reddit.com/r/DecidingToBeBetter/comments/1ghu2sd/10_years_of_marriage_lessons_i_wish_id_known_from/",
            "title": "10 Years of Marriage: Lessons I Wish I'd Known from the Start",
            "score": 833,
            "category": "advice",
            "body": "Hello everyone,\n\nAfter a 10-year marriage that ultimately ended in divorce, I found myself reflecting on the entire journey—what went right, what went wrong, and all the lessons that could have made a difference. I spoke with a few people, both men and women, and it hit me: many people are searching for a spouse but may not fully understand the depth of what marriage truly is.\n\nI’m sharing my experiences here, not to discourage anyone but to shed light on what I wish I’d known. Hopefully, these insights will be helpful to anyone seriously considering marriage or looking to strengthen their current relationship.\n\n**1. Intentions Matter More Than We Realize**\n\nWhen I first got married, I thought love alone would carry us through anything. But over the years, I realized that the foundation of a relationship isn’t just emotions; it’s intentions. Having clear, shared intentions from the beginning what we both wanted from life, our values, our commitment to support each other would have helped us steer through the tougher times. Start your marriage with sincerity and know why you’re committing to each other.\n\n**2. Don’t Overlook Small Acts of Kindness**\n\nIt’s easy to assume that grand gestures will keep the spark alive, but I found that small, consistent acts of kindness build a stronger bond over time. A gentle word, a little patience, or even just a smile after a long day speaks volumes. The daily, quiet kindnesses we often overlook are the glue that holds everything together. Over time, I think we forgot this, focusing too much on what wasn’t working rather than nurturing each other in small ways.\n\n**3. Communication is Hard, But it’s the Backbone**\n\nPeople say “communicate” all the time, but let’s be real—it’s not as easy as it sounds. For years, I didn’t know how to express my feelings without holding back or without frustration. We had different communication styles, which sometimes made us feel worlds apart. I learned that communication is a skill you work on continuously. It means being honest, patient, and humble enough to listen without ego. If I had practiced this earlier, maybe we could’ve navigated conflicts better.\n\n**4. Value Growth in Yourself and Each Other**\n\nOne of my biggest regrets is that we didn’t focus on growing together as individuals. Marriage should be a journey where you’re both evolving, learning, and pushing each other towards personal betterment. I learned too late that a healthy marriage is one where each person is supportive of the other’s growth not threatened by it. If you see your partner growing, encourage them. Celebrate their wins, and let them do the same for you.\n\n**5. Don’t Carry Resentments; Address Them Early**\n\nOver time, small grievances and unspoken feelings can turn into resentment. I let issues pile up, hoping they’d resolve on their own, but they rarely do. When you let them fester, they turn into silent barriers. Now I know that when something bothers you, you need to bring it up respectfully and work through it together. An open heart, no matter how difficult the conversation, will save you so much pain down the line.\n\n**6. Understand That It’s Not Always About Winning**\n\nLooking back, I wish I had focused less on being “right” and more on understanding my partner’s perspective. Sometimes, in the heat of disagreements, I felt the need to prove my point, and it drove a wedge between us. Remember that you and your spouse are on the same team. There’s no winning if it comes at the cost of peace in your relationship.\n\n**7. Patience and Forgiveness Are Your Best Friends**\n\nMarriage is full of moments where you’ll need patience and forgiveness. There were times when I was quick to point out flaws and mistakes, but rarely stopped to think about the effect of my words. Learning to forgive genuinely—not holding grudges—is key to a peaceful relationship. Forgiveness doesn’t mean ignoring what hurt you; it means choosing to move forward without bitterness.\n\n**8. Remember That Faith is a Guiding Light**\n\nThroughout my journey, the principles of patience, compassion, and mutual respect kept me grounded. Whether it was enduring hardships, finding compassion during disagreements, or simply reminding myself of the blessings we shared, my faith reminded me of a bigger picture. Leaning on these values, even in the hardest times, gave me peace and perspective.\n\n**My Takeaway**\n\nWhile my marriage ultimately ended, I carry these lessons with me. I hope sharing them can help anyone else out there trying to build or sustain a marriage. Every relationship has its ups and downs, and none of us are perfect, but we can always learn from each other.\n\nIf there’s one thing I’d say to anyone getting married or working through marital challenges, it’s this: cherish and respect each other, forgive easily, and grow together. Because even if things don’t work out in the end, at least you’ll know you did your best.",
            "imageType": null,
            "thumbnail": null,
            "comments": [
              {
                "id": "lv01uwc",
                "created_utc": 1730546146,
                "body": "Thank you for putting this down here, I wish you all the best for the future.",
                "author": "-Intronaut-",
                "score": 119
              },
              {
                "author": "maasd",
                "created_utc": 1730559470,
                "id": "lv0xdyx",
                "score": 46,
                "body": "I’m so happy for you that you have learned from this experience. My first marriage ended in divorce and while I could have blamed my ex, I spent a long time reflecting on what went wrong, my role in that, and how I would grow and change in my next relationship. I’m now extremely happy married a second time for 9 years and I’m so glad I didn’t immediately jump into a relationship right after my first marriage ended. \n\nPlease, if your serious relationship ends take your time to really deeply reflect and process and figure out how you can grow before diving back in and making the same mistakes. Even if you feel it was the other person’s fault, you may have played a role in allowing things to happen or go unchecked the way they did.\n\nTo add to OP’s points, it’s not only compatible intentions but compatible dispositions and personalities. Do you know what you need from your partner emotionally and personality wise to have your best life? If you don’t fully know this, pump the brakes before "
              },
              {
                "created_utc": 1730586813,
                "body": "Thanks ChatGPT.",
                "score": 27,
                "author": "niceguyted",
                "id": "lv38tem"
              },
              {
                "id": "lv0c6a0",
                "author": "CropTopKitten",
                "created_utc": 1730551471,
                "score": 22,
                "body": "Great lessons! I saved your post. \n\nMy marriage was physically abusive, so it could not have been saved. However, I also went into marriage just thinking about feelings and not actions, as in “emotions are the foundation for everything.” If I felt love, then everything would be okay with marriage. \n\nWhen my husband started abusing me, I stopped feeling love for him. As a result, I blamed myself. I thought that because I couldn’t feel love for him, that I was single handedly destroying my marriage. He also said as much. \n\nI saw my dad treat my mom in all sorts of terrible ways, but she would always end up saying how much she loved him. I learned that if you just keep loving someone, then that’s a “successful” marriage.\n\nIt’s crazy that nobody ever explained to me about all of the many, many actions that are required to actually make a marriage work."
              }
            ],
            "created_utc": 1730545818,
            "imageUrl": null
          }
        ],
        "subreddits": [
          "LifeAdvice",
          "DecidingToBeBetter"
        ],
        "count": 2
      },
      "original https www reddit com r neighborsfromhell s ynjkeppxne i haven t updated in a while even tho...": {
        "posts": [
          {
            "id": "1kvammq",
            "score": 448,
            "subreddit": "neighborsfromhell",
            "permalink": "/r/neighborsfromhell/comments/1kvammq/update_the_wedding/",
            "author": "Desperate_Earth_6763",
            "scraped_at": "2025-05-30T07:09:09.315Z",
            "url": "https://reddit.com/r/neighborsfromhell/comments/1kvammq/update_the_wedding/",
            "category": "neighbors",
            "num_comments": 112,
            "created_utc": 1748200713,
            "thumbnail": null,
            "body": "Original: https://www.reddit.com/r/neighborsfromhell/s/ynjkeppxNE\n\nI haven’t updated in a while even though some stuff is happened just so I could save it for this giant update. I am so shocked by what happened and I guess I should have listened to some advice about being safe. Also, I phrased the update about the card wrong as the bridesmaids party was last night and the wedding is today (the ceremony just finished just a couple minutes ago and I got the news of what happened by a mutual friend who went to the wedding (I didn’t know he was a mutual friend or going to the wedding. I told him about the situation a while ago and he decided to let me know).\n\nFriday: CN kept looking over the fence. I would have turned on sprinklers, but I don’t have any because I don’t really have grass in my backyard. Later in the day, a police car pulled into CN’s driveway and a bit after, it left. CN’s “revenge” of staring at me continued a lot more after that. I don’t understand why she wastes her time doing it. It doesn’t make me feel uncomfortable.\n\nSaturday: Some people knocked on my door mid day asking if I could let them into the backyard to set up for the bridal party. I called GD and he said it was the right people (just to be safe). They set up some surprisingly expensive and nice decorations and furniture in the yard (not in a destructive way). People come in and out while setting up and the backyard looks amazing. CN continuously peered over the fence for a good amount of time, but I didn’t care. Around 6, B and all the bridesmaids (I’ll do M for bridesmaids) (also about 20 bridesmaids there). I stayed inside mostly, but they occasionally asked me to come out and they drunkenly thanked me. I think the Ms were very wealthy as I received a little over 3K in “tips” from them as I occasionally brought out a carton of ice cream. Well worth it I think. \n\nMore to the events of the party. CN had a campfire in her backyard around 9, but there wasn’t really any wind, so the smoke just stayed in her yard. I think she tried to smoke us out, but maybe she was just having a little fire (I doubt it though). She then gets her hose to put out the fire and “accidentally” sprays water over the fence. Eventually, once the party winds down and they’re packing up, B hands a card signed by all of them thanking me for hosting with additional tips inside (about 2K). I was honestly stunned how nice they were. \n\nAround 11, a very drunk CN bangs on my front door as I’m about to go to sleep. I don’t answer, but have the video on the doorbell camera. She leaves after a bit and I go to bed.\n\nThis morning: this is a secondhand account, so I won’t have all the details. CN comes to the wedding in her very white dress and demands to be let in, but the security denies her. She tries to push the security, but he isn’t fazed. People were watching, but my friend who was there had to go do something (I didn’t ask what). When he gets back, CN isn’t there. \n\nWhat’s happening on my side: this is my account that is right after, but before I got the news about what happened. CN bangs on my door and tries the knob. Since I was getting groceries a bit before, I had accidentally left it unlocked. She comes into my house. I call the cops as soon as I see her open my door. I run upstairs while I give the info to the cops. CN screams at me and eventually slaps me in the face. I’m screaming at her to leave and she tries to slap me again. I grab her wrist and she screams. I basically drag her out the front door right as the police arrive. She is put in the back of the cop car and the police interview me. I tell them and they leave, then I get the news.\n\nCN is not back. I honestly won’t argue with people about if this is true or not as what happened this morning doesn’t feel real even though I just lived through it. ",
            "title": "Update: The Wedding",
            "comments": [
              {
                "score": 160,
                "id": "mu80dqc",
                "body": "I still believe this is partially on CN's husband. She should have had a mental health vacation whether she wanted to or not. She needs grippy socks help.",
                "created_utc": 1748201352,
                "author": "Agreeable-League-366"
              },
              {
                "id": "mu7zj0t",
                "body": "Assault charges being placed on her for that slap?",
                "author": "PiccChicc",
                "score": 62,
                "created_utc": 1748201076
              },
              {
                "created_utc": 1748201441,
                "body": "I love that CN keeps her pedal to the metal on crazy",
                "score": 40,
                "id": "mu80nq2",
                "author": "BraveRefrigerator552"
              },
              {
                "id": "mu857s0",
                "created_utc": 1748202890,
                "author": "2Dogs3Tents",
                "body": "Your neighbor is undoubtedly an insane malignant narcissist.  get the restraining on her in place and enforce it religiously.  Eventually she'll learn.  maybe.",
                "score": 44
              }
            ],
            "imageType": null,
            "hasImage": false,
            "imageUrl": null
          },
          {
            "id": "1kvankh",
            "score": 270,
            "body": "Original: https://www.reddit.com/r/neighborsfromhell/s/ynjkeppxNE\n\nI haven’t updated in a while even though some stuff is happened just so I could save it for this giant update. I am so shocked by what happened and I guess I should have listened to some advice about being safe. Also, I phrased the update about the card wrong as the bridesmaids party was last night and the wedding is today (the ceremony just finished just a couple minutes ago and I got the news of what happened by a mutual friend who went to the wedding (I didn’t know he was a mutual friend or going to the wedding. I told him about the situation a while ago and he decided to let me know).\n\nFriday: CN kept looking over the fence. I would have turned on sprinklers, but I don’t have any because I don’t really have grass in my backyard. Later in the day, a police car pulled into CN’s driveway and a bit after, it left. CN’s “revenge” of staring at me continued a lot more after that. I don’t understand why she wastes her time doing it. It doesn’t make me feel uncomfortable.\n\nSaturday: Some people knocked on my door mid day asking if I could let them into the backyard to set up for the bridal party. I called GD and he said it was the right people (just to be safe). They set up some surprisingly expensive and nice decorations and furniture in the yard (not in a destructive way). People come in and out while setting up and the backyard looks amazing. CN continuously peered over the fence for a good amount of time, but I didn’t care. Around 6, B and all the bridesmaids (I’ll do M for bridesmaids) (also about 20 bridesmaids there). I stayed inside mostly, but they occasionally asked me to come out and they drunkenly thanked me. I think the Ms were very wealthy as I received a little over 3K in “tips” from them as I occasionally brought out a carton of ice cream. Well worth it I think. \n\nMore to the events of the party. CN had a campfire in her backyard around 9, but there wasn’t really any wind, so the smoke just stayed in her yard. I think she tried to smoke us out, but maybe she was just having a little fire (I doubt it though). She then gets her hose to put out the fire and “accidentally” sprays water over the fence. Eventually, once the party winds down and they’re packing up, B hands a card signed by all of them thanking me for hosting with additional tips inside (about 2K). I was honestly stunned how nice they were. \n\nAround 11, a very drunk CN bangs on my front door as I’m about to go to sleep. I don’t answer, but have the video on the doorbell camera. She leaves after a bit and I go to bed.\n\nThis morning: this is a secondhand account, so I won’t have all the details. CN comes to the wedding in her very white dress and demands to be let in, but the security denies her. She tries to push the security, but he isn’t fazed. People were watching, but my friend who was there had to go do something (I didn’t ask what). When he gets back, CN isn’t there. \n\nWhat’s happening on my side: this is my account that is right after, but before I got the news about what happened. CN bangs on my door and tries the knob. Since I was getting groceries a bit before, I had accidentally left it unlocked. She comes into my house. I call the cops as soon as I see her open my door. I run upstairs while I give the info to the cops. CN screams at me and eventually slaps me in the face. I’m screaming at her to leave and she tries to slap me again. I grab her wrist and she screams. I basically drag her out the front door right as the police arrive. She is put in the back of the cop car and the police interview me. I tell them and they leave, then I get the news.\n\nCN is not back. I honestly won’t argue with people about if this is true or not as what happened this morning doesn’t feel real even though I just lived through it. ",
            "scraped_at": "2025-05-30T00:29:15.501Z",
            "url": "https://reddit.com/r/entitledparents/comments/1kvankh/update_the_wedding/",
            "created_utc": 1748200778,
            "permalink": "/r/entitledparents/comments/1kvankh/update_the_wedding/",
            "num_comments": 34,
            "title": "Update: The Wedding",
            "hasImage": false,
            "thumbnail": null,
            "subreddit": "entitledparents",
            "category": "drama",
            "imageType": null,
            "imageUrl": null,
            "author": "Desperate_Earth_6763",
            "comments": [
              {
                "body": "Her entering your home and assaulting you should be enough for you to get a restraining order. Get one for your own wellbeing, keep your cellphone on you at all times, cameras rolling, and doors locked. And a big dog might be of help.",
                "created_utc": 1748201533,
                "id": "mu80xzc",
                "score": 169,
                "author": "D_Mom"
              },
              {
                "body": "CN is about to be on psych hold if her husband back you up",
                "author": "SituationSad4304",
                "id": "mu8bxk6",
                "score": 39,
                "created_utc": 1748205042
              },
              {
                "score": 32,
                "created_utc": 1748207155,
                "author": "FlutteringFae",
                "body": "At this point I'm going to be grateful that the slaps were slaps and not 'CN attacked me with a weapon'",
                "id": "mu8ilhb"
              },
              {
                "author": "Maleficent_Pay_4154",
                "id": "mu8qqzb",
                "body": "Pleased you are ok. I’m sure it was scary",
                "created_utc": 1748209905,
                "score": 5
              },
              {
                "author": "WickedKermit",
                "body": "Updateme!",
                "id": "mu8bktm",
                "created_utc": 1748204927,
                "score": 3
              }
            ]
          },
          {
            "id": "1kvann7",
            "num_comments": 63,
            "scraped_at": "2025-05-30T04:49:37.847Z",
            "permalink": "/r/EntitledPeople/comments/1kvann7/update_the_wedding/",
            "subreddit": "EntitledPeople",
            "comments": [
              {
                "id": "mu81bdg",
                "created_utc": 1748201650,
                "body": "Please tell me you are going to file all the paperwork to see if she's charged or not?  \n\nYou may also want to check your department's FB page for her mugshot. Then make that her picture on your phone.",
                "author": "Substantial_Shoe_360",
                "score": 97
              },
              {
                "id": "mu82b94",
                "score": 63,
                "created_utc": 1748201971,
                "body": "Love getting these updates! I would maybe sit on that 5k in case you need a lawyer though because this lady is crashing out and will probably go the legal route at some point. You’re in the right here, but protect your self legally and just stay safe in case she really flies off the handle",
                "author": "SleepParalysisPal"
              },
              {
                "author": "SweeperOfChimneys",
                "body": "So, breaking and entering, and assault at minimum. Hopefully harassment too. Push them to trespass her and the children from your property. Every time you have proof she or her children set foot on your property from then on, call her in for trespassing. Keep it up until she moves or FINALLY learns the lesson. She might bankrupt herself in fines and legal fees, but oh well. Play stupid games, win stupid prizes.",
                "score": 55,
                "id": "mu86kv2",
                "created_utc": 1748203322
              },
              {
                "created_utc": 1748204294,
                "body": "You should absolutely press charges for assault, breaking and entering, and trespassing. This is absolutely insane!!!",
                "author": "BrushFantastic3170",
                "id": "mu89m1j",
                "score": 51
              }
            ],
            "url": "https://reddit.com/r/EntitledPeople/comments/1kvann7/update_the_wedding/",
            "imageType": null,
            "title": "Update: The Wedding",
            "created_utc": 1748200784,
            "body": "Original: https://www.reddit.com/r/neighborsfromhell/s/ynjkeppxNE\n\nI haven’t updated in a while even though some stuff is happened just so I could save it for this giant update. I am so shocked by what happened and I guess I should have listened to some advice about being safe. Also, I phrased the update about the card wrong as the bridesmaids party was last night and the wedding is today (the ceremony just finished just a couple minutes ago and I got the news of what happened by a mutual friend who went to the wedding (I didn’t know he was a mutual friend or going to the wedding. I told him about the situation a while ago and he decided to let me know).\n\nFriday: CN kept looking over the fence. I would have turned on sprinklers, but I don’t have any because I don’t really have grass in my backyard. Later in the day, a police car pulled into CN’s driveway and a bit after, it left. CN’s “revenge” of staring at me continued a lot more after that. I don’t understand why she wastes her time doing it. It doesn’t make me feel uncomfortable.\n\nSaturday: Some people knocked on my door mid day asking if I could let them into the backyard to set up for the bridal party. I called GD and he said it was the right people (just to be safe). They set up some surprisingly expensive and nice decorations and furniture in the yard (not in a destructive way). People come in and out while setting up and the backyard looks amazing. CN continuously peered over the fence for a good amount of time, but I didn’t care. Around 6, B and all the bridesmaids (I’ll do M for bridesmaids) (also about 20 bridesmaids there). I stayed inside mostly, but they occasionally asked me to come out and they drunkenly thanked me. I think the Ms were very wealthy as I received a little over 3K in “tips” from them as I occasionally brought out a carton of ice cream. Well worth it I think. \n\nMore to the events of the party. CN had a campfire in her backyard around 9, but there wasn’t really any wind, so the smoke just stayed in her yard. I think she tried to smoke us out, but maybe she was just having a little fire (I doubt it though). She then gets her hose to put out the fire and “accidentally” sprays water over the fence. Eventually, once the party winds down and they’re packing up, B hands a card signed by all of them thanking me for hosting with additional tips inside (about 2K). I was honestly stunned how nice they were. \n\nAround 11, a very drunk CN bangs on my front door as I’m about to go to sleep. I don’t answer, but have the video on the doorbell camera. She leaves after a bit and I go to bed.\n\nThis morning: this is a secondhand account, so I won’t have all the details. CN comes to the wedding in her very white dress and demands to be let in, but the security denies her. She tries to push the security, but he isn’t fazed. People were watching, but my friend who was there had to go do something (I didn’t ask what). When he gets back, CN isn’t there. \n\nWhat’s happening on my side: this is my account that is right after, but before I got the news about what happened. CN bangs on my door and tries the knob. Since I was getting groceries a bit before, I had accidentally left it unlocked. She comes into my house. I call the cops as soon as I see her open my door. I run upstairs while I give the info to the cops. CN screams at me and eventually slaps me in the face. I’m screaming at her to leave and she tries to slap me again. I grab her wrist and she screams. I basically drag her out the front door right as the police arrive. She is put in the back of the cop car and the police interview me. I tell them and they leave, then I get the news.\n\nCN is not back. I honestly won’t argue with people about if this is true or not as what happened this morning doesn’t feel real even though I just lived through it. ",
            "thumbnail": null,
            "author": "Desperate_Earth_6763",
            "category": "drama",
            "score": 400,
            "hasImage": false,
            "imageUrl": null
          }
        ],
        "subreddits": [
          "neighborsfromhell",
          "entitledparents",
          "EntitledPeople"
        ],
        "count": 3
      }
    },
    "repostPatterns": [
      {
        "id": "10fvwtm",
        "title": "YouTube links &amp; Crossposts are now banned in r/GetMotivated",
        "subreddit": "getmotivated",
        "score": 157
      },
      {
        "id": "1cfx9cj",
        "title": "So validating! I just saw this in my nparent's doctor's chart.",
        "subreddit": "raisedbynarcissists",
        "score": 2513
      },
      {
        "id": "1eiq7kx",
        "title": "I found this on LinkedIn",
        "subreddit": "jobs",
        "score": 4298
      },
      {
        "id": "1h4cigm",
        "title": "I accidentaly found my neighbour's post on this subreddit complaining about me - here's my version of the story",
        "subreddit": "neighborsfromhell",
        "score": 1578
      },
      {
        "id": "1jeh82r",
        "title": "AITA Not reposting friends/family instagram stories after engagement…?",
        "subreddit": "bridezillas",
        "score": 262
      },
      {
        "id": "1kj65bi",
        "title": "\"Unschool\" indeed (x-post /r/facepalm)",
        "subreddit": "insaneparents",
        "score": 1005
      }
    ],
    "subredditMentions": [
      {
        "id": "10ot97e",
        "title": "Make me sign a non-compete when I quit, Sure thing. Nuclear Malicious Compliance...",
        "subreddit": "NuclearRevenge",
        "score": 3542,
        "mentions": [
          "printers"
        ]
      },
      {
        "id": "1235jdl",
        "title": "Fire me for speaking up? Enjoy going out of business....",
        "subreddit": "NuclearRevenge",
        "score": 4291,
        "mentions": [
          "pettyrevenge"
        ]
      },
      {
        "id": "14nk3gc",
        "title": "Subreddit Protest Poll (Reddit is killing third-party applications (and itself))...",
        "subreddit": "entitledparents",
        "score": 56,
        "mentions": [
          "idontworkherelady"
        ]
      },
      {
        "id": "1502juc",
        "title": "Posting Podcasts, Surveys, or your college homework will get you banned....",
        "subreddit": "TalesFromTheFrontDesk",
        "score": 161,
        "mentions": [
          "askhotels"
        ]
      },
      {
        "id": "15vhzob",
        "title": "I blew up a romance scammer’s life...",
        "subreddit": "NuclearRevenge",
        "score": 2325,
        "mentions": [
          "prorevenge"
        ]
      },
      {
        "id": "15vijli",
        "title": "I blew up a romance scammers life...",
        "subreddit": "ProRevenge",
        "score": 4793,
        "mentions": [
          "nuclearrevenge"
        ]
      },
      {
        "id": "160al31",
        "title": "Drive over a kids bike, pay the price...",
        "subreddit": "NuclearRevenge",
        "score": 1874,
        "mentions": [
          "behind"
        ]
      },
      {
        "id": "1859nu2",
        "title": "Fifth Cakeday of r/Nuclearrevenge...",
        "subreddit": "NuclearRevenge",
        "score": 302,
        "mentions": [
          "prorevenge",
          "nuclearevenge"
        ]
      },
      {
        "id": "18eoxgv",
        "title": "What Happens When Neighborhood Punks Decide To Beat Up Veteran's Son...",
        "subreddit": "NuclearRevenge",
        "score": 2004,
        "mentions": [
          "letter"
        ]
      },
      {
        "id": "191pnyk",
        "title": "Sister wants to walk down the aisle at my wedding. We use that to our advantage...",
        "subreddit": "ProRevenge",
        "score": 18941,
        "mentions": [
          "husband"
        ]
      },
      {
        "id": "199ftst",
        "title": "UPDATE - Can't keep it in your pants? Have fun trying to live a normal life....",
        "subreddit": "NuclearRevenge",
        "score": 1005,
        "mentions": [
          "terrorism",
          "etc"
        ]
      },
      {
        "id": "19djqa0",
        "title": "So sue me...can do...",
        "subreddit": "ProRevenge",
        "score": 3831,
        "mentions": [
          "nuclearrevenge"
        ]
      },
      {
        "id": "1bq64qd",
        "title": "Say Goodbye to Your House and Your Retirement...",
        "subreddit": "ProRevenge",
        "score": 2941,
        "mentions": [
          "priest"
        ]
      },
      {
        "id": "1br4wgb",
        "title": "Do not post questions about college admissions, college decisions, or specific u...",
        "subreddit": "college",
        "score": 104,
        "mentions": [
          "applyingtocollege"
        ]
      },
      {
        "id": "1cfx9gm",
        "title": "So apparently it’s my fault you go to dunkin every day ...",
        "subreddit": "entitledparents",
        "score": 1456,
        "mentions": [
          "childfree"
        ]
      },
      {
        "id": "1chlm8d",
        "title": "I turn 22 today. No one has ever remembered my birthday. ...",
        "subreddit": "Advice",
        "score": 1130,
        "mentions": [
          "etc"
        ]
      },
      {
        "id": "1chplo1",
        "title": "Vanguard to charge $100 Exit Fee...",
        "subreddit": "financialindependence",
        "score": 518,
        "mentions": [
          "other"
        ]
      },
      {
        "id": "1cnuyr6",
        "title": "📣 PSA 📣 to all 'doomscrollers' &amp; 'phone addicts': I made an app that lets ...",
        "subreddit": "DecidingToBeBetter",
        "score": 189,
        "mentions": [
          "stryde"
        ]
      },
      {
        "id": "1col57x",
        "title": "AITA for telling my dad there will be no making up for missing my high school gr...",
        "subreddit": "AmItheAsshole",
        "score": 27202,
        "mentions": [
          "son",
          "daughter"
        ]
      },
      {
        "id": "1ctfcyd",
        "title": "Do you really think your expenses don't matter?...",
        "subreddit": "financialindependence",
        "score": 253,
        "mentions": [
          "fatfire"
        ]
      },
      {
        "id": "1cxs73h",
        "title": "Should I allow a homeless friend to live with me? ...",
        "subreddit": "LifeAdvice",
        "score": 227,
        "mentions": [
          "camper"
        ]
      },
      {
        "id": "1cyb9lc",
        "title": "I think I know what causes male entitlement to women...",
        "subreddit": "DecidingToBeBetter",
        "score": 436,
        "mentions": [
          "twoxchromosomes",
          "teurvirgin",
          "foreveralone"
        ]
      },
      {
        "id": "1d2lkbp",
        "title": "Mom splits hairs with nanny to save a few dollars and ends up backpaying hundred...",
        "subreddit": "MaliciousCompliance",
        "score": 15508,
        "mentions": [
          "week"
        ]
      },
      {
        "id": "1d4tnre",
        "title": "Husband M34 Wants Permission to Use and Egg Donor Outside of Our F33 Marriage Be...",
        "subreddit": "relationship_advice",
        "score": 6488,
        "mentions": [
          "surrogate"
        ]
      },
      {
        "id": "1daclaw",
        "title": "Calling a woman \"ma'am\" — yay or nay?...",
        "subreddit": "socialskills",
        "score": 512,
        "mentions": [
          "polite"
        ]
      },
      {
        "id": "1dajdty",
        "title": "I tended to a 9 year old boy during a murder/suicide about 36 hours ago...",
        "subreddit": "offmychest",
        "score": 4624,
        "mentions": [
          "suicide"
        ]
      },
      {
        "id": "1dc8ke8",
        "title": "Think of the comments as inverted Uber ratings. (click to find out what this mea...",
        "subreddit": "relationship_advice",
        "score": 286,
        "mentions": [
          "mildlyinfuriating"
        ]
      },
      {
        "id": "1df3hwo",
        "title": "I don't understand how people have careers and stay athletic or physically capab...",
        "subreddit": "careerguidance",
        "score": 1128,
        "mentions": [
          "job"
        ]
      },
      {
        "id": "1dh1f7x",
        "title": "Boss ignores my background, and learns the FAFO lesson all idiots do....",
        "subreddit": "MaliciousCompliance",
        "score": 10920,
        "mentions": [
          "hr"
        ]
      },
      {
        "id": "1drj073",
        "title": "UPDATE: Caught my wife having an affair with her boss...",
        "subreddit": "survivinginfidelity",
        "score": 653,
        "mentions": [
          "phoenixoriginal"
        ]
      },
      {
        "id": "1durccb",
        "title": "Calling people \"unhoused\" instead of \"homeless\" is doing a disservice to those p...",
        "subreddit": "unpopularopinion",
        "score": 16178,
        "mentions": [
          "residence"
        ]
      },
      {
        "id": "1dv1bn9",
        "title": "A kid on a chat told me to die so I did...",
        "subreddit": "MaliciousCompliance",
        "score": 12889,
        "mentions": [
          "traumatizethemback"
        ]
      },
      {
        "id": "1dwocgw",
        "title": "UPDATE Our neighbors have been having pool parties at our pool while we are not ...",
        "subreddit": "EntitledPeople",
        "score": 24100,
        "mentions": [
          "husband"
        ]
      },
      {
        "id": "1dxvzm2",
        "title": "Annual update: 4 years of FIRE! Post-FIRE check-in with graph and thoughts [M 42...",
        "subreddit": "financialindependence",
        "score": 399,
        "mentions": [
          "warning"
        ]
      },
      {
        "id": "1dxxngo",
        "title": "My husband saw it. He saw the \"stare\" ......",
        "subreddit": "raisedbynarcissists",
        "score": 4118,
        "mentions": [
          "infant",
          "not"
        ]
      },
      {
        "id": "1e7dhxd",
        "title": "The Amex Gold refresh is coming in a few weeks....",
        "subreddit": "CreditCards",
        "score": 612,
        "mentions": [
          "amex"
        ]
      },
      {
        "id": "1e96gg6",
        "title": "I broke up with my girlfriend of 6 years. ...",
        "subreddit": "DecidingToBeBetter",
        "score": 702,
        "mentions": [
          "ulcerativecolitis"
        ]
      },
      {
        "id": "1ectdva",
        "title": "Updated Guidance on the SAVE Pause...",
        "subreddit": "StudentLoans",
        "score": 667,
        "mentions": [
          "24"
        ]
      },
      {
        "id": "1ecxsqj",
        "title": "The Rent Day bonus on the Bilt card is capped to 1,000 points starting on Octobe...",
        "subreddit": "CreditCards",
        "score": 273,
        "mentions": [
          "earn"
        ]
      },
      {
        "id": "1ee91sv",
        "title": "Husband's identity stolen yesterday. Bank says we can't do anything until Monday...",
        "subreddit": "personalfinance",
        "score": 1217,
        "mentions": [
          "do"
        ]
      },
      {
        "id": "1eenoqy",
        "title": "My (34M) wife (31F) is having a meltdown over our daughter's personality and I d...",
        "subreddit": "relationship_advice",
        "score": 11636,
        "mentions": [
          "relationship"
        ]
      },
      {
        "id": "1eeui6e",
        "title": "Would I be insane to sell my house at 2.25%? \n...",
        "subreddit": "personalfinance",
        "score": 1376,
        "mentions": [
          "exterior"
        ]
      },
      {
        "id": "1ekng6s",
        "title": "My student loans were forgiven...But why? ...",
        "subreddit": "StudentLoans",
        "score": 441,
        "mentions": [
          "paramedic"
        ]
      },
      {
        "id": "1ellnnm",
        "title": "ULPT: Call AAA instead of Uber...",
        "subreddit": "UnethicalLifeProTips",
        "score": 8288,
        "mentions": [
          "lyft"
        ]
      },
      {
        "id": "1enrrhw",
        "title": "Cable company kept calling to recharge even after disconnecting service, booked ...",
        "subreddit": "ProRevenge",
        "score": 4018,
        "mentions": [
          "pettyrevenge"
        ]
      },
      {
        "id": "1evojdr",
        "title": "Update - I (28F) found out my husband (29M) has been telling his coworkers that ...",
        "subreddit": "relationship_advice",
        "score": 8487,
        "mentions": [
          "relationship"
        ]
      },
      {
        "id": "1f136sj",
        "title": "I think my father just disowned me....",
        "subreddit": "entitledparents",
        "score": 1937,
        "mentions": [
          "aitah"
        ]
      },
      {
        "id": "1f2zris",
        "title": "Came home from work and my bedroom door was missing...",
        "subreddit": "BadRoommates",
        "score": 2952,
        "mentions": [
          "punctuation"
        ]
      },
      {
        "id": "1f4bndl",
        "title": "Every wedding needs a wrecker...",
        "subreddit": "wedding",
        "score": 719,
        "mentions": [
          "them"
        ]
      },
      {
        "id": "1f4scx8",
        "title": "[Final update] AITA for not inviting my siblings to my wedding?...",
        "subreddit": "bridezillas",
        "score": 1302,
        "mentions": [
          "bachelorette"
        ]
      },
      {
        "id": "1f77f9t",
        "title": "I dont have family and I wanted to tell *someone* all the things I’ve been doing...",
        "subreddit": "DecidingToBeBetter",
        "score": 1779,
        "mentions": [
          "insurance"
        ]
      },
      {
        "id": "1f8zwfb",
        "title": "The “Microretirement” Trend: These Americans Want to Retire Often, Not Early (WS...",
        "subreddit": "financialindependence",
        "score": 386,
        "mentions": [
          "oyin"
        ]
      },
      {
        "id": "1fbs3mp",
        "title": "My neighbor liked to clean...",
        "subreddit": "NuclearRevenge",
        "score": 4686,
        "mentions": [
          "pettyrevenge"
        ]
      },
      {
        "id": "1ffyxfg",
        "title": "TIFU Random Flee Market Item Turns out to be Radioactive ...",
        "subreddit": "tifu",
        "score": 14691,
        "mentions": [
          "whatisthisthing"
        ]
      },
      {
        "id": "1fkohw8",
        "title": "Therapist reached out to me asking me to forgive my abuser. ...",
        "subreddit": "legaladvice",
        "score": 11368,
        "mentions": [
          "ex"
        ]
      },
      {
        "id": "1fmoidg",
        "title": "AITA for making my pregnant SIL cry when she kept asking why I changed my name?...",
        "subreddit": "AmItheAsshole",
        "score": 25097,
        "mentions": [
          "vintage"
        ]
      },
      {
        "id": "1fohb04",
        "title": "the hundreds of ways that compatibility and incompatibility can manifest in dati...",
        "subreddit": "datingoverthirty",
        "score": 364,
        "mentions": [
          "committed"
        ]
      },
      {
        "id": "1ft00c8",
        "title": "UPDATE: My boyfriend (30M) has a close female friend (34F) who blatantly dislike...",
        "subreddit": "relationship_advice",
        "score": 9330,
        "mentions": [
          "relationship",
          "my",
          "my_boyfriend_30m_has_a_close_female_friend_34f"
        ]
      },
      {
        "id": "1fudxsy",
        "title": "SIL who I did too much for felt \"left out\" of my wedding, and pulled me from the...",
        "subreddit": "weddingplanning",
        "score": 986,
        "mentions": [
          "brother"
        ]
      },
      {
        "id": "1fuwkt6",
        "title": "Young kids at wedding-- just don't!...",
        "subreddit": "weddingplanning",
        "score": 529,
        "mentions": [
          "coordinator"
        ]
      },
      {
        "id": "1fz118t",
        "title": "$2M net worth at 37 years young...",
        "subreddit": "financialindependence",
        "score": 432,
        "mentions": [
          "churning"
        ]
      },
      {
        "id": "1g00bw6",
        "title": "$1.1m from $60k job for 16 years ...",
        "subreddit": "financialindependence",
        "score": 259,
        "mentions": [
          "mortgage"
        ]
      },
      {
        "id": "1g5w71f",
        "title": "My (30F) Step-Dad (50M) Checks on Me When I'm Sleeping and I've Told Him Several...",
        "subreddit": "JUSTNOFAMILY",
        "score": 153,
        "mentions": [
          "relationships"
        ]
      },
      {
        "id": "1g88vhh",
        "title": "UPDATE: My (26F) Husband's (26M) family keeps referring to me as his \"best frien...",
        "subreddit": "relationship_advice",
        "score": 11615,
        "mentions": [
          "relationship"
        ]
      },
      {
        "id": "1gawpsu",
        "title": "UPDATE: Well, I told AP’s boyfriend…...",
        "subreddit": "survivinginfidelity",
        "score": 551,
        "mentions": [
          "my"
        ]
      },
      {
        "id": "1gbmt0f",
        "title": "I hate how nonchalant everybody is. ...",
        "subreddit": "socialskills",
        "score": 739,
        "mentions": [
          "weirdo"
        ]
      },
      {
        "id": "1gbzgfx",
        "title": "2025 ACA prices are live on Healthcare.gov for those who use the ACA or are curi...",
        "subreddit": "financialindependence",
        "score": 244,
        "mentions": [
          "fire",
          "2024_aca_prices_are_live_on_healthcaregov_for",
          "leanfire"
        ]
      },
      {
        "id": "1gc4xf2",
        "title": "Finalized my simple 17 credit card setup...",
        "subreddit": "CreditCards",
        "score": 399,
        "mentions": [
          "card"
        ]
      },
      {
        "id": "1gcns4p",
        "title": "Should I email the director of residence life or maintenance about this fire cod...",
        "subreddit": "college",
        "score": 1512,
        "mentions": [
          "firealarms"
        ]
      },
      {
        "id": "1gfziei",
        "title": "Update.  Coworker asked me to be her Man of Honor.  I said no.  She went nuts.  ...",
        "subreddit": "bridezillas",
        "score": 3638,
        "mentions": [
          "best"
        ]
      },
      {
        "id": "1gkfc5a",
        "title": "UPDATE: MIL is booking a vacation at the same time as our honeymoon, at the same...",
        "subreddit": "JUSTNOMIL",
        "score": 2077,
        "mentions": [
          "mil",
          "mil_is_booking_a_vacation_at_the_same_time_as_our"
        ]
      },
      {
        "id": "1gkzv9y",
        "title": "Trump Elected President -- Impact on Student Loan Policy Megathread...",
        "subreddit": "StudentLoans",
        "score": 613,
        "mentions": [
          "politics",
          "worldnews",
          "news",
          "donald_trump_wins_2nd_term_in_historic_return_to"
        ]
      },
      {
        "id": "1gr5w9p",
        "title": "My friends made fun of me because I said I bought grapes as a treat....",
        "subreddit": "povertyfinance",
        "score": 6860,
        "mentions": [
          "assistance"
        ]
      },
      {
        "id": "1grj7bm",
        "title": "My Last Day in Retail!...",
        "subreddit": "TalesFromRetail",
        "score": 100,
        "mentions": [
          "cafe"
        ]
      },
      {
        "id": "1grlgyg",
        "title": "Good-bye InternetParents!...",
        "subreddit": "internetparents",
        "score": 1589,
        "mentions": [
          "redditrequest"
        ]
      },
      {
        "id": "1gtbr5z",
        "title": "I had a full blown “nice guy” meltdown and regret it to this day....",
        "subreddit": "confession",
        "score": 4354,
        "mentions": [
          "niceguys"
        ]
      },
      {
        "id": "1gtc798",
        "title": "[Television] Seinfeld and The Puerto Rican Day: How a flag burning led to compla...",
        "subreddit": "HobbyDrama",
        "score": 362,
        "mentions": [
          "thathappened"
        ]
      },
      {
        "id": "1gvrmx7",
        "title": "[Mixed Martial Arts] UFC 229: How an attack on a bus, An explosive press confere...",
        "subreddit": "HobbyDrama",
        "score": 537,
        "mentions": [
          "mma",
          "ufc"
        ]
      },
      {
        "id": "1gx9z8w",
        "title": "Autistic, in my thirties, and keep running into \"no spark\" with women I actually...",
        "subreddit": "datingoverthirty",
        "score": 251,
        "mentions": [
          "adhd_partners",
          "foreign"
        ]
      },
      {
        "id": "1h0rncu",
        "title": "[Music] Taylor Swift vs KimYe: 15 years of feuding ...",
        "subreddit": "HobbyDrama",
        "score": 869,
        "mentions": [
          "w_1600",
          "taylorswift"
        ]
      },
      {
        "id": "1h367hb",
        "title": "My brother’s wife overheard Nmom screaming at me. “My parents NEVER yelled at me...",
        "subreddit": "raisedbynarcissists",
        "score": 2309,
        "mentions": [
          "witness"
        ]
      },
      {
        "id": "1h393fh",
        "title": "[Roller Coasters] Coaster Wars in 2024: The Tallest Operating Roller Coaster in ...",
        "subreddit": "HobbyDrama",
        "score": 454,
        "mentions": [
          "rollercoasters",
          "rollercoasterjerk"
        ]
      },
      {
        "id": "1h5pres",
        "title": "TIFU by masturbating...literally, just masturbating ...",
        "subreddit": "tifu",
        "score": 12651,
        "mentions": [
          "having"
        ]
      },
      {
        "id": "1hbre9d",
        "title": "My (26m) girlfriend (22F) insists I keep leaving our  toilet dirty when I’m cert...",
        "subreddit": "relationships",
        "score": 711,
        "mentions": [
          "mess"
        ]
      },
      {
        "id": "1hbxkvs",
        "title": "ULPT: Printers can be traced...",
        "subreddit": "UnethicalLifeProTips",
        "score": 5121,
        "mentions": [
          "pics",
          "publicfreakout"
        ]
      },
      {
        "id": "1hcafwj",
        "title": "UPDATE: AIO? My fiancé asked me not to wear white at our wedding...",
        "subreddit": "AmIOverreacting",
        "score": 19452,
        "mentions": [
          "friend"
        ]
      },
      {
        "id": "1hcgshu",
        "title": "Andy Dufresne escaped from Shawshank in 1966: He guided his prison guard ‘client...",
        "subreddit": "financialindependence",
        "score": 447,
        "mentions": [
          "askhistorians"
        ]
      },
      {
        "id": "1heverq",
        "title": "United healthcare denial reasons ...",
        "subreddit": "antiwork",
        "score": 32644,
        "mentions": [
          "nursing"
        ]
      },
      {
        "id": "1hfpkk2",
        "title": "Evil Mamabear is dead. But not before she tried to sue me for grandparents right...",
        "subreddit": "entitledparents",
        "score": 961,
        "mentions": [
          "entitledpeople",
          "kragle"
        ]
      },
      {
        "id": "1hha9a2",
        "title": "Cheating isn't just impacting the cheaters, and I wish more students would reali...",
        "subreddit": "college",
        "score": 1854,
        "mentions": [
          "professors"
        ]
      },
      {
        "id": "1hi3vtn",
        "title": "Obsessed teenager won’t leave my girlfriend alone....",
        "subreddit": "Advice",
        "score": 7294,
        "mentions": [
          "content"
        ]
      },
      {
        "id": "1hi7fvn",
        "title": "Final update- fiancé pushing me to invite my estranged family for our wedding...",
        "subreddit": "weddingdrama",
        "score": 1813,
        "mentions": [
          "aitah"
        ]
      },
      {
        "id": "1hilers",
        "title": "[Video Games - FFXIV] The Ultimate Raid World First Race, and the Raiders who Co...",
        "subreddit": "HobbyDrama",
        "score": 409,
        "mentions": [
          "ffxivdiscussion",
          "ffxiv"
        ]
      },
      {
        "id": "1hkiz1e",
        "title": "[Notre-Dame de Paris] How the reconstruction of a historical monument started a ...",
        "subreddit": "HobbyDrama",
        "score": 1015,
        "mentions": [
          "en",
          "france",
          "culture",
          "what_re_your_dreams",
          "economie",
          "fiches",
          "fiche",
          "comprendre"
        ]
      },
      {
        "id": "1hkqp98",
        "title": "This is a Reminder That Normal People DO NOT:...",
        "subreddit": "raisedbynarcissists",
        "score": 2756,
        "mentions": [
          "restaurant"
        ]
      },
      {
        "id": "1hqr50x",
        "title": "[TCGs - Magic: the Gathering] The Crash: Money, Rage, and Magic: the Gathering...",
        "subreddit": "HobbyDrama",
        "score": 605,
        "mentions": [
          "podcast",
          "magictcg",
          "edh"
        ]
      },
      {
        "id": "1hry55b",
        "title": "[Video Games] Concord, A Game Failure For The Ages, or, How I Stopped Caring And...",
        "subreddit": "HobbyDrama",
        "score": 1299,
        "mentions": [
          "ps5",
          "firewalk_studios_is_filled_with_veterans_from",
          "gamingleaksandrumours",
          "games",
          "gaming",
          "kotakuinaction",
          "pcmasterrace",
          "concordgame",
          "secretlevel"
        ]
      },
      {
        "id": "1hulum6",
        "title": "[Alternate History] A Timeline on Fire: The Story of New Deal Coalition Retained...",
        "subreddit": "HobbyDrama",
        "score": 282,
        "mentions": [
          "imaginarymaps",
          "successful",
          "outoftheloop",
          "fullcommunism"
        ]
      },
      {
        "id": "1hy80ot",
        "title": "[Prog Rock] The Lamb Lies Down On Broadway: How A Frontman’s Ambitions And Some ...",
        "subreddit": "HobbyDrama",
        "score": 636,
        "mentions": [
          "genesis"
        ]
      },
      {
        "id": "1i183zw",
        "title": "[Olympic Games 2024] Feel the Olympic spirit! Go in debt, hide your poor, clean ...",
        "subreddit": "HobbyDrama",
        "score": 802,
        "mentions": [
          "media",
          "wp",
          "franceinter",
          "france",
          "sports",
          "en",
          "figaro",
          "uploads",
          "terrains",
          "video",
          "sport",
          "carte",
          "centre"
        ]
      },
      {
        "id": "1i1ntkj",
        "title": "[Cricket] The best of teams, the weirdest of rules – a scattershot of Australian...",
        "subreddit": "HobbyDrama",
        "score": 464,
        "mentions": [
          "batter"
        ]
      },
      {
        "id": "1i6nvt2",
        "title": "Is it normal to just wear white to weddings now??? Had multiple people wear whit...",
        "subreddit": "bridezillas",
        "score": 1649,
        "mentions": [
          "son",
          "father"
        ]
      },
      {
        "id": "1i6s1xq",
        "title": "[Sufficient Velocity] How One Transphobic Remark in a Popular Story Led to the M...",
        "subreddit": "HobbyDrama",
        "score": 740,
        "mentions": [
          "wormfanfic"
        ]
      },
      {
        "id": "1ic7imq",
        "title": "[Videogame community and modders – Team Fortress 2] How to foster and nurture a ...",
        "subreddit": "HobbyDrama",
        "score": 431,
        "mentions": [
          "wp",
          "tf2",
          "momsagainstanime",
          "omicronceti",
          "truetf2"
        ]
      },
      {
        "id": "1idcnmb",
        "title": "My sister: \"Kay\" the heartless...",
        "subreddit": "bridezillas",
        "score": 120,
        "mentions": [
          "abuser"
        ]
      },
      {
        "id": "1ieh980",
        "title": "[Women's Cycling] The race that never was...",
        "subreddit": "HobbyDrama",
        "score": 380,
        "mentions": [
          "football",
          "pro_cycling_inflategate_and_the_wet_hell_of_the"
        ]
      },
      {
        "id": "1ifexp8",
        "title": "[Video Games] The Cuck Chronicles : A saga on the CN and En Gacha communities' w...",
        "subreddit": "HobbyDrama",
        "score": 673,
        "mentions": [
          "subredditdrama",
          "gachagaming",
          "girlsfrontline2",
          "girlsfrontline",
          "snowbreak",
          "snowbreakofficial"
        ]
      },
      {
        "id": "1ihr9k5",
        "title": "[Programming Languages] Valid or Void? Venturing into the V Programming Language...",
        "subreddit": "HobbyDrama",
        "score": 385,
        "mentions": [
          "programming"
        ]
      },
      {
        "id": "1iifyoz",
        "title": "[Gordon Ramsaydom] ‘Are You A Better Cook Than A Fifth Grader?’ or how Gordon Ra...",
        "subreddit": "HobbyDrama",
        "score": 2556,
        "mentions": [
          "tom"
        ]
      },
      {
        "id": "1ilhqma",
        "title": "[Video Games] Final Fantasy Brave Exvius: Overpowered Bunny Girls Destroys Highl...",
        "subreddit": "HobbyDrama",
        "score": 769,
        "mentions": [
          "ffbraveexvius",
          "gl_news_maint_akstar_zeno_of_the_beta_star_story"
        ]
      },
      {
        "id": "1ir9yak",
        "title": "[Broadway/Theatre] Bathing Beauty, or the tale of Andrew Lloyd Webber, Patti LuP...",
        "subreddit": "HobbyDrama",
        "score": 1169,
        "mentions": [
          "jlgau96rfpwwow4qxhy6p9ygfpm"
        ]
      },
      {
        "id": "1iwb1vh",
        "title": "[VideoGames] How a community gaslighted itself to solve an ARG that never existe...",
        "subreddit": "HobbyDrama",
        "score": 1527,
        "mentions": [
          "silksong",
          "twobestfriendsplay"
        ]
      },
      {
        "id": "1ixig94",
        "title": "[Indie Perfumes/Perfumetok] Coney Island Shady: How one formerly beloved perfume...",
        "subreddit": "HobbyDrama",
        "score": 1258,
        "mentions": [
          "cold",
          "fragrance",
          "musician",
          "indiemakeupandmore"
        ]
      },
      {
        "id": "1iyavfj",
        "title": "Read this before you submit your post!...",
        "subreddit": "weddingshaming",
        "score": 378,
        "mentions": [
          "weddings",
          "weddingplanning",
          "relationship_advice",
          "amitheasshole",
          "aitah"
        ]
      },
      {
        "id": "1j43x7m",
        "title": "[Manga/Boruto: Naruto Next Generations] Naruto Gaiden, Sasuke Retsuden, Hall of ...",
        "subreddit": "HobbyDrama",
        "score": 610,
        "mentions": [
          "2023"
        ]
      },
      {
        "id": "1j6vhkc",
        "title": "[Figure Skating] That Time the FS Fandom Lost Its Collective Mind Over a Sweatsh...",
        "subreddit": "HobbyDrama",
        "score": 856,
        "mentions": [
          "underscores"
        ]
      },
      {
        "id": "1jaqrhf",
        "title": "Man stalking me on Reddit starts stalking me in real life...",
        "subreddit": "LetsNotMeet",
        "score": 910,
        "mentions": [
          "symbology"
        ]
      },
      {
        "id": "1jbc274",
        "title": "[Pro Cycling] Matej Mohoric and the 2022 San Remo Heist...",
        "subreddit": "HobbyDrama",
        "score": 178,
        "mentions": [
          "pro_cycling_inflategate_and_the_wet_hell_of_the",
          "van"
        ]
      },
      {
        "id": "1jbvxbq",
        "title": "Am I a bad friend or is she a bridezilla...",
        "subreddit": "bridezillas",
        "score": 860,
        "mentions": [
          "makeup"
        ]
      },
      {
        "id": "1jc4909",
        "title": "Read before commenting: Off-topic and anecdotal comments are not allowed and sub...",
        "subreddit": "legaladvice",
        "score": 152,
        "mentions": [
          "bestoflegaladvice",
          "legaladviceofftopic"
        ]
      },
      {
        "id": "1jgtijq",
        "title": "is it normal for brides to make expensive unilateral decisions?...",
        "subreddit": "bridezillas",
        "score": 443,
        "mentions": [
          "makeup"
        ]
      },
      {
        "id": "1jiapmv",
        "title": "[Video Games] The Rise and Fall of Twitter’s Leaker Idol...",
        "subreddit": "HobbyDrama",
        "score": 770,
        "mentions": [
          "gamingleaksandrumors",
          "gamingleaksandrumours",
          "persona",
          "twobestfriendsplay",
          "persona5",
          "comment"
        ]
      },
      {
        "id": "1jiq1jr",
        "title": "I'm so done with my sister's wedding......",
        "subreddit": "bridezillas",
        "score": 333,
        "mentions": [
          "godchild"
        ]
      },
      {
        "id": "1jlxs2m",
        "title": "Would you like me to help with that? \"NO!!\"...",
        "subreddit": "TalesFromRetail",
        "score": 205,
        "mentions": [
          "talesfrom"
        ]
      },
      {
        "id": "1jly5bj",
        "title": "[Theme Parks] July 17 1955 - The disastrous opening day of Disneyland...",
        "subreddit": "HobbyDrama",
        "score": 589,
        "mentions": [
          "tokyono"
        ]
      },
      {
        "id": "1jnj4sk",
        "title": "[Emilia Pérez] The heartwarming movie about a Mexican transgender drug-lord that...",
        "subreddit": "HobbyDrama",
        "score": 1574,
        "mentions": [
          "cinema",
          "cultura"
        ]
      },
      {
        "id": "1jpc8bf",
        "title": "Great Bride/Groom, great ceremony/reception, horrible night before and after par...",
        "subreddit": "weddingshaming",
        "score": 755,
        "mentions": [
          "bachelorette",
          "her"
        ]
      },
      {
        "id": "1jqpgvn",
        "title": "[Video Games] The Top World of Warcraft Players Takes Turns Accusing Each Other ...",
        "subreddit": "HobbyDrama",
        "score": 714,
        "mentions": [
          "wow"
        ]
      },
      {
        "id": "1js980v",
        "title": "[Eurovision] An assorted collection of various dramas from the Eurovision 2025 p...",
        "subreddit": "HobbyDrama",
        "score": 743,
        "mentions": [
          "band"
        ]
      },
      {
        "id": "1jt74k6",
        "title": "what is your most judgmental take on weddings...",
        "subreddit": "weddingshaming",
        "score": 398,
        "mentions": [
          "wedding"
        ]
      },
      {
        "id": "1juea3g",
        "title": "[American Comics] The Most “Legitomite” Art Thief in Comics, or the Guy who Unit...",
        "subreddit": "HobbyDrama",
        "score": 997,
        "mentions": [
          "press"
        ]
      },
      {
        "id": "1jwzubk",
        "title": "[Webcomics] Let's leave this exposed \"side hussle\"- The story of Let's Play, one...",
        "subreddit": "HobbyDrama",
        "score": 763,
        "mentions": [
          "webtoons",
          "x",
          "profitable"
        ]
      },
      {
        "id": "1k0qghg",
        "title": "My bio thing keeps trying to contact me, and my aunt likes being in the middle.....",
        "subreddit": "JUSTNOFAMILY",
        "score": 56,
        "mentions": [
          "entitledparents"
        ]
      },
      {
        "id": "1k2j6jw",
        "title": "[Minecraft YouTube] “Apologists” &amp; The Character Who Split a Fandom in Two...",
        "subreddit": "HobbyDrama",
        "score": 698,
        "mentions": [
          "dreamsmp",
          "dreamwastaken2",
          "amithedevil"
        ]
      },
      {
        "id": "1k4ypgj",
        "title": "[Hockey] Fight Night at the Joe, or How the Nastiest Rivalry in Hockey Got Start...",
        "subreddit": "HobbyDrama",
        "score": 414,
        "mentions": [
          "_"
        ]
      },
      {
        "id": "1k6bz3m",
        "title": "[European Comics] Siggi und die Ostgoten: How Germany's controversial \"Foxlord\" ...",
        "subreddit": "HobbyDrama",
        "score": 939,
        "mentions": [
          "fuerst",
          "rolf",
          "produkt"
        ]
      },
      {
        "id": "1ka10bx",
        "title": "How Important is Career/Income?...",
        "subreddit": "datingoverthirty",
        "score": 277,
        "mentions": [
          "income",
          "goals"
        ]
      },
      {
        "id": "1kbs0sp",
        "title": "My mom didn’t agree with me having church wedding &amp; embarrassed me in front ...",
        "subreddit": "weddingshaming",
        "score": 376,
        "mentions": [
          "daughter"
        ]
      },
      {
        "id": "1kcqlen",
        "title": "Looking for a Post? Ask Here! - May 2025 Edition...",
        "subreddit": "BestofRedditorUpdates",
        "score": 265,
        "mentions": [
          "trueoffmychest",
          "bestofboru",
          "bestofpositiveupdates",
          "ohnoconsequences",
          "bestofredditorsagas"
        ]
      },
      {
        "id": "1ke66ti",
        "title": "[Video Games] The Rise and Fall and of ZA/UM...",
        "subreddit": "HobbyDrama",
        "score": 672,
        "mentions": [
          "discoelysium"
        ]
      },
      {
        "id": "1kg8prw",
        "title": "[Video Games] A Complete Nobody Wins the Race to World First... Kind Of? The Goo...",
        "subreddit": "HobbyDrama",
        "score": 1135,
        "mentions": [
          "wow"
        ]
      },
      {
        "id": "1kgypzq",
        "title": "[Video Games/Team Fortress 2] The Condensed, Bizarre Tale of tacobot.tf, and its...",
        "subreddit": "HobbyDrama",
        "score": 801,
        "mentions": [
          "tf2"
        ]
      },
      {
        "id": "1khfrud",
        "title": "AITAH for not attending a bachelorette...",
        "subreddit": "weddingdrama",
        "score": 71,
        "mentions": [
          "bachelorette"
        ]
      },
      {
        "id": "1ki4rhn",
        "title": "My Mom is treating my wedding like her funeral....",
        "subreddit": "weddingdrama",
        "score": 447,
        "mentions": [
          "wedding"
        ]
      },
      {
        "id": "1ki72nj",
        "title": "Regretting being a best man, can I back out?...",
        "subreddit": "weddingdrama",
        "score": 67,
        "mentions": [
          "partier"
        ]
      },
      {
        "id": "1kj65bi",
        "title": "\"Unschool\" indeed (x-post /r/facepalm)...",
        "subreddit": "insaneparents",
        "score": 1005,
        "mentions": [
          "facepalm"
        ]
      },
      {
        "id": "1km5tqn",
        "title": "My crazy neighbor poisoned my creek and stole water...",
        "subreddit": "entitledparents",
        "score": 474,
        "mentions": [
          "neighborsfromhell"
        ]
      },
      {
        "id": "1knmbwz",
        "title": "I'm starting to understand why some students drop out their senior year...",
        "subreddit": "college",
        "score": 1163,
        "mentions": [
          "senior"
        ]
      },
      {
        "id": "1kq2kvz",
        "title": "Company car I was driving was hit by a drunk driver. Insurance fully paid for th...",
        "subreddit": "BestofRedditorUpdates",
        "score": 23675,
        "mentions": [
          "legaladvice"
        ]
      },
      {
        "id": "1kqvrcy",
        "title": "(24m)I read my girlfriend's(23f) text from her boss and don't know what to to do...",
        "subreddit": "BestofRedditorUpdates",
        "score": 1795,
        "mentions": [
          "relationships"
        ]
      },
      {
        "id": "1kqvrff",
        "title": "AITJ for Not Letting My Friend Bring Her Dog to Stay at My House While She Visit...",
        "subreddit": "BestofRedditorUpdates",
        "score": 2797,
        "mentions": [
          "amithejerk"
        ]
      },
      {
        "id": "1kqvsw6",
        "title": "Is it worth it to try to work things out with my boyfriend, who is jealous of my...",
        "subreddit": "BestofRedditorUpdates",
        "score": 5289,
        "mentions": [
          "relationships"
        ]
      },
      {
        "id": "1kqvuar",
        "title": "My 8 year old son hates me, and I don't understand why....",
        "subreddit": "BestofRedditorUpdates",
        "score": 9488,
        "mentions": [
          "trueoffmychest"
        ]
      },
      {
        "id": "1kqw8gl",
        "title": "AITA for backing out of giving my old “friend” a ride to the airport and ignorin...",
        "subreddit": "BestofRedditorUpdates",
        "score": 5039,
        "mentions": [
          "stock_vacation",
          "amitheasshole"
        ]
      },
      {
        "id": "1kqx2ie",
        "title": "My parents are forcing me to give my baby up for adoption (new update)...",
        "subreddit": "BestofRedditorUpdates",
        "score": 2184,
        "mentions": [
          "trueoffmychest",
          "my_parents_are_forcing_me_to_give_my_baby_up_for",
          "nectarineneither7912",
          "inlaws"
        ]
      },
      {
        "id": "1kr4w4e",
        "title": "I'm 16, I'm pregnant, I need advice now!...",
        "subreddit": "BestofRedditorUpdates",
        "score": 1404,
        "mentions": [
          "awkward_culture1",
          "advice"
        ]
      },
      {
        "id": "1kr8coq",
        "title": "Update: Really funny mini-revenge...",
        "subreddit": "entitledparents",
        "score": 239,
        "mentions": [
          "neighborsfromhell"
        ]
      },
      {
        "id": "1kr8win",
        "title": "I [17/M] might not be my dad's son and my older brother [20/M] and my parents ar...",
        "subreddit": "BestofRedditorUpdates",
        "score": 6224,
        "mentions": [
          "relationship_advice",
          "aitah"
        ]
      },
      {
        "id": "1kr9n3k",
        "title": "UPDATE: Today, I drop the rope...",
        "subreddit": "JUSTNOFAMILY",
        "score": 180,
        "mentions": [
          "into"
        ]
      },
      {
        "id": "1krcps4",
        "title": "CONCLUDED - 4000 in Federal tax credit was at risk, so I sued Carvana in Small C...",
        "subreddit": "BestofRedditorUpdates",
        "score": 1789,
        "mentions": [
          "electricvehicles",
          "equinoxev",
          "asklegal",
          "pkg_web_name_srch_inq",
          "cheetah7985",
          "carvana"
        ]
      },
      {
        "id": "1krdbae",
        "title": "OOP runs into his ex-wife after 6 years...",
        "subreddit": "BestofRedditorUpdates",
        "score": 7986,
        "mentions": [
          "survivinginfidelity",
          "update_exwife_back_in_my_life_after_6_years"
        ]
      },
      {
        "id": "1krmgg7",
        "title": "AITA for forcing my father's partner to take back a lie she told my children?...",
        "subreddit": "BestofRedditorUpdates",
        "score": 2735,
        "mentions": [
          "noorlando_25",
          "aitah"
        ]
      },
      {
        "id": "1kroozl",
        "title": "[New Update]: AITA for not wanting to walk her down the aisle or lie in a speech...",
        "subreddit": "BestofRedditorUpdates",
        "score": 3342,
        "mentions": [
          "amitheasshole",
          "aitah",
          "mother",
          "daughter",
          "greatestthrow"
        ]
      },
      {
        "id": "1kropvu",
        "title": "My wife just stopped talking to me. I don’t know when it started, but now it’s j...",
        "subreddit": "BestofRedditorUpdates",
        "score": 9464,
        "mentions": [
          "yeoeulju",
          "trueoffmychest"
        ]
      },
      {
        "id": "1kroqbx",
        "title": "Newest Update: AITA for giving crappy Christmas gifts and ruining my marriage?...",
        "subreddit": "BestofRedditorUpdates",
        "score": 5941,
        "mentions": [
          "potential_low_8645",
          "aitah"
        ]
      },
      {
        "id": "1kroqfh",
        "title": "Husband, 37M, attempted to manipulate me, 35F. I called his bluff. Now what?...",
        "subreddit": "BestofRedditorUpdates",
        "score": 4353,
        "mentions": [
          "relationship_advice"
        ]
      },
      {
        "id": "1kroroy",
        "title": "[New Update – 20 months later]: AITAH for telling my fiancé that if he expects m...",
        "subreddit": "BestofRedditorUpdates",
        "score": 5772,
        "mentions": [
          "aitah",
          "u_throwradownsizing"
        ]
      },
      {
        "id": "1kroya1",
        "title": "What crimes did my wife commit?...",
        "subreddit": "BestofRedditorUpdates",
        "score": 8767,
        "mentions": [
          "legaladvice",
          "internetparents"
        ]
      },
      {
        "id": "1krp1zq",
        "title": "New to this sub update: My husband (32M) is convinced I (26F) am pregnant. I’m n...",
        "subreddit": "BestofRedditorUpdates",
        "score": 10349,
        "mentions": [
          "throwra_losingmind",
          "relationship_advice",
          "cancerfamilysupport",
          "update"
        ]
      },
      {
        "id": "1krxo2q",
        "title": "Fax and shred...",
        "subreddit": "MaliciousCompliance",
        "score": 2503,
        "mentions": [
          "whatever"
        ]
      },
      {
        "id": "1ks4wzf",
        "title": "AITA for refusing to go to my Brothers wedding if my Girlfriend cannot come?...",
        "subreddit": "BestofRedditorUpdates",
        "score": 4792,
        "mentions": [
          "amitheasshole"
        ]
      },
      {
        "id": "1ks4yis",
        "title": "I do not want the executor to change the Will...",
        "subreddit": "BestofRedditorUpdates",
        "score": 3441,
        "mentions": [
          "auslegal",
          "aitah"
        ]
      },
      {
        "id": "1kshldg",
        "title": "AITA for telling a co-worker that her choice(s) of name for her twins is idiotic...",
        "subreddit": "BestofRedditorUpdates",
        "score": 6528,
        "mentions": [
          "amitheasshole"
        ]
      },
      {
        "id": "1kshlfw",
        "title": "AITAH for breaking up with my gf because she slept with someone after saying \"I ...",
        "subreddit": "BestofRedditorUpdates",
        "score": 3136,
        "mentions": [
          "aitah"
        ]
      },
      {
        "id": "1kshmth",
        "title": "AITB for leaving up a swing for my brother...",
        "subreddit": "BestofRedditorUpdates",
        "score": 4842,
        "mentions": [
          "amithebuttface"
        ]
      },
      {
        "id": "1kshmvm",
        "title": "AITAH for leaving the weekend friend trip after being made to sleep on the couch...",
        "subreddit": "BestofRedditorUpdates",
        "score": 3790,
        "mentions": [
          "aitah",
          "really"
        ]
      },
      {
        "id": "1ksho2h",
        "title": "How to catch a thief...",
        "subreddit": "BestofRedditorUpdates",
        "score": 2378,
        "mentions": [
          "pettyrevenge"
        ]
      },
      {
        "id": "1ksho3b",
        "title": "My[20f] boyfriend [22m] keeps pushing a firm boundary I've made about my dog. Ho...",
        "subreddit": "BestofRedditorUpdates",
        "score": 2837,
        "mentions": [
          "relationship_advice"
        ]
      },
      {
        "id": "1kshsi4",
        "title": "OOP's son is detained at the airport and asked about his political beliefs...",
        "subreddit": "BestofRedditorUpdates",
        "score": 13124,
        "mentions": [
          "yamericay",
          "washingtondc",
          "19"
        ]
      },
      {
        "id": "1kspr02",
        "title": "[Video Games/Dead by Daylight] The Depressing Drama of The Unknown's design....",
        "subreddit": "HobbyDrama",
        "score": 1444,
        "mentions": [
          "deadbydaylight"
        ]
      },
      {
        "id": "1kswqih",
        "title": "I finally got one!...",
        "subreddit": "ChoosingBeggars",
        "score": 2301,
        "mentions": [
          "see"
        ]
      },
      {
        "id": "1ktacy6",
        "title": "AITA for not wanting to get a job?...",
        "subreddit": "BestofRedditorUpdates",
        "score": 2878,
        "mentions": [
          "amitheasshole"
        ]
      },
      {
        "id": "1ktad42",
        "title": "My husband had an “affair” with my little sister....",
        "subreddit": "BestofRedditorUpdates",
        "score": 10040,
        "mentions": [
          "offmychest"
        ]
      },
      {
        "id": "1ktaefj",
        "title": "I need to find help for a gay teenager who does not want to go to a camp to \"cur...",
        "subreddit": "BestofRedditorUpdates",
        "score": 5944,
        "mentions": [
          "legaladvice",
          "amitheasshole"
        ]
      },
      {
        "id": "1ktaeia",
        "title": "AITA for telling my MIL that her \"generous\" offer was actually a manipulative wa...",
        "subreddit": "BestofRedditorUpdates",
        "score": 5943,
        "mentions": [
          "aitah"
        ]
      },
      {
        "id": "1ktafqb",
        "title": "Boyfriend might propose soon, but can this work if I’m monogamous and he’s not...",
        "subreddit": "BestofRedditorUpdates",
        "score": 4201,
        "mentions": [
          "swingers"
        ]
      },
      {
        "id": "1ktafs1",
        "title": "AITAH for telling my niece that the family does not like her fiance and that I w...",
        "subreddit": "BestofRedditorUpdates",
        "score": 2808,
        "mentions": [
          "aitah"
        ]
      },
      {
        "id": "1ktgnyc",
        "title": "I think wife (48F) of 25 yrs is cheating. Help, need proof or advice. (50M)...",
        "subreddit": "BestofRedditorUpdates",
        "score": 2143,
        "mentions": [
          "throwraworrieddummy",
          "relationship_advice"
        ]
      },
      {
        "id": "1kth3ld",
        "title": "I caught my (24f) boyfriend (26m) talking to findommes for the third time. He wa...",
        "subreddit": "BestofRedditorUpdates",
        "score": 2398,
        "mentions": [
          "hurtbuthopeful_12345",
          "relationships",
          "stopfindom"
        ]
      },
      {
        "id": "1ktj4mq",
        "title": "I [31m] told my girlfriend [30f] that she is not a trophy wife or status symbol ...",
        "subreddit": "BestofRedditorUpdates",
        "score": 6689,
        "mentions": [
          "relationship_advice"
        ]
      },
      {
        "id": "1ktyuhp",
        "title": "Got Married on 5.3.25. This subreddit was super helpful for the early days of my...",
        "subreddit": "datingoverthirty",
        "score": 546,
        "mentions": [
          "datingoverthirty_success_me_33_and_gf_33_of"
        ]
      },
      {
        "id": "1ku2pvm",
        "title": "AIO? I think my gf might be cheating on me through her Dungeons and Dragons game...",
        "subreddit": "BestofRedditorUpdates",
        "score": 3399,
        "mentions": [
          "amioverreacting"
        ]
      },
      {
        "id": "1ku2pxc",
        "title": "Am I overreacting for calling off my wedding after my fiancé got drunk, put on m...",
        "subreddit": "BestofRedditorUpdates",
        "score": 3948,
        "mentions": [
          "amioverreacting"
        ]
      },
      {
        "id": "1ku2rb2",
        "title": "AITAH for retaliating against one of my bullies for something he repeatedly did ...",
        "subreddit": "BestofRedditorUpdates",
        "score": 5389,
        "mentions": [
          "aitah"
        ]
      },
      {
        "id": "1ku2rc1",
        "title": "AITAH for kicking out my gf's sister and her kids out of my flat after my gf gav...",
        "subreddit": "BestofRedditorUpdates",
        "score": 3295,
        "mentions": [
          "aitah"
        ]
      },
      {
        "id": "1ku2sjn",
        "title": "My boyfriend and I went Instagram official, now I’m being accused of cheating on...",
        "subreddit": "BestofRedditorUpdates",
        "score": 5725,
        "mentions": [
          "twohottakes"
        ]
      },
      {
        "id": "1ku3erf",
        "title": "the fella who arrived on my balcony is now my roommate...",
        "subreddit": "BestofRedditorUpdates",
        "score": 2516,
        "mentions": [
          "stonedmalf",
          "parrots",
          "lovebirds",
          "birds"
        ]
      },
      {
        "id": "1ku3k93",
        "title": "AITA for buying myself an Xbox when my bf said he got me one for my birthday las...",
        "subreddit": "BestofRedditorUpdates",
        "score": 7947,
        "mentions": [
          "kittyhawk012",
          "amitheasshole"
        ]
      },
      {
        "id": "1ku9cbz",
        "title": "Freezie Day...",
        "subreddit": "pettyrevenge",
        "score": 491,
        "mentions": [
          "coworker"
        ]
      },
      {
        "id": "1kucnw5",
        "title": "AITA for wanting to cut off my close friend after she booked their wedding 6 day...",
        "subreddit": "BestofRedditorUpdates",
        "score": 2864,
        "mentions": [
          "twohottakes"
        ]
      },
      {
        "id": "1kuj1ys",
        "title": "AITA for asking my half sister not to have my dad walk her down the aisle?...",
        "subreddit": "BestofRedditorUpdates",
        "score": 2741,
        "mentions": [
          "amitheasshole"
        ]
      },
      {
        "id": "1kujkls",
        "title": "While boarding a flight, a woman decided to hop right in front of me on a long l...",
        "subreddit": "EntitledPeople",
        "score": 1604,
        "mentions": [
          "spouse"
        ]
      },
      {
        "id": "1kutm67",
        "title": "I [24M] caught my girlfriend [23F] sleeping in bed with her male friend [25M] af...",
        "subreddit": "BestofRedditorUpdates",
        "score": 3495,
        "mentions": [
          "relationships"
        ]
      },
      {
        "id": "1kutm8b",
        "title": "WIBTAH if I told my fiancé I wouldn’t come to our wedding if he insists on invit...",
        "subreddit": "BestofRedditorUpdates",
        "score": 1991,
        "mentions": [
          "charlottedobreyoutube"
        ]
      },
      {
        "id": "1kutm8i",
        "title": "Nothing like finally getting engaged to the love of your life, and planning your...",
        "subreddit": "BestofRedditorUpdates",
        "score": 8605,
        "mentions": [
          "diamineceladoncat",
          "lgbtweddings",
          "gosigratta",
          "your"
        ]
      },
      {
        "id": "1kutnle",
        "title": "AITAH for telling my parents they were deserve to be kicked out of my sisters we...",
        "subreddit": "BestofRedditorUpdates",
        "score": 2954,
        "mentions": [
          "aitah"
        ]
      },
      {
        "id": "1kutnsy",
        "title": "Bride won’t speak to me bc I cannot afford destination wedding...",
        "subreddit": "bridezillas",
        "score": 678,
        "mentions": [
          "makeup"
        ]
      },
      {
        "id": "1kuto1q",
        "title": "My best friend (25/F) thinks I (25/F) ruined a relationship and now she won't ta...",
        "subreddit": "BestofRedditorUpdates",
        "score": 5672,
        "mentions": [
          "relationships"
        ]
      },
      {
        "id": "1kutou9",
        "title": "AITA for telling my estranged mom her criminal son can’t live with me (and his f...",
        "subreddit": "BestofRedditorUpdates",
        "score": 3162,
        "mentions": [
          "twohottakes"
        ]
      },
      {
        "id": "1kutqlr",
        "title": "I (20M) went to a strip club with my girlfriend (20F) and it was a disaster...",
        "subreddit": "BestofRedditorUpdates",
        "score": 7643,
        "mentions": [
          "relationship_advice"
        ]
      },
      {
        "id": "1kutuhb",
        "title": "WIBTB for telling me girlfriend she can’t “frog it” around me anymore?...",
        "subreddit": "BestofRedditorUpdates",
        "score": 6059,
        "mentions": [
          "nomorefroggingit",
          "amithebuttface",
          "amitheasshole",
          "wibtb_for_telling_me_girlfriend_she_cant_frog_it",
          "in"
        ]
      },
      {
        "id": "1kvankh",
        "title": "Update: The Wedding...",
        "subreddit": "entitledparents",
        "score": 270,
        "mentions": [
          "neighborsfromhell"
        ]
      },
      {
        "id": "1kvann7",
        "title": "Update: The Wedding...",
        "subreddit": "EntitledPeople",
        "score": 400,
        "mentions": [
          "neighborsfromhell"
        ]
      },
      {
        "id": "1kvbjbq",
        "title": "A Letter to the Dog Walker...",
        "subreddit": "BestofRedditorUpdates",
        "score": 3529,
        "mentions": [
          "lexington"
        ]
      },
      {
        "id": "1kvi7et",
        "title": "Sacked. Police. Computer Misuse and on holiday...",
        "subreddit": "BestofRedditorUpdates",
        "score": 2003,
        "mentions": [
          "legaladviceuk",
          "benefitsadviceuk",
          "will_my_claim_affect_my_wifes_claim"
        ]
      },
      {
        "id": "1kvl2tw",
        "title": "AITA for causing my MIL to sell her new house?...",
        "subreddit": "BestofRedditorUpdates",
        "score": 3874,
        "mentions": [
          "twohottakes"
        ]
      },
      {
        "id": "1kvl2ug",
        "title": "My GFs \"girl nights outs\" included her friends SOs, I feel left out...",
        "subreddit": "BestofRedditorUpdates",
        "score": 9269,
        "mentions": [
          "relationship_advice"
        ]
      },
      {
        "id": "1kvl4cj",
        "title": "AITA for telling my coworker, I don't need to stop crocheting while on break bc ...",
        "subreddit": "BestofRedditorUpdates",
        "score": 5620,
        "mentions": [
          "amitheasshole"
        ]
      },
      {
        "id": "1kvl4lz",
        "title": "My parents (F45/M46) are actively undermining my healing from SA. Can I (F20) co...",
        "subreddit": "BestofRedditorUpdates",
        "score": 1840,
        "mentions": [
          "relationship_advice"
        ]
      },
      {
        "id": "1kvxxp2",
        "title": "AITAH for calling the ambulance for my co-worker even though I know she was kind...",
        "subreddit": "BestofRedditorUpdates",
        "score": 5167,
        "mentions": [
          "normal_midnight1661",
          "aitah"
        ]
      },
      {
        "id": "1kw0as6",
        "title": "I was castigated on the parenting sub just because my disabled wife and I wanted...",
        "subreddit": "offmychest",
        "score": 430,
        "mentions": [
          "son"
        ]
      },
      {
        "id": "1kw1xgc",
        "title": "AITA for not letting my mothers husband come to my wedding?...",
        "subreddit": "BestofRedditorUpdates",
        "score": 3886,
        "mentions": [
          "aitah"
        ]
      },
      {
        "id": "1kw6qhk",
        "title": "OOP and the eternally poor golden child (Long) Part 1 of 2...",
        "subreddit": "BestofRedditorUpdates",
        "score": 1615,
        "mentions": [
          "entitledparents"
        ]
      },
      {
        "id": "1kw6uvz",
        "title": "OOP and the eternally poor golden child (Long) Part 2 of 2...",
        "subreddit": "BestofRedditorUpdates",
        "score": 1380,
        "mentions": [
          "entitledparents"
        ]
      },
      {
        "id": "1kwdz0a",
        "title": "Boyfriend and his girl best friend on social media being excessive...",
        "subreddit": "BestofRedditorUpdates",
        "score": 2121,
        "mentions": [
          "relationships"
        ]
      },
      {
        "id": "1kwdz2o",
        "title": "Am I Overreacting after my teacher (55M) confessed his love to me (18F)...",
        "subreddit": "BestofRedditorUpdates",
        "score": 3541,
        "mentions": [
          "amioverreacting"
        ]
      },
      {
        "id": "1kwe0iz",
        "title": "My [16M] family wants me to photoshop a diploma for my brother [22M]....",
        "subreddit": "BestofRedditorUpdates",
        "score": 3875,
        "mentions": [
          "relationships"
        ]
      },
      {
        "id": "1kwe0ll",
        "title": "AIO husband wants new truck, I want debt paid off first...",
        "subreddit": "BestofRedditorUpdates",
        "score": 1467,
        "mentions": [
          "amioverreacting"
        ]
      },
      {
        "id": "1kwe1vx",
        "title": "[New Updates]: AITAH: For being petty to my girlfriends parents?...",
        "subreddit": "BestofRedditorUpdates",
        "score": 2097,
        "mentions": [
          "aitah"
        ]
      },
      {
        "id": "1kwe2xe",
        "title": "Got scammed by Paypal buyer, I visited the buyer's address and got the money fro...",
        "subreddit": "BestofRedditorUpdates",
        "score": 2965,
        "mentions": [
          "scambreak2506",
          "legaladviceuk"
        ]
      },
      {
        "id": "1kwe38d",
        "title": "AITAH for wanting my sister to change her wedding date because it falls on my gr...",
        "subreddit": "BestofRedditorUpdates",
        "score": 7155,
        "mentions": [
          "civil",
          "aitah"
        ]
      },
      {
        "id": "1kwf53z",
        "title": "[Final Update] My stepmom kissed my boyfriend on the mouth...",
        "subreddit": "BestofRedditorUpdates",
        "score": 1834,
        "mentions": [
          "cold_river707",
          "aitah",
          "stronger"
        ]
      },
      {
        "id": "1kwnszm",
        "title": "AITA for not giving my sports cards back to my dad after he found out how much t...",
        "subreddit": "BestofRedditorUpdates",
        "score": 4696,
        "mentions": [
          "amitheasshole"
        ]
      },
      {
        "id": "1kwtnuc",
        "title": "[Help]My dog jumped out of the car window today and I’m broken...",
        "subreddit": "BestofRedditorUpdates",
        "score": 9015,
        "mentions": [
          "dogs"
        ]
      },
      {
        "id": "1kwulas",
        "title": "United let someone fly using my ticket......",
        "subreddit": "BestofRedditorUpdates",
        "score": 4541,
        "mentions": [
          "unitedairlines"
        ]
      },
      {
        "id": "1kwww8v",
        "title": "MIL finally show her true color, how should I approach this?...",
        "subreddit": "JUSTNOMIL",
        "score": 154,
        "mentions": [
          "controlling"
        ]
      },
      {
        "id": "1kwzo87",
        "title": "My ex-employer fired me and is threatening to sue me in civil court for refusing...",
        "subreddit": "legaladvice",
        "score": 388,
        "mentions": [
          "can",
          "can_my_employer_force_me_to_pay_for_the_business"
        ]
      },
      {
        "id": "1kx2bhh",
        "title": "TIFU by getting stuck in a playground in front of students, faculty, and parents...",
        "subreddit": "tifu",
        "score": 59,
        "mentions": [
          "teachers"
        ]
      },
      {
        "id": "1kx7mep",
        "title": "The women at my job made a list of the hottest guys and left me off of it (New U...",
        "subreddit": "BestofRedditorUpdates",
        "score": 6588,
        "mentions": [
          "trueoffmychest",
          "the"
        ]
      },
      {
        "id": "1kx7mgo",
        "title": "WIBTAH for breaking up with my gf for her getting a tattoo of her deceased ex's ...",
        "subreddit": "BestofRedditorUpdates",
        "score": 2502,
        "mentions": [
          "aitah"
        ]
      },
      {
        "id": "1kx7nue",
        "title": "AITA for planning a girls trip on my wedding anniversary date?...",
        "subreddit": "BestofRedditorUpdates",
        "score": 3648,
        "mentions": [
          "amitheasshole",
          "same"
        ]
      },
      {
        "id": "1kx7nwb",
        "title": "AITA for not wanting my fiancée's EX fiancée at our wedding?...",
        "subreddit": "BestofRedditorUpdates",
        "score": 1755,
        "mentions": [
          "aitah"
        ]
      },
      {
        "id": "1kx7p62",
        "title": "AITA for being furious that my BF used a keepsake of mine for his art without pe...",
        "subreddit": "BestofRedditorUpdates",
        "score": 5992,
        "mentions": [
          "amitheasshole"
        ]
      },
      {
        "id": "1kx7p7j",
        "title": "My Brother’s Fiancé Has Cut Off Our Whole Family, and I Don’t Know What to Do An...",
        "subreddit": "BestofRedditorUpdates",
        "score": 1132,
        "mentions": [
          "twohottakes"
        ]
      },
      {
        "id": "1kx84fy",
        "title": "This is my wedding cake which apparently became lopsided and collapsed before I ...",
        "subreddit": "BestofRedditorUpdates",
        "score": 3774,
        "mentions": [
          "cool",
          "baking",
          "venue"
        ]
      },
      {
        "id": "1kx84lv",
        "title": "AITAH for calling off my wedding after finding out my fiancé never had the money...",
        "subreddit": "BestofRedditorUpdates",
        "score": 5776,
        "mentions": [
          "calm_ad6711",
          "aitah"
        ]
      },
      {
        "id": "1kx8lz9",
        "title": "\"The room is absolutely filthy\"...",
        "subreddit": "TalesFromTheFrontDesk",
        "score": 433,
        "mentions": [
          "soap"
        ]
      },
      {
        "id": "1kx8u75",
        "title": "AITA for refusing to buy my boyfriend's daughter a gift and silencing his notifi...",
        "subreddit": "BestofRedditorUpdates",
        "score": 12319,
        "mentions": [
          "fragrant",
          "aitah"
        ]
      },
      {
        "id": "1kxi5ml",
        "title": "Not feeling like moving? There's a problem with the bill, sir...",
        "subreddit": "EntitledPeople",
        "score": 365,
        "mentions": [
          "pettyrevenge"
        ]
      },
      {
        "id": "1kxrjao",
        "title": "\"Do more announcements,\" they said. \"It will be fine,\" they said....",
        "subreddit": "MaliciousCompliance",
        "score": 734,
        "mentions": [
          "assistant",
          "obnoxious"
        ]
      },
      {
        "id": "1kxsuax",
        "title": "AITA for saying no to my Dad living with me?...",
        "subreddit": "AmItheAsshole",
        "score": 337,
        "mentions": [
          "liquor"
        ]
      },
      {
        "id": "1kxsw2z",
        "title": "Found out my new husband has cheated the past 5 years...",
        "subreddit": "survivinginfidelity",
        "score": 70,
        "mentions": [
          "bumble"
        ]
      },
      {
        "id": "1ky1efl",
        "title": "Am I wrong for being upset that my spouse bought the car he wanted?...",
        "subreddit": "BestofRedditorUpdates",
        "score": 2982,
        "mentions": [
          "amiwrong"
        ]
      },
      {
        "id": "1ky1f9r",
        "title": "WIBTA for cancelling my sister's wedding because it was my wedding first?...",
        "subreddit": "BestofRedditorUpdates",
        "score": 8380,
        "mentions": [
          "amitheasshole",
          "same",
          "mother"
        ]
      },
      {
        "id": "1ky1fsk",
        "title": "AITAH for telling my brother's GF she can't expect me to treat her kids like I t...",
        "subreddit": "BestofRedditorUpdates",
        "score": 2185,
        "mentions": [
          "aitah",
          "grandparents",
          "hero"
        ]
      },
      {
        "id": "1ky1gdy",
        "title": "AITA for refusing to tell my dad that I am buying a house until after I have mov...",
        "subreddit": "BestofRedditorUpdates",
        "score": 3046,
        "mentions": [
          "amitheasshole",
          "marknarrations"
        ]
      },
      {
        "id": "1ky1gle",
        "title": "AITA for refusing to go to my sisters wedding after finding out only our side of...",
        "subreddit": "BestofRedditorUpdates",
        "score": 2819,
        "mentions": [
          "one_change4503",
          "amitheasshole"
        ]
      },
      {
        "id": "1ky1mi6",
        "title": "AIO? Guy I’m dating gets up and peed in his room...",
        "subreddit": "BestofRedditorUpdates",
        "score": 2259,
        "mentions": [
          "cheesebee1",
          "amioverreacting"
        ]
      },
      {
        "id": "1ky3t30",
        "title": "Am I overreacting for cancelling a trip after finding out my friend planned secr...",
        "subreddit": "AmIOverreacting",
        "score": 622,
        "mentions": [
          "big"
        ]
      },
      {
        "id": "1ky9uw4",
        "title": "TIFU Accidentally Threatened Kidnapping...",
        "subreddit": "tifu",
        "score": 411,
        "mentions": [
          "grill"
        ]
      },
      {
        "id": "1kyadxq",
        "title": "Jetway Jesus-ing With Four Suitcases Woman...",
        "subreddit": "EntitledPeople",
        "score": 368,
        "mentions": [
          "wrestling"
        ]
      },
      {
        "id": "1kyaviy",
        "title": "WIBTA for not accepting an apology after being uninvited from an event? (New Upd...",
        "subreddit": "BestofRedditorUpdates",
        "score": 1818,
        "mentions": [
          "amitheasshole",
          "connectionfar2456",
          "amioverreacting",
          "lyntho",
          "magdovus"
        ]
      },
      {
        "id": "1kyd28p",
        "title": "You entered a monogamous relationship with your partner. They changed the rules ...",
        "subreddit": "survivinginfidelity",
        "score": 148,
        "mentions": [
          "no"
        ]
      },
      {
        "id": "1kydei8",
        "title": "ULPT : road rage revenge...",
        "subreddit": "UnethicalLifeProTips",
        "score": 51,
        "mentions": [
          "sidewalk"
        ]
      },
      {
        "id": "1kydyvo",
        "title": "AITAH for telling my friend she has to pay double if she wants to pay for two pe...",
        "subreddit": "BestofRedditorUpdates",
        "score": 4631,
        "mentions": [
          "aitah"
        ]
      },
      {
        "id": "1kygupv",
        "title": "Red Eyes Are the Best Type of Flights...",
        "subreddit": "unpopularopinion",
        "score": 342,
        "mentions": [
          "global"
        ]
      },
      {
        "id": "1kyjqt8",
        "title": "The deaths of an adult and a child should be treated as equally tragic....",
        "subreddit": "unpopularopinion",
        "score": 116,
        "mentions": [
          "war"
        ]
      },
      {
        "id": "1kylhw2",
        "title": "Admitting To Neglect On r/CPTSD…...",
        "subreddit": "AmITheDevil",
        "score": 67,
        "mentions": [
          "cptsd"
        ]
      },
      {
        "id": "1kyuurd",
        "title": "Husband has a new chosen family he prioritizes and sees every week, I’m jealous ...",
        "subreddit": "BestofRedditorUpdates",
        "score": 2390,
        "mentions": [
          "relationships"
        ]
      },
      {
        "id": "1kyuuth",
        "title": "My best friend is gonna be a dad in the same time than me and I hate it...",
        "subreddit": "BestofRedditorUpdates",
        "score": 585,
        "mentions": [
          "trueoffmychest"
        ]
      },
      {
        "id": "1kyuw9o",
        "title": "AITA for arranging potluck for my sister's Apology Dinner?...",
        "subreddit": "BestofRedditorUpdates",
        "score": 241,
        "mentions": [
          "amitheasshole",
          "tifu"
        ]
      },
      {
        "id": "1kyuwbf",
        "title": "AITA for not going to the birthday party my SIL planned for me?...",
        "subreddit": "BestofRedditorUpdates",
        "score": 289,
        "mentions": [
          "aita_wibta_public"
        ]
      },
      {
        "id": "1kyuxq2",
        "title": "My sister is pissed off that I stopped seeing our mom because shes being disgust...",
        "subreddit": "BestofRedditorUpdates",
        "score": 665,
        "mentions": [
          "trueoffmychest"
        ]
      },
      {
        "id": "1kyvane",
        "title": "AITA For Refusing to Pay My Cat-Sitter?...",
        "subreddit": "BestofRedditorUpdates",
        "score": 211,
        "mentions": [
          "catmom51525",
          "amitheasshole",
          "aita_for_refusing_to_pay_my_catsitter",
          "my"
        ]
      },
      {
        "id": "1kyvb0a",
        "title": "AITA for refusing to give up the master bedroom to a friend’s boyfriend during a...",
        "subreddit": "BestofRedditorUpdates",
        "score": 417,
        "mentions": [
          "wild_win9820",
          "amitheasshole",
          "winter"
        ]
      },
      {
        "id": "purmio",
        "title": "Cousin wanted me to Cater Strange Wedding For her Dad...",
        "subreddit": "bridezilla",
        "score": 50,
        "mentions": [
          "bridezillas"
        ]
      },
      {
        "id": "of87vt",
        "title": "I’m about to have a breakdown...",
        "subreddit": "bridezilla",
        "score": 138,
        "mentions": [
          "makeup"
        ]
      },
      {
        "id": "purmio",
        "title": "Cousin wanted me to Cater Strange Wedding For her Dad...",
        "subreddit": "bridezilla",
        "score": 54,
        "mentions": [
          "bridezillas"
        ]
      },
      {
        "id": "of87vt",
        "title": "I’m about to have a breakdown...",
        "subreddit": "bridezilla",
        "score": 133,
        "mentions": [
          "makeup"
        ]
      },
      {
        "id": "b32ars",
        "title": "Don't forget to put your memes and fake stories in /r/entitledparentsmemes, than...",
        "subreddit": "entitledparents",
        "score": 7495,
        "mentions": [
          "entitledparentsmemes"
        ]
      },
      {
        "id": "of87vt",
        "title": "I’m about to have a breakdown...",
        "subreddit": "bridezilla",
        "score": 135,
        "mentions": [
          "makeup"
        ]
      },
      {
        "id": "purmio",
        "title": "Cousin wanted me to Cater Strange Wedding For her Dad...",
        "subreddit": "bridezilla",
        "score": 53,
        "mentions": [
          "bridezillas"
        ]
      },
      {
        "id": "unlvd0",
        "title": "About r/NuclearRevenge...",
        "subreddit": "NuclearRevenge",
        "score": 99,
        "mentions": [
          "nuclearshame"
        ]
      },
      {
        "id": "w5khw1",
        "title": "Your bully son meses with us and you kill our dog? Prepare for dad......",
        "subreddit": "NuclearRevenge",
        "score": 6278,
        "mentions": [
          "prorevenge",
          "memes"
        ]
      },
      {
        "id": "xntb8f",
        "title": "Terrible boss gets his comeuppance...",
        "subreddit": "NuclearRevenge",
        "score": 1468,
        "mentions": [
          "pettyrevenge"
        ]
      },
      {
        "id": "z588ky",
        "title": "Welcome!...",
        "subreddit": "AmITheDevil",
        "score": 290,
        "mentions": [
          "amitheangel",
          "amitheasshole"
        ]
      },
      {
        "id": "zxnsrr",
        "title": "Harass my sweet little sister? Fine, I will get you evicted... Or worse....",
        "subreddit": "NuclearRevenge",
        "score": 978,
        "mentions": [
          "prorevenge"
        ]
      }
    ]
  }
}