{
  "id": "1kyff34",
  "title": "AITA for keeping inheritance from birth mother instead of splitting with adoptive siblings?",
  "body": "i just found out that my birth mother, who I have never met, left me her whole estate ($180k)! I was adopted at birth by a wonderful family with two other adopted kids.\n\nMy siblings are now saying that it isn't fair I got everything when they also \"deserve\" it being adopted as well. They want to split it three ways! My parents are staying neutral which I can tell is uncomfortable.\n\nThe thing is, this was MY birth mother. She chose to find me and leave me this money. My siblings have their own birth families they could easily have a connection to someday. For me, this feels like my one connection to where I came from.\n\nNow family dinners are awkward because my siblings barely talk to me. Am I being selfish keeping money that was legally left to me??",
  "author": "Important-Brain-2271",
  "subreddit": "AmItheAsshole",
  "url": "https://reddit.com/r/AmItheAsshole/comments/1kyff34/aita_for_keeping_inheritance_from_birth_mother/",
  "permalink": "/r/AmItheAsshole/comments/1kyff34/aita_for_keeping_inheritance_from_birth_mother/",
  "score": 6774,
  "num_comments": 823,
  "created_utc": 1748536608,
  "scraped_at": "2025-05-30T00:18:08.901Z",
  "comments": [
    {
      "id": "muwu7c7",
      "author": "Kami_Sang",
      "body": "NTA - your siblings are entitled and irrational.  It doesn't matter if they are adopted too - your birth mom (not theirs) left you something.  It's yours - the only thing you'll have from a woman who birthed you and clearly never stopped loving you.  Use this for something big - an education or towards a house.  Don't squander it.  Let it always remind you that the woman who conceived you never forgot you and always loved you.",
      "score": 9706,
      "created_utc": 1748537178
    },
    {
      "id": "muwt5n7",
      "author": "IamIrene",
      "body": "NTA. It was from *your* birth mother, not theirs. Fairness doesn't factor in - it's just what the situation is.\n\nHonestly, their attitude is pretty disgusting and greedy. \n\nYou are literally entitled to your inheritance, they are not. Don't give it up because of their bullying.\n\n~~If you feel bad about it, draw up a will and make them beneficiaries if you want to.~~ **On second thought**, lol...a few below have brought up a good point about a potential target being put on your back by doing this.  O_O Besides, rewarding greedy relatives in *any* way would certainly go against your birth mom's intentions.\n\nETA: Great comment by \n\n&gt;[Altruistic-Bunny: Think about getting a financial advisor. $180k seems like a lot, and is, but education and a home will eat that up fast.](https://old.reddit.com/r/AmItheAsshole/comments/1kyff34/aita_for_keeping_inheritance_from_birth_mother/mux3dd6/)",
      "score": 1833,
      "created_utc": 1748536887
    },
    {
      "id": "muwzb4r",
      "author": "Bluntandfiesty",
      "body": "NTA. Your birth mother is not their birth mother. She made the choice to leave her estate to her child. Even if she had other children too, she made a will and it’s legal and binding. She wants you to inherit her estate. \n\nYour siblings are absolutely not entitled to your inheritance. They’re entitled, greedy, and jealous. Your biological mother has no connection to them. Just because they were adopted too, doesn’t mean that everything you get is supposed to be split equally. \n\nYour parents are doing you and their other children a huge disservice as parents by not intervening on your behalf. They should be supporting you, and teaching or reinforcing their lessons that their other children are not entitled everything everyone else gets or has.",
      "score": 520,
      "created_utc": 1748538582
    },
    {
      "id": "muwx0lv",
      "author": "Greenelse",
      "body": "NTA. This was left to you, by YOUR birth mother who wanted to give you what she could to better your life. She did not want to give anything to your siblings who have no connection to her. I think it would be unfair to her to give them anything other than a slightly larger than usual holiday present, IF you still feel like it after this grotesque behavior. \n\nI have to say, I don’t think your parents are behaving well at all here. They should be firmly correcting your siblings. I suspect they have some jealous feelings themselves, that your birth mother was able to give you this.",
      "score": 272,
      "created_utc": 1748537952
    }
  ]
}